2025.08.16 11:52:34.493	EURUSD,M15: testing of Experts\Memento.mq5\Memento.ex5 from 2025.01.01 00:00 to 2025.08.04 00:00 started with inputs:
2025.08.16 11:52:34.493	  =
2025.08.16 11:52:34.493	  Inp_Enable_Dashboard=true
2025.08.16 11:52:34.494	  Inp_Symbols_List=EURUSD,GBPUSD,XAUUSD
2025.08.16 11:52:34.494	  Inp_Magic_Number=12345
2025.08.16 11:52:34.494	  Inp_Enable_Logging=true
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Ichimoku_Timeframe=15
2025.08.16 11:52:34.494	  Inp_Tenkan_Period=10
2025.08.16 11:52:34.494	  Inp_Kijun_Period=3
2025.08.16 11:52:34.494	  Inp_Senkou_Period=26
2025.08.16 11:52:34.494	  Inp_Chikou_Period=23
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Signal_Mode=1
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Entry_Confirmation_Mode=1
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Grace_Period_Mode=1
2025.08.16 11:52:34.494	  Inp_Grace_Period_Candles=7
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_LTF_Timeframe=15
2025.08.16 11:52:34.494	  Inp_Confirmation_Type=0
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Talaqi_Calculation_Mode=2
2025.08.16 11:52:34.494	  Inp_Talaqi_ATR_Multiplier=4.50
2025.08.16 11:52:34.494	  Inp_Talaqi_Distance_in_Points=548
2025.08.16 11:52:34.494	  Inp_Talaqi_Kumo_Factor=0.90
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_StopLoss_Type=2
2025.08.16 11:52:34.494	  Inp_SL_ATR_Multiplier=2.10
2025.08.16 11:52:34.494	  Inp_SL_Lookback_Period=32
2025.08.16 11:52:34.494	  Inp_SL_Buffer_Multiplier=35
2025.08.16 11:52:34.494	  Inp_Flat_Kijun_Period=38
2025.08.16 11:52:34.494	  Inp_Flat_Kijun_Min_Length=26
2025.08.16 11:52:34.494	  Inp_Pivot_Lookback=37
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Enable_SL_Vol_Regime=false
2025.08.16 11:52:34.494	  Inp_SL_Vol_Regime_ATR_Period=44
2025.08.16 11:52:34.494	  Inp_SL_Vol_Regime_EMA_Period=101
2025.08.16 11:52:34.494	  Inp_SL_High_Vol_Multiplier=4.40
2025.08.16 11:52:34.494	  Inp_SL_Low_Vol_Multiplier=10.20
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Risk_Percent_Per_Trade=0.7
2025.08.16 11:52:34.494	  Inp_Take_Profit_Ratio=6.90
2025.08.16 11:52:34.494	  Inp_Max_Trades_Per_Symbol=1
2025.08.16 11:52:34.494	  Inp_Max_Total_Trades=5
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Object_Size_Multiplier=1
2025.08.16 11:52:34.494	  Inp_Bullish_Color=3329330
2025.08.16 11:52:34.494	  Inp_Bearish_Color=255
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Enable_Kumo_Filter=true
2025.08.16 11:52:34.494	  Inp_Enable_ATR_Filter=true
2025.08.16 11:52:34.494	  Inp_ATR_Filter_Period=92
2025.08.16 11:52:34.494	  Inp_ATR_Filter_Min_Value_pips=13.5
2025.08.16 11:52:34.494	  Inp_Enable_ADX_Filter=false
2025.08.16 11:52:34.494	  Inp_ADX_Period=23
2025.08.16 11:52:34.494	  Inp_ADX_Threshold=67.5
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_Enable_Early_Exit=false
2025.08.16 11:52:34.494	  Inp_Early_Exit_RSI_Period=43
2025.08.16 11:52:34.494	  Inp_Early_Exit_RSI_Overbought=357
2025.08.16 11:52:34.494	  Inp_Early_Exit_RSI_Oversold=35
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_MSS_Swing_Length=10
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_MSS_Enable_Drawing=true
2025.08.16 11:52:34.494	  Inp_MSS_Enable_Logging=true
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  Inp_TSL_Enable=true
2025.08.16 11:52:34.494	  Inp_TSL_Activation_RR=4.8
2025.08.16 11:52:34.494	  Inp_BE_Enable=true
2025.08.16 11:52:34.494	  Inp_BE_Activation_RR=50
2025.08.16 11:52:34.494	  Inp_BE_Plus_Pips=22
2025.08.16 11:52:34.494	  Inp_TSL_Mode=1
2025.08.16 11:52:34.494	  =
2025.08.16 11:52:34.494	  InpMinTradesPerYear=30
2025.08.16 11:52:34.494	  InpMaxAcceptableDrawdown=15
2025.08.16 11:52:34.522	2025.01.01 00:00:00   [MSS Lib][EURUSD][PERIOD_M15]: کتابخانه MarketStructure برای EURUSD در PERIOD_M15 راه‌اندازی شد.
2025.08.16 11:52:34.522	2025.01.01 00:00:00   EURUSD: با موفقیت مقداردهی اولیه شد.
2025.08.16 11:52:34.522	GBPUSD: symbol to be synchronized
2025.08.16 11:52:34.523	GBPUSD: symbol synchronized, 3720 bytes of symbol info received
2025.08.16 11:52:34.557	GBPUSD: history synchronization started
2025.08.16 11:52:34.606	GBPUSD: load 27 bytes of history data to synchronize in 0:00:00.006
2025.08.16 11:52:34.606	GBPUSD: history synchronized from 1993.05.12 to 2025.08.13
2025.08.16 11:52:34.610	GBPUSD: ticks synchronization started
2025.08.16 11:52:34.610	GBPUSD: load 34 bytes of tick data to synchronize in 0:00:00.000
2025.08.16 11:52:34.610	GBPUSD: history ticks synchronized from 2024.01.02 to 2025.08.12
2025.08.16 11:52:34.675	GBPUSD,M15: history cache allocated for 39640 bars and contains 24897 bars from 2024.01.02 00:00 to 2024.12.31 23:45
2025.08.16 11:52:34.675	GBPUSD,M15: history begins from 2024.01.02 00:00
2025.08.16 11:52:34.696	2025.01.01 00:00:00   [MSS Lib][GBPUSD][PERIOD_M15]: کتابخانه MarketStructure برای GBPUSD در PERIOD_M15 راه‌اندازی شد.
2025.08.16 11:52:34.696	2025.01.01 00:00:00   GBPUSD: با موفقیت مقداردهی اولیه شد.
2025.08.16 11:52:34.696	XAUUSD: symbol to be synchronized
2025.08.16 11:52:34.697	XAUUSD: symbol synchronized, 3800 bytes of symbol info received
2025.08.16 11:52:34.703	XAUUSD: history synchronization started
2025.08.16 11:52:34.709	XAUUSD: load 27 bytes of history data to synchronize in 0:00:00.001
2025.08.16 11:52:34.709	XAUUSD: history synchronized from 2023.01.03 to 2025.08.13
2025.08.16 11:52:34.710	XAUUSD: ticks synchronization started
2025.08.16 11:52:34.710	XAUUSD: load 34 bytes of tick data to synchronize in 0:00:00.000
2025.08.16 11:52:34.710	XAUUSD: history ticks synchronized from 2025.05.27 to 2025.08.12
2025.08.16 11:52:34.780	XAUUSD,M15: history cache allocated for 38481 bars and contains 23738 bars from 2024.01.02 01:00 to 2024.12.31 23:45
2025.08.16 11:52:34.780	XAUUSD,M15: history begins from 2024.01.02 01:00
2025.08.16 11:52:34.783	2025.01.01 00:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کتابخانه MarketStructure برای XAUUSD در PERIOD_M15 راه‌اندازی شد.
2025.08.16 11:52:34.783	2025.01.01 00:00:00   XAUUSD: با موفقیت مقداردهی اولیه شد.
2025.08.16 11:52:34.783	2025.01.01 00:00:00   اکسپرت Memento با موفقیت برای نمادهای زیر مقداردهی اولیه شد: EURUSD,GBPUSD,XAUUSD
2025.08.16 11:52:34.783	2025.01.01 00:00:00   TSL Manager [12345]: کتابخانه Universal Trailing/BE با موفقیت برای مجیک نامبر 12345 فعال شد.
2025.08.16 11:52:36.576	EURUSD : 2025.05.27 23:59 - real ticks absent for 599 minutes out of 1394 total minute bars within a day
2025.08.16 11:52:37.369	EURUSD : real ticks begin from 2024.01.02 00:00:00
2025.08.16 11:52:37.369	EURUSD : 2025.01.01 00:00 - 2025.08.04 00:00  real ticks absent for 599 minutes of 217278 total minute bars, every tick generation used
2025.08.16 11:52:39.049	GBPUSD : 2025.05.27 23:59 - real ticks absent for 607 minutes out of 1392 total minute bars within a day
2025.08.16 11:52:39.846	GBPUSD : real ticks begin from 2024.01.02 00:00:00
2025.08.16 11:52:39.846	GBPUSD : 2025.01.01 00:00 - 2025.08.04 00:00  real ticks absent for 607 minutes of 217229 total minute bars, every tick generation used
2025.08.16 11:52:40.728	XAUUSD : 2025.05.27 23:59 - real ticks absent for 559 minutes out of 1343 total minute bars within a day
2025.08.16 11:52:41.460	XAUUSD : real ticks begin from 2025.05.27 00:00:00
2025.08.16 11:52:41.460	XAUUSD : 2025.01.01 00:00 - 2025.08.04 00:00  real ticks absent for 559 minutes of 205895 total minute bars, every tick generation used
2025.08.16 11:52:41.514	2025.01.01 00:00:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:52:41.670	2025.01.02 01:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:52:41.678	2025.01.02 02:15:02   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:52:41.678	2025.01.02 02:15:02   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.25040
2025.08.16 11:52:41.678	2025.01.02 02:15:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:41.678	2025.01.02 02:15:02   0.00000 , 1.25040
2025.08.16 11:52:41.690	2025.01.02 03:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03518 به لیست اضافه شد.
2025.08.16 11:52:41.719	2025.01.02 04:15:03   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03601 به لیست اضافه شد.
2025.08.16 11:52:41.740	2025.01.02 05:30:12   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03444
2025.08.16 11:52:41.740	2025.01.02 05:30:12   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:41.740	2025.01.02 05:30:12   0.00000 , 1.03444
2025.08.16 11:52:41.781	2025.01.02 08:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03757
2025.08.16 11:52:41.782	2025.01.02 08:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:52:41.782	2025.01.02 08:30:01   0.00000 , 1.03757
2025.08.16 11:52:41.787	2025.01.02 08:45:03   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.25403
2025.08.16 11:52:41.787	2025.01.02 08:45:03   POPULATED! New swing high prices data is as below:
2025.08.16 11:52:41.787	2025.01.02 08:45:03   0.00000 , 1.25403
2025.08.16 11:52:41.885	2025.01.02 10:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03601) منقضی شد و حذف می‌شود.
2025.08.16 11:52:41.885	2025.01.02 10:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03579 به لیست اضافه شد.
2025.08.16 11:52:41.885	2025.01.02 10:15:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03579) منقضی شد و حذف می‌شود.
2025.08.16 11:52:41.891	2025.01.02 10:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:52:41.891	2025.01.02 10:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.25040
2025.08.16 11:52:41.891	2025.01.02 10:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:52:41.955	2025.01.02 10:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03461 به لیست اضافه شد.
2025.08.16 11:52:42.038	2025.01.02 11:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:52:42.049	2025.01.02 12:15:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03724
2025.08.16 11:52:42.049	2025.01.02 12:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:52:42.049	2025.01.02 12:15:01   1.03757 , 1.03724
2025.08.16 11:52:42.122	2025.01.02 12:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.03444
2025.08.16 11:52:42.122	2025.01.02 12:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:52:42.122	2025.01.02 12:45:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:52:42.123	2025.01.02 12:45:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:52:42.286	2025.01.02 14:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2646.37000
2025.08.16 11:52:42.286	2025.01.02 14:45:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:52:42.286	2025.01.02 14:45:00      0.00000 , 2646.37000
2025.08.16 11:52:42.361	2025.01.02 15:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03136
2025.08.16 11:52:42.361	2025.01.02 15:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:42.361	2025.01.02 15:15:01   1.03444 , 1.03136
2025.08.16 11:52:42.512	2025.01.02 16:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2646.37000
2025.08.16 11:52:42.512	2025.01.02 16:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:52:42.512	2025.01.02 16:15:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:52:42.512	2025.01.02 16:15:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:52:42.512	2025.01.02 16:15:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:52:42.512	2025.01.02 16:15:00   market buy 0.04 XAUUSD sl: 2641.09 tp: 2687.91 (2646.90 / 2647.02 / 2646.90)
2025.08.16 11:52:42.512	2025.01.02 16:15:00   deal #2 buy 0.04 XAUUSD at 2647.02 done (based on order #2)
2025.08.16 11:52:42.512	2025.01.02 16:15:00   deal performed [#2 buy 0.04 XAUUSD at 2647.02]
2025.08.16 11:52:42.512	2025.01.02 16:15:00   order performed buy 0.04 at 2647.02 [#2 buy 0.04 XAUUSD at 2647.02]
2025.08.16 11:52:42.519	2025.01.02 16:15:00   CTrade::OrderSend: market buy 0.04 XAUUSD sl: 2641.09 tp: 2687.91 [done at 2647.02]
2025.08.16 11:52:42.519	2025.01.02 16:15:00   XAUUSD: معامله Memento Buy با لات 0.04 با موفقیت باز شد.
2025.08.16 11:52:42.519	2025.01.02 16:15:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:52:42.577	2025.01.02 16:15:01   TSL Manager [12345]: حالت جدید برای تیکت 2 با SL اولیه 2641.09 اضافه شد.
2025.08.16 11:52:42.577	2025.01.02 16:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.03136
2025.08.16 11:52:42.577	2025.01.02 16:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:52:42.577	2025.01.02 16:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:52:42.577	2025.01.02 16:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:52:42.577	2025.01.02 16:15:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:52:42.981	2025.01.02 20:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02239
2025.08.16 11:52:42.981	2025.01.02 20:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:42.981	2025.01.02 20:30:01   1.03136 , 1.02239
2025.08.16 11:52:42.981	2025.01.02 20:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23527
2025.08.16 11:52:43.042	2025.01.02 20:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:43.042	2025.01.02 20:30:01   1.25040 , 1.23527
2025.08.16 11:52:43.134	2025.01.03 00:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02685 به لیست اضافه شد.
2025.08.16 11:52:43.134	2025.01.03 00:00:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02685) منقضی شد و حذف می‌شود.
2025.08.16 11:52:43.134	2025.01.03 00:00:34   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:52:43.136	2025.01.03 00:15:24   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02478
2025.08.16 11:52:43.136	2025.01.03 00:15:24   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:43.136	2025.01.03 00:15:24   1.02239 , 1.02478
2025.08.16 11:52:43.272	2025.01.03 01:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23849
2025.08.16 11:52:43.272	2025.01.03 01:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:52:43.272	2025.01.03 01:00:01   1.25403 , 1.23849
2025.08.16 11:52:43.275	2025.01.03 01:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02666 به لیست اضافه شد.
2025.08.16 11:52:43.279	2025.01.03 01:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02666) منقضی شد و حذف می‌شود.
2025.08.16 11:52:43.293	2025.01.03 02:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23629
2025.08.16 11:52:43.293	2025.01.03 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:43.293	2025.01.03 02:30:01   1.23527 , 1.23629
2025.08.16 11:52:43.431	2025.01.03 03:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.23849
2025.08.16 11:52:43.431	2025.01.03 03:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:52:43.431	2025.01.03 03:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:52:43.431	2025.01.03 03:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:52:43.655	2025.01.03 07:15:04   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02745
2025.08.16 11:52:43.655	2025.01.03 07:15:04   POPULATED! New swing high prices data is as below:
2025.08.16 11:52:43.655	2025.01.03 07:15:04   1.03724 , 1.02745
2025.08.16 11:52:43.738	2025.01.03 08:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02724 به لیست اضافه شد.
2025.08.16 11:52:43.738	2025.01.03 08:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02724) منقضی شد و حذف می‌شود.
2025.08.16 11:52:43.743	2025.01.03 08:15:02   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.02745
2025.08.16 11:52:43.743	2025.01.03 08:15:02   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:52:43.911	2025.01.03 09:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02645
2025.08.16 11:52:43.911	2025.01.03 09:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:43.911	2025.01.03 09:45:01   1.02478 , 1.02645
2025.08.16 11:52:43.911	2025.01.03 09:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23862
2025.08.16 11:52:43.911	2025.01.03 09:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:43.911	2025.01.03 09:45:01   1.23629 , 1.23862
2025.08.16 11:52:44.055	2025.01.03 12:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:52:44.060	2025.01.03 12:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02836 به لیست اضافه شد.
2025.08.16 11:52:44.163	2025.01.03 14:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03028 به لیست اضافه شد.
2025.08.16 11:52:44.163	2025.01.03 14:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03028) منقضی شد و حذف می‌شود.
2025.08.16 11:52:44.163	2025.01.03 14:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24165
2025.08.16 11:52:44.163	2025.01.03 14:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:52:44.163	2025.01.03 14:00:01   1.23849 , 1.24165
2025.08.16 11:52:44.252	2025.01.03 14:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23864
2025.08.16 11:52:44.252	2025.01.03 14:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:44.252	2025.01.03 14:45:01   1.23862 , 1.23864
2025.08.16 11:52:44.449	2025.01.03 16:15:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03028
2025.08.16 11:52:44.449	2025.01.03 16:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:52:44.449	2025.01.03 16:15:01   1.02745 , 1.03028
2025.08.16 11:52:44.449	2025.01.03 16:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:52:44.464	2025.01.03 16:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02918 به لیست اضافه شد.
2025.08.16 11:52:44.660	2025.01.03 17:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:52:44.665	2025.01.03 17:21:15   stop loss triggered #2 buy 0.04 XAUUSD 2647.02 sl: 2641.09 tp: 2687.91 [#3 sell 0.04 XAUUSD at 2641.09]
2025.08.16 11:52:44.665	2025.01.03 17:21:15   deal #3 sell 0.04 XAUUSD at 2641.09 done (based on order #3)
2025.08.16 11:52:44.665	2025.01.03 17:21:15   deal performed [#3 sell 0.04 XAUUSD at 2641.09]
2025.08.16 11:52:44.665	2025.01.03 17:21:15   order performed sell 0.04 at 2641.09 [#3 sell 0.04 XAUUSD at 2641.09]
2025.08.16 11:52:44.665	2025.01.03 17:21:16   TSL Manager [12345]: حالت تیکت 2 از لیست تریلینگ حذف شد.
2025.08.16 11:52:44.665	2025.01.03 17:21:16   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:52:44.747	2025.01.03 17:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:52:44.936	2025.01.03 19:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24165
2025.08.16 11:52:44.936	2025.01.03 19:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:52:45.013	2025.01.03 19:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03057
2025.08.16 11:52:45.013	2025.01.03 19:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:52:45.013	2025.01.03 19:30:01   1.03028 , 1.03057
2025.08.16 11:52:45.092	2025.01.03 20:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02728
2025.08.16 11:52:45.092	2025.01.03 20:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:45.092	2025.01.03 20:00:01   1.02645 , 1.02728
2025.08.16 11:52:45.092	2025.01.03 20:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23881
2025.08.16 11:52:45.092	2025.01.03 20:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:52:45.092	2025.01.03 20:00:01   1.23864 , 1.23881
2025.08.16 11:52:45.204	2025.01.03 22:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03057
2025.08.16 11:52:45.204	2025.01.03 22:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:09.056	2025.01.06 00:45:12   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24339
2025.08.16 11:55:09.057	2025.01.06 00:45:12   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:09.057	2025.01.06 00:45:12   1.24165 , 1.24339
2025.08.16 11:55:09.057	2025.01.06 01:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03052 به لیست اضافه شد.
2025.08.16 11:55:09.057	2025.01.06 01:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03098
2025.08.16 11:55:09.057	2025.01.06 01:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:09.057	2025.01.06 01:30:01   1.03057 , 1.03098
2025.08.16 11:55:09.134	2025.01.06 02:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03079 به لیست اضافه شد.
2025.08.16 11:55:09.134	2025.01.06 02:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03079) منقضی شد و حذف می‌شود.
2025.08.16 11:55:09.134	2025.01.06 02:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03053 به لیست اضافه شد.
2025.08.16 11:55:09.134	2025.01.06 02:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03053) منقضی شد و حذف می‌شود.
2025.08.16 11:55:09.134	2025.01.06 02:30:02   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24078
2025.08.16 11:55:09.134	2025.01.06 02:30:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:09.134	2025.01.06 02:30:02   1.23881 , 1.24078
2025.08.16 11:55:09.149	2025.01.06 03:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02967 به لیست اضافه شد.
2025.08.16 11:55:09.149	2025.01.06 03:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2636.51000
2025.08.16 11:55:09.149	2025.01.06 03:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:09.149	2025.01.06 03:00:00      0.00000 , 2636.51000
2025.08.16 11:55:09.149	2025.01.06 03:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03028 به لیست اضافه شد.
2025.08.16 11:55:09.149	2025.01.06 03:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03028 به لیست اضافه شد.
2025.08.16 11:55:09.212	2025.01.06 03:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24339
2025.08.16 11:55:09.212	2025.01.06 03:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:09.212	2025.01.06 03:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:09.212	2025.01.06 03:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:09.243	2025.01.06 04:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03098
2025.08.16 11:55:09.243	2025.01.06 04:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:09.243	2025.01.06 04:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:09.243	2025.01.06 04:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:09.243	2025.01.06 04:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03107 به لیست اضافه شد.
2025.08.16 11:55:09.327	2025.01.06 05:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02955
2025.08.16 11:55:09.327	2025.01.06 05:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:09.327	2025.01.06 05:00:01   1.02728 , 1.02955
2025.08.16 11:55:09.405	2025.01.06 05:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2647.41000
2025.08.16 11:55:09.405	2025.01.06 05:45:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:09.405	2025.01.06 05:45:00   2646.37000 , 2647.41000
2025.08.16 11:55:09.467	2025.01.06 06:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24424
2025.08.16 11:55:09.483	2025.01.06 06:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:09.483	2025.01.06 06:30:01   1.24339 , 1.24424
2025.08.16 11:55:09.600	2025.01.06 07:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2636.51000
2025.08.16 11:55:09.600	2025.01.06 07:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:09.700	2025.01.06 08:15:02   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03181
2025.08.16 11:55:09.700	2025.01.06 08:15:02   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:09.700	2025.01.06 08:15:02   1.03098 , 1.03181
2025.08.16 11:55:09.763	2025.01.06 08:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24424
2025.08.16 11:55:09.763	2025.01.06 08:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:09.763	2025.01.06 08:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:09.763	2025.01.06 08:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:09.841	2025.01.06 09:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03181
2025.08.16 11:55:09.841	2025.01.06 09:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:09.841	2025.01.06 09:30:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:09.841	2025.01.06 09:30:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:09.927	2025.01.06 10:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03076
2025.08.16 11:55:09.927	2025.01.06 10:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:09.927	2025.01.06 10:45:01   1.02955 , 1.03076
2025.08.16 11:55:10.020	2025.01.06 12:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2625.18000
2025.08.16 11:55:10.020	2025.01.06 12:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:10.020	2025.01.06 12:00:00   2636.51000 , 2625.18000
2025.08.16 11:55:10.240	2025.01.06 13:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03788 به لیست اضافه شد.
2025.08.16 11:55:10.256	2025.01.06 13:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2647.41000
2025.08.16 11:55:10.256	2025.01.06 13:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:10.256	2025.01.06 13:45:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:10.256	2025.01.06 13:45:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:10.256	2025.01.06 13:45:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:10.256	2025.01.06 13:45:00   market buy 0.03 XAUUSD sl: 2642.97 tp: 2690.58 (2648.87 / 2649.00 / 2648.87)
2025.08.16 11:55:10.256	2025.01.06 13:45:00   deal #4 buy 0.03 XAUUSD at 2649.00 done (based on order #4)
2025.08.16 11:55:10.256	2025.01.06 13:45:00   deal performed [#4 buy 0.03 XAUUSD at 2649.00]
2025.08.16 11:55:10.256	2025.01.06 13:45:00   order performed buy 0.03 at 2649.00 [#4 buy 0.03 XAUUSD at 2649.00]
2025.08.16 11:55:10.271	2025.01.06 13:45:00   CTrade::OrderSend: market buy 0.03 XAUUSD sl: 2642.97 tp: 2690.58 [done at 2649.00]
2025.08.16 11:55:10.271	2025.01.06 13:45:00   XAUUSD: معامله Memento Buy با لات 0.03 با موفقیت باز شد.
2025.08.16 11:55:10.271	2025.01.06 13:45:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:10.328	2025.01.06 13:45:01   TSL Manager [12345]: حالت جدید برای تیکت 4 با SL اولیه 2642.97 اضافه شد.
2025.08.16 11:55:10.329	2025.01.06 13:45:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:10.409	2025.01.06 14:12:30   stop loss triggered #4 buy 0.03 XAUUSD 2649.00 sl: 2642.97 tp: 2690.58 [#5 sell 0.03 XAUUSD at 2642.97]
2025.08.16 11:55:10.409	2025.01.06 14:12:30   deal #5 sell 0.03 XAUUSD at 2642.96 done (based on order #5)
2025.08.16 11:55:10.409	2025.01.06 14:12:30   deal performed [#5 sell 0.03 XAUUSD at 2642.96]
2025.08.16 11:55:10.409	2025.01.06 14:12:30   order performed sell 0.03 at 2642.96 [#5 sell 0.03 XAUUSD at 2642.97]
2025.08.16 11:55:10.409	2025.01.06 14:12:31   TSL Manager [12345]: حالت تیکت 4 از لیست تریلینگ حذف شد.
2025.08.16 11:55:10.409	2025.01.06 14:12:31   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:10.568	2025.01.06 15:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03288
2025.08.16 11:55:10.568	2025.01.06 15:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:10.568	2025.01.06 15:30:01   1.03076 , 1.03288
2025.08.16 11:55:10.568	2025.01.06 15:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24554
2025.08.16 11:55:10.568	2025.01.06 15:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:10.568	2025.01.06 15:30:01   1.24078 , 1.24554
2025.08.16 11:55:10.701	2025.01.06 15:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04356 به لیست اضافه شد.
2025.08.16 11:55:10.701	2025.01.06 15:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04356) منقضی شد و حذف می‌شود.
2025.08.16 11:55:10.788	2025.01.06 16:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.25508
2025.08.16 11:55:10.788	2025.01.06 16:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:10.788	2025.01.06 16:30:01   1.24424 , 1.25508
2025.08.16 11:55:10.803	2025.01.06 17:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03709 به لیست اضافه شد.
2025.08.16 11:55:10.812	2025.01.06 17:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03800 به لیست اضافه شد.
2025.08.16 11:55:10.821	2025.01.06 17:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03757 به لیست اضافه شد.
2025.08.16 11:55:10.829	2025.01.06 17:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04365
2025.08.16 11:55:10.829	2025.01.06 17:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:10.829	2025.01.06 17:45:01   1.03181 , 1.04365
2025.08.16 11:55:10.921	2025.01.06 18:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2614.45000
2025.08.16 11:55:10.921	2025.01.06 18:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:10.921	2025.01.06 18:45:00   2625.18000 , 2614.45000
2025.08.16 11:55:10.921	2025.01.06 18:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03530
2025.08.16 11:55:10.921	2025.01.06 18:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:10.921	2025.01.06 18:45:01   1.03288 , 1.03530
2025.08.16 11:55:10.921	2025.01.06 18:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24654
2025.08.16 11:55:10.982	2025.01.06 18:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:10.982	2025.01.06 18:45:01   1.24554 , 1.24654
2025.08.16 11:55:11.099	2025.01.06 21:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2641.28000
2025.08.16 11:55:11.099	2025.01.06 21:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:11.099	2025.01.06 21:15:00   2647.41000 , 2641.28000
2025.08.16 11:55:11.324	2025.01.06 23:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2632.66000
2025.08.16 11:55:11.324	2025.01.06 23:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:11.324	2025.01.06 23:30:00   2614.45000 , 2632.66000
2025.08.16 11:55:11.408	2025.01.07 01:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:11.410	2025.01.07 01:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:11.412	2025.01.07 01:45:02   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03922
2025.08.16 11:55:11.412	2025.01.07 01:45:02   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:11.412	2025.01.07 01:45:02   1.04365 , 1.03922
2025.08.16 11:55:11.477	2025.01.07 02:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:11.477	2025.01.07 02:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.25235
2025.08.16 11:55:11.478	2025.01.07 02:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:11.478	2025.01.07 02:00:01   1.25508 , 1.25235
2025.08.16 11:55:11.481	2025.01.07 02:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:11.485	2025.01.07 02:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03763
2025.08.16 11:55:11.485	2025.01.07 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:11.485	2025.01.07 02:30:01   1.03530 , 1.03763
2025.08.16 11:55:11.485	2025.01.07 02:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24999
2025.08.16 11:55:11.485	2025.01.07 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:11.485	2025.01.07 02:30:01   1.24654 , 1.24999
2025.08.16 11:55:11.551	2025.01.07 02:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2637.11000
2025.08.16 11:55:11.551	2025.01.07 02:45:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:11.551	2025.01.07 02:45:00   2641.28000 , 2637.11000
2025.08.16 11:55:11.623	2025.01.07 03:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03775 به لیست اضافه شد.
2025.08.16 11:55:11.623	2025.01.07 03:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2637.11000
2025.08.16 11:55:11.623	2025.01.07 03:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:11.623	2025.01.07 03:15:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:11.623	2025.01.07 03:15:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:11.623	2025.01.07 03:15:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:11.623	2025.01.07 03:15:00   market buy 0.03 XAUUSD sl: 2630.37 tp: 2686.29 (2637.32 / 2637.45 / 2637.32)
2025.08.16 11:55:11.623	2025.01.07 03:15:00   deal #6 buy 0.03 XAUUSD at 2637.45 done (based on order #6)
2025.08.16 11:55:11.623	2025.01.07 03:15:00   deal performed [#6 buy 0.03 XAUUSD at 2637.45]
2025.08.16 11:55:11.623	2025.01.07 03:15:00   order performed buy 0.03 at 2637.45 [#6 buy 0.03 XAUUSD at 2637.45]
2025.08.16 11:55:11.625	2025.01.07 03:15:00   CTrade::OrderSend: market buy 0.03 XAUUSD sl: 2630.37 tp: 2686.29 [done at 2637.45]
2025.08.16 11:55:11.625	2025.01.07 03:15:00   XAUUSD: معامله Memento Buy با لات 0.03 با موفقیت باز شد.
2025.08.16 11:55:11.625	2025.01.07 03:15:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:11.690	2025.01.07 03:15:01   TSL Manager [12345]: حالت جدید برای تیکت 6 با SL اولیه 2630.37 اضافه شد.
2025.08.16 11:55:11.690	2025.01.07 03:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:11.690	2025.01.07 03:15:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:11.697	2025.01.07 03:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03783 به لیست اضافه شد.
2025.08.16 11:55:11.711	2025.01.07 04:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03808 به لیست اضافه شد.
2025.08.16 11:55:11.869	2025.01.07 05:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03854 به لیست اضافه شد.
2025.08.16 11:55:11.869	2025.01.07 05:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.25235
2025.08.16 11:55:11.869	2025.01.07 05:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:11.869	2025.01.07 05:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:11.869	2025.01.07 05:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:11.938	2025.01.07 05:45:06   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03922 به لیست اضافه شد.
2025.08.16 11:55:11.938	2025.01.07 05:45:06   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03922
2025.08.16 11:55:11.938	2025.01.07 05:45:06   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:11.938	2025.01.07 05:45:06   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:11.938	2025.01.07 05:45:06   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:12.018	2025.01.07 07:03:08   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03761
2025.08.16 11:55:12.018	2025.01.07 07:03:08   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:12.018	2025.01.07 07:03:08   1.03763 , 1.03761
2025.08.16 11:55:12.102	2025.01.07 07:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2632.98000
2025.08.16 11:55:12.102	2025.01.07 07:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:12.102	2025.01.07 07:45:00   2632.66000 , 2632.98000
2025.08.16 11:55:12.373	2025.01.07 10:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2646.78000
2025.08.16 11:55:12.373	2025.01.07 10:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:12.373	2025.01.07 10:30:00   2637.11000 , 2646.78000
2025.08.16 11:55:12.492	2025.01.07 13:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2638.04000
2025.08.16 11:55:12.492	2025.01.07 13:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:12.492	2025.01.07 13:00:00   2632.98000 , 2638.04000
2025.08.16 11:55:12.571	2025.01.07 13:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.25316
2025.08.16 11:55:12.571	2025.01.07 13:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:12.571	2025.01.07 13:30:01   1.24999 , 1.25316
2025.08.16 11:55:12.643	2025.01.07 13:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2646.78000
2025.08.16 11:55:12.643	2025.01.07 13:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:12.643	2025.01.07 13:45:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:12.643	2025.01.07 13:45:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:12.643	2025.01.07 13:45:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:12.643	2025.01.07 13:45:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:12.643	2025.01.07 13:45:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:12.736	2025.01.07 14:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04343
2025.08.16 11:55:12.736	2025.01.07 14:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:12.736	2025.01.07 14:45:01   1.03922 , 1.04343
2025.08.16 11:55:12.736	2025.01.07 14:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.25686
2025.08.16 11:55:12.736	2025.01.07 14:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:12.736	2025.01.07 14:45:01   1.25235 , 1.25686
2025.08.16 11:55:12.736	2025.01.07 14:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.25316
2025.08.16 11:55:12.736	2025.01.07 14:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:12.891	2025.01.07 15:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:12.892	2025.01.07 15:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03922) منقضی شد و حذف می‌شود.
2025.08.16 11:55:12.892	2025.01.07 15:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:12.910	2025.01.07 15:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04013 به لیست اضافه شد.
2025.08.16 11:55:12.910	2025.01.07 15:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04013 به لیست اضافه شد.
2025.08.16 11:55:12.989	2025.01.07 15:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:12.989	2025.01.07 15:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04013) منقضی شد و حذف می‌شود.
2025.08.16 11:55:12.989	2025.01.07 15:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:13.115	2025.01.07 17:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.03761
2025.08.16 11:55:13.115	2025.01.07 17:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:13.115	2025.01.07 17:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:13.115	2025.01.07 17:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:13.364	2025.01.07 20:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24802
2025.08.16 11:55:13.365	2025.01.07 20:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:13.365	2025.01.07 20:15:01   1.25316 , 1.24802
2025.08.16 11:55:13.505	2025.01.07 23:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24802
2025.08.16 11:55:13.505	2025.01.07 23:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:13.505	2025.01.07 23:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:13.505	2025.01.07 23:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:13.751	2025.01.08 01:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:13.767	2025.01.08 02:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24677
2025.08.16 11:55:13.768	2025.01.08 02:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:13.768	2025.01.08 02:15:01   1.24802 , 1.24677
2025.08.16 11:55:13.768	2025.01.08 02:15:02   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03364
2025.08.16 11:55:13.768	2025.01.08 02:15:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:13.768	2025.01.08 02:15:02   1.03761 , 1.03364
2025.08.16 11:55:13.900	2025.01.08 05:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03540 به لیست اضافه شد.
2025.08.16 11:55:13.905	2025.01.08 05:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03540 به لیست اضافه شد.
2025.08.16 11:55:13.905	2025.01.08 05:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03540) منقضی شد و حذف می‌شود.
2025.08.16 11:55:13.905	2025.01.08 05:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2651.52000
2025.08.16 11:55:13.905	2025.01.08 05:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:13.905	2025.01.08 05:15:00   2646.78000 , 2651.52000
2025.08.16 11:55:14.066	2025.01.08 06:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03474 به لیست اضافه شد.
2025.08.16 11:55:14.071	2025.01.08 06:30:02   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03547
2025.08.16 11:55:14.071	2025.01.08 06:30:02   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:14.071	2025.01.08 06:30:02   1.04343 , 1.03547
2025.08.16 11:55:14.072	2025.01.08 06:30:09   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24880
2025.08.16 11:55:14.072	2025.01.08 06:30:09   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:14.072	2025.01.08 06:30:09   1.25686 , 1.24880
2025.08.16 11:55:14.162	2025.01.08 07:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03547
2025.08.16 11:55:14.162	2025.01.08 07:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:14.239	2025.01.08 07:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03531 به لیست اضافه شد.
2025.08.16 11:55:14.243	2025.01.08 08:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24880
2025.08.16 11:55:14.243	2025.01.08 08:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:14.243	2025.01.08 08:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:14.243	2025.01.08 08:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:14.254	2025.01.08 08:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2651.52000
2025.08.16 11:55:14.255	2025.01.08 08:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:14.255	2025.01.08 08:30:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:14.255	2025.01.08 08:30:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:14.255	2025.01.08 08:30:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:14.255	2025.01.08 08:30:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:14.255	2025.01.08 08:30:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:14.347	2025.01.08 09:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2645.25000
2025.08.16 11:55:14.347	2025.01.08 09:15:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:14.347	2025.01.08 09:15:00   2638.04000 , 2645.25000
2025.08.16 11:55:14.353	2025.01.08 09:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03444 به لیست اضافه شد.
2025.08.16 11:55:14.353	2025.01.08 09:30:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03444) منقضی شد و حذف می‌شود.
2025.08.16 11:55:14.359	2025.01.08 09:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.03364
2025.08.16 11:55:14.359	2025.01.08 09:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:14.359	2025.01.08 09:45:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:14.359	2025.01.08 09:45:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:14.450	2025.01.08 10:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24677
2025.08.16 11:55:14.450	2025.01.08 10:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:14.459	2025.01.08 10:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03573
2025.08.16 11:55:14.459	2025.01.08 10:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:14.459	2025.01.08 10:30:01   1.03547 , 1.03573
2025.08.16 11:55:14.559	2025.01.08 11:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24937
2025.08.16 11:55:14.560	2025.01.08 11:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:14.560	2025.01.08 11:15:01   1.24880 , 1.24937
2025.08.16 11:55:14.780	2025.01.08 13:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03028) منقضی شد و حذف می‌شود.
2025.08.16 11:55:14.802	2025.01.08 14:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02845 به لیست اضافه شد.
2025.08.16 11:55:14.818	2025.01.08 14:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02928 به لیست اضافه شد.
2025.08.16 11:55:14.818	2025.01.08 14:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02928) منقضی شد و حذف می‌شود.
2025.08.16 11:55:14.834	2025.01.08 15:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2655.13000
2025.08.16 11:55:14.834	2025.01.08 15:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:14.834	2025.01.08 15:00:00   2651.52000 , 2655.13000
2025.08.16 11:55:14.994	2025.01.08 15:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02807 به لیست اضافه شد.
2025.08.16 11:55:14.994	2025.01.08 15:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2655.13000
2025.08.16 11:55:14.994	2025.01.08 15:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:14.994	2025.01.08 15:15:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:14.994	2025.01.08 15:15:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:14.994	2025.01.08 15:15:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:14.994	2025.01.08 15:15:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:14.994	2025.01.08 15:15:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:15.098	2025.01.08 16:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02732
2025.08.16 11:55:15.098	2025.01.08 16:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:15.098	2025.01.08 16:00:01   1.03364 , 1.02732
2025.08.16 11:55:15.202	2025.01.08 16:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2645.87000
2025.08.16 11:55:15.202	2025.01.08 16:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:15.203	2025.01.08 16:45:00   2645.25000 , 2645.87000
2025.08.16 11:55:15.287	2025.01.08 17:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23208
2025.08.16 11:55:15.287	2025.01.08 17:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:15.287	2025.01.08 17:00:01   1.24677 , 1.23208
2025.08.16 11:55:15.587	2025.01.08 19:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:15.792	2025.01.08 21:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03123 به لیست اضافه شد.
2025.08.16 11:55:15.792	2025.01.08 21:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2670.00000
2025.08.16 11:55:15.792	2025.01.08 21:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:15.792	2025.01.08 21:15:00   2655.13000 , 2670.00000
2025.08.16 11:55:15.792	2025.01.08 21:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23683
2025.08.16 11:55:15.792	2025.01.08 21:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:15.792	2025.01.08 21:15:01   1.24937 , 1.23683
2025.08.16 11:55:15.872	2025.01.08 21:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03228 به لیست اضافه شد.
2025.08.16 11:55:15.872	2025.01.08 21:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.23683
2025.08.16 11:55:15.872	2025.01.08 21:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:15.872	2025.01.08 21:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:15.872	2025.01.08 21:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:15.958	2025.01.08 22:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2649.52000
2025.08.16 11:55:15.958	2025.01.08 22:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:15.958	2025.01.08 22:00:00   2645.87000 , 2649.52000
2025.08.16 11:55:16.230	2025.01.08 23:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03242
2025.08.16 11:55:16.230	2025.01.08 23:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:16.230	2025.01.08 23:45:01   1.03573 , 1.03242
2025.08.16 11:55:16.230	2025.01.08 23:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23768
2025.08.16 11:55:16.230	2025.01.08 23:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:16.230	2025.01.08 23:45:01   1.23683 , 1.23768
2025.08.16 11:55:16.326	2025.01.09 01:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:16.342	2025.01.09 02:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2664.06000
2025.08.16 11:55:16.342	2025.01.09 02:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:16.342	2025.01.09 02:15:00   2670.00000 , 2664.06000
2025.08.16 11:55:16.426	2025.01.09 02:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03123 به لیست اضافه شد.
2025.08.16 11:55:16.426	2025.01.09 02:45:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03123) منقضی شد و حذف می‌شود.
2025.08.16 11:55:16.607	2025.01.09 04:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03171 به لیست اضافه شد.
2025.08.16 11:55:16.611	2025.01.09 04:30:02   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03171) منقضی شد و حذف می‌شود.
2025.08.16 11:55:16.619	2025.01.09 05:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03152 به لیست اضافه شد.
2025.08.16 11:55:16.619	2025.01.09 05:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23478
2025.08.16 11:55:16.619	2025.01.09 05:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:16.620	2025.01.09 05:00:01   1.23208 , 1.23478
2025.08.16 11:55:16.620	2025.01.09 05:00:03   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03048
2025.08.16 11:55:16.620	2025.01.09 05:00:03   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:16.620	2025.01.09 05:00:03   1.02732 , 1.03048
2025.08.16 11:55:16.704	2025.01.09 05:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03177 به لیست اضافه شد.
2025.08.16 11:55:16.708	2025.01.09 06:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:16.708	2025.01.09 06:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.23478
2025.08.16 11:55:16.708	2025.01.09 06:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:16.872	2025.01.09 06:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23649
2025.08.16 11:55:16.872	2025.01.09 06:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:16.872	2025.01.09 06:45:01   1.23768 , 1.23649
2025.08.16 11:55:17.031	2025.01.09 07:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03212
2025.08.16 11:55:17.031	2025.01.09 07:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:17.031	2025.01.09 07:30:01   1.03242 , 1.03212
2025.08.16 11:55:17.193	2025.01.09 08:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2662.19000
2025.08.16 11:55:17.193	2025.01.09 08:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:17.193	2025.01.09 08:00:00   2664.06000 , 2662.19000
2025.08.16 11:55:17.198	2025.01.09 08:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.03048
2025.08.16 11:55:17.198	2025.01.09 08:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:17.198	2025.01.09 08:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:17.198	2025.01.09 08:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:17.354	2025.01.09 08:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03009 به لیست اضافه شد.
2025.08.16 11:55:17.354	2025.01.09 08:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2662.19000
2025.08.16 11:55:17.354	2025.01.09 08:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:17.354	2025.01.09 08:45:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:17.354	2025.01.09 08:45:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:17.354	2025.01.09 08:45:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:17.354	2025.01.09 08:45:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:17.354	2025.01.09 08:45:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:17.360	2025.01.09 09:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2655.51000
2025.08.16 11:55:17.360	2025.01.09 09:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:17.360	2025.01.09 09:00:00   2649.52000 , 2655.51000
2025.08.16 11:55:17.727	2025.01.09 11:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2666.96000
2025.08.16 11:55:17.727	2025.01.09 11:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:17.727	2025.01.09 11:15:00   2662.19000 , 2666.96000
2025.08.16 11:55:17.836	2025.01.09 12:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02836
2025.08.16 11:55:17.836	2025.01.09 12:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:17.836	2025.01.09 12:30:01   1.03048 , 1.02836
2025.08.16 11:55:17.836	2025.01.09 12:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22383
2025.08.16 11:55:17.836	2025.01.09 12:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:17.836	2025.01.09 12:30:01   1.23478 , 1.22383
2025.08.16 11:55:17.916	2025.01.09 12:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2666.96000
2025.08.16 11:55:17.916	2025.01.09 12:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:17.917	2025.01.09 12:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:18.100	2025.01.09 13:29:30   position modified [#6 buy 0.03 XAUUSD 2637.45 sl: 2662.40 tp: 2686.29]
2025.08.16 11:55:18.102	2025.01.09 13:29:30   CTrade::OrderSend: modify position #6 XAUUSD (sl: 2662.40, tp: 2686.29) [done]
2025.08.16 11:55:18.102	2025.01.09 13:29:30   TSL Manager [12345]: تریلینگ استاپ برای تیکت 6 به قیمت 2662.40 آپدیت شد.
2025.08.16 11:55:18.186	2025.01.09 13:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03174
2025.08.16 11:55:18.186	2025.01.09 13:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:18.186	2025.01.09 13:45:01   1.03212 , 1.03174
2025.08.16 11:55:18.188	2025.01.09 13:47:40   position modified [#6 buy 0.03 XAUUSD 2637.45 sl: 2665.00 tp: 2686.29]
2025.08.16 11:55:18.190	2025.01.09 13:47:40   CTrade::OrderSend: modify position #6 XAUUSD (sl: 2665.00, tp: 2686.29) [done]
2025.08.16 11:55:18.190	2025.01.09 13:47:40   TSL Manager [12345]: تریلینگ استاپ برای تیکت 6 به قیمت 2665.00 آپدیت شد.
2025.08.16 11:55:18.272	2025.01.09 14:04:34   position modified [#6 buy 0.03 XAUUSD 2637.45 sl: 2665.40 tp: 2686.29]
2025.08.16 11:55:18.274	2025.01.09 14:04:34   CTrade::OrderSend: modify position #6 XAUUSD (sl: 2665.40, tp: 2686.29) [done]
2025.08.16 11:55:18.274	2025.01.09 14:04:34   TSL Manager [12345]: تریلینگ استاپ برای تیکت 6 به قیمت 2665.40 آپدیت شد.
2025.08.16 11:55:18.286	2025.01.09 14:30:00   position modified [#6 buy 0.03 XAUUSD 2637.45 sl: 2665.72 tp: 2686.29]
2025.08.16 11:55:18.288	2025.01.09 14:30:00   CTrade::OrderSend: modify position #6 XAUUSD (sl: 2665.72, tp: 2686.29) [done]
2025.08.16 11:55:18.288	2025.01.09 14:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 6 به قیمت 2665.72 آپدیت شد.
2025.08.16 11:55:18.298	2025.01.09 14:45:00   position modified [#6 buy 0.03 XAUUSD 2637.45 sl: 2666.65 tp: 2686.29]
2025.08.16 11:55:18.300	2025.01.09 14:45:00   CTrade::OrderSend: modify position #6 XAUUSD (sl: 2666.65, tp: 2686.29) [done]
2025.08.16 11:55:18.300	2025.01.09 14:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 6 به قیمت 2666.65 آپدیت شد.
2025.08.16 11:55:18.311	2025.01.09 15:00:00   position modified [#6 buy 0.03 XAUUSD 2637.45 sl: 2667.80 tp: 2686.29]
2025.08.16 11:55:18.313	2025.01.09 15:00:00   CTrade::OrderSend: modify position #6 XAUUSD (sl: 2667.80, tp: 2686.29) [done]
2025.08.16 11:55:18.313	2025.01.09 15:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 6 به قیمت 2667.80 آپدیت شد.
2025.08.16 11:55:18.324	2025.01.09 15:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03060 به لیست اضافه شد.
2025.08.16 11:55:18.332	2025.01.09 15:30:00   position modified [#6 buy 0.03 XAUUSD 2637.45 sl: 2668.63 tp: 2686.29]
2025.08.16 11:55:18.334	2025.01.09 15:30:00   CTrade::OrderSend: modify position #6 XAUUSD (sl: 2668.63, tp: 2686.29) [done]
2025.08.16 11:55:18.334	2025.01.09 15:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 6 به قیمت 2668.63 آپدیت شد.
2025.08.16 11:55:18.343	2025.01.09 15:45:00   position modified [#6 buy 0.03 XAUUSD 2637.45 sl: 2669.32 tp: 2686.29]
2025.08.16 11:55:18.345	2025.01.09 15:45:00   CTrade::OrderSend: modify position #6 XAUUSD (sl: 2669.32, tp: 2686.29) [done]
2025.08.16 11:55:18.345	2025.01.09 15:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 6 به قیمت 2669.32 آپدیت شد.
2025.08.16 11:55:18.521	2025.01.09 16:27:18   stop loss triggered #6 buy 0.03 XAUUSD 2637.45 sl: 2669.32 tp: 2686.29 [#7 sell 0.03 XAUUSD at 2669.32]
2025.08.16 11:55:18.521	2025.01.09 16:27:18   deal #7 sell 0.03 XAUUSD at 2669.31 done (based on order #7)
2025.08.16 11:55:18.521	2025.01.09 16:27:18   deal performed [#7 sell 0.03 XAUUSD at 2669.31]
2025.08.16 11:55:18.521	2025.01.09 16:27:18   order performed sell 0.03 at 2669.31 [#7 sell 0.03 XAUUSD at 2669.32]
2025.08.16 11:55:18.521	2025.01.09 16:27:19   TSL Manager [12345]: حالت تیکت 6 از لیست تریلینگ حذف شد.
2025.08.16 11:55:18.521	2025.01.09 16:27:19   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:18.539	2025.01.09 17:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02957
2025.08.16 11:55:18.539	2025.01.09 17:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:18.539	2025.01.09 17:00:01   1.02836 , 1.02957
2025.08.16 11:55:18.549	2025.01.09 17:15:03   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03060) منقضی شد و حذف می‌شود.
2025.08.16 11:55:18.634	2025.01.09 17:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:18.713	2025.01.09 18:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2678.23000
2025.08.16 11:55:18.713	2025.01.09 18:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:18.713	2025.01.09 18:00:00   2666.96000 , 2678.23000
2025.08.16 11:55:18.714	2025.01.09 18:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23228
2025.08.16 11:55:18.714	2025.01.09 18:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:18.714	2025.01.09 18:00:01   1.23649 , 1.23228
2025.08.16 11:55:18.714	2025.01.09 18:00:02   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03185
2025.08.16 11:55:18.716	2025.01.09 18:00:02   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:18.716	2025.01.09 18:00:02   1.03174 , 1.03185
2025.08.16 11:55:18.728	2025.01.09 18:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02957
2025.08.16 11:55:18.728	2025.01.09 18:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:18.728	2025.01.09 18:30:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:18.728	2025.01.09 18:30:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:18.893	2025.01.09 19:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03016 به لیست اضافه شد.
2025.08.16 11:55:18.893	2025.01.09 19:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03016) منقضی شد و حذف می‌شود.
2025.08.16 11:55:19.002	2025.01.09 21:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02910
2025.08.16 11:55:19.002	2025.01.09 21:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:19.002	2025.01.09 21:00:01   1.02957 , 1.02910
2025.08.16 11:55:19.002	2025.01.09 21:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22873
2025.08.16 11:55:19.002	2025.01.09 21:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:19.002	2025.01.09 21:00:01   1.22383 , 1.22873
2025.08.16 11:55:19.006	2025.01.09 21:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03019 به لیست اضافه شد.
2025.08.16 11:55:19.006	2025.01.09 21:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03019) منقضی شد و حذف می‌شود.
2025.08.16 11:55:19.010	2025.01.09 21:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03002 به لیست اضافه شد.
2025.08.16 11:55:19.019	2025.01.09 22:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2662.65000
2025.08.16 11:55:19.019	2025.01.09 22:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:19.019	2025.01.09 22:00:00   2655.51000 , 2662.65000
2025.08.16 11:55:19.177	2025.01.09 23:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2672.42000
2025.08.16 11:55:19.177	2025.01.09 23:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:19.177	2025.01.09 23:00:00   2678.23000 , 2672.42000
2025.08.16 11:55:19.184	2025.01.09 23:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:19.209	2025.01.10 01:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23151
2025.08.16 11:55:19.209	2025.01.10 01:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:19.209	2025.01.10 01:00:01   1.23228 , 1.23151
2025.08.16 11:55:19.213	2025.01.10 01:15:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03034
2025.08.16 11:55:19.213	2025.01.10 01:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:19.213	2025.01.10 01:15:01   1.03185 , 1.03034
2025.08.16 11:55:19.293	2025.01.10 02:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:19.297	2025.01.10 02:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02987 به لیست اضافه شد.
2025.08.16 11:55:19.301	2025.01.10 02:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2668.24000
2025.08.16 11:55:19.301	2025.01.10 02:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:19.301	2025.01.10 02:30:00   2662.65000 , 2668.24000
2025.08.16 11:55:19.301	2025.01.10 02:30:06   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:19.301	2025.01.10 02:30:06   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02987) منقضی شد و حذف می‌شود.
2025.08.16 11:55:19.301	2025.01.10 02:30:07   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:19.468	2025.01.10 03:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03013 به لیست اضافه شد.
2025.08.16 11:55:19.478	2025.01.10 04:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03006 به لیست اضافه شد.
2025.08.16 11:55:19.478	2025.01.10 04:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:19.483	2025.01.10 04:15:02   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03013) منقضی شد و حذف می‌شود.
2025.08.16 11:55:19.559	2025.01.10 04:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2672.42000
2025.08.16 11:55:19.559	2025.01.10 04:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:19.559	2025.01.10 04:30:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:19.559	2025.01.10 04:30:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:19.559	2025.01.10 04:30:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:19.559	2025.01.10 04:30:00   market buy 0.04 XAUUSD sl: 2667.89 tp: 2712.36 (2673.38 / 2673.52 / 2673.38)
2025.08.16 11:55:19.559	2025.01.10 04:30:00   deal #8 buy 0.04 XAUUSD at 2673.52 done (based on order #8)
2025.08.16 11:55:19.559	2025.01.10 04:30:00   deal performed [#8 buy 0.04 XAUUSD at 2673.52]
2025.08.16 11:55:19.559	2025.01.10 04:30:00   order performed buy 0.04 at 2673.52 [#8 buy 0.04 XAUUSD at 2673.52]
2025.08.16 11:55:19.561	2025.01.10 04:30:00   CTrade::OrderSend: market buy 0.04 XAUUSD sl: 2667.89 tp: 2712.36 [done at 2673.52]
2025.08.16 11:55:19.561	2025.01.10 04:30:00   XAUUSD: معامله Memento Buy با لات 0.04 با موفقیت باز شد.
2025.08.16 11:55:19.561	2025.01.10 04:30:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:19.563	2025.01.10 04:30:01   TSL Manager [12345]: حالت جدید برای تیکت 8 با SL اولیه 2667.89 اضافه شد.
2025.08.16 11:55:19.563	2025.01.10 04:30:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:19.644	2025.01.10 04:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:19.651	2025.01.10 05:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03016 به لیست اضافه شد.
2025.08.16 11:55:19.651	2025.01.10 05:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02921
2025.08.16 11:55:19.651	2025.01.10 05:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:19.651	2025.01.10 05:00:01   1.02910 , 1.02921
2025.08.16 11:55:19.652	2025.01.10 05:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22941
2025.08.16 11:55:19.652	2025.01.10 05:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:19.652	2025.01.10 05:00:01   1.22873 , 1.22941
2025.08.16 11:55:19.737	2025.01.10 05:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03016) منقضی شد و حذف می‌شود.
2025.08.16 11:55:19.748	2025.01.10 06:00:02   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03042
2025.08.16 11:55:19.748	2025.01.10 06:00:02   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:19.748	2025.01.10 06:00:02   1.03034 , 1.03042
2025.08.16 11:55:19.832	2025.01.10 06:30:08   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02973 به لیست اضافه شد.
2025.08.16 11:55:19.837	2025.01.10 06:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.22941
2025.08.16 11:55:19.837	2025.01.10 06:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:19.837	2025.01.10 06:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:19.837	2025.01.10 06:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:19.945	2025.01.10 08:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02921
2025.08.16 11:55:19.945	2025.01.10 08:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:19.945	2025.01.10 08:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:19.945	2025.01.10 08:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:20.140	2025.01.10 09:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2671.57000
2025.08.16 11:55:20.140	2025.01.10 09:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:20.140	2025.01.10 09:30:00   2668.24000 , 2671.57000
2025.08.16 11:55:20.239	2025.01.10 10:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02973) منقضی شد و حذف می‌شود.
2025.08.16 11:55:20.247	2025.01.10 10:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03013 به لیست اضافه شد.
2025.08.16 11:55:20.248	2025.01.10 10:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03013) منقضی شد و حذف می‌شود.
2025.08.16 11:55:20.261	2025.01.10 10:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03042
2025.08.16 11:55:20.261	2025.01.10 10:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:20.352	2025.01.10 11:15:02   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22661
2025.08.16 11:55:20.352	2025.01.10 11:15:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:20.352	2025.01.10 11:15:02   1.22941 , 1.22661
2025.08.16 11:55:20.436	2025.01.10 11:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02811
2025.08.16 11:55:20.436	2025.01.10 11:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:20.436	2025.01.10 11:30:01   1.02921 , 1.02811
2025.08.16 11:55:20.520	2025.01.10 11:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03047 به لیست اضافه شد.
2025.08.16 11:55:20.520	2025.01.10 11:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03047 به لیست اضافه شد.
2025.08.16 11:55:20.530	2025.01.10 12:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03047) منقضی شد و حذف می‌شود.
2025.08.16 11:55:20.530	2025.01.10 12:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:20.611	2025.01.10 12:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03026 به لیست اضافه شد.
2025.08.16 11:55:20.612	2025.01.10 12:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:20.620	2025.01.10 12:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03049 به لیست اضافه شد.
2025.08.16 11:55:20.638	2025.01.10 13:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03026) منقضی شد و حذف می‌شود.
2025.08.16 11:55:20.638	2025.01.10 13:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03117
2025.08.16 11:55:20.638	2025.01.10 13:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:20.638	2025.01.10 13:00:01   1.03042 , 1.03117
2025.08.16 11:55:20.646	2025.01.10 13:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:20.739	2025.01.10 14:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23078
2025.08.16 11:55:20.739	2025.01.10 14:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:20.739	2025.01.10 14:00:01   1.23151 , 1.23078
2025.08.16 11:55:20.911	2025.01.10 14:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.23078
2025.08.16 11:55:20.911	2025.01.10 14:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:21.032	2025.01.10 15:30:35   stop loss triggered #8 buy 0.04 XAUUSD 2673.52 sl: 2667.89 tp: 2712.36 [#9 sell 0.04 XAUUSD at 2667.89]
2025.08.16 11:55:21.032	2025.01.10 15:30:35   deal #9 sell 0.04 XAUUSD at 2667.89 done (based on order #9)
2025.08.16 11:55:21.032	2025.01.10 15:30:35   deal performed [#9 sell 0.04 XAUUSD at 2667.89]
2025.08.16 11:55:21.032	2025.01.10 15:30:35   order performed sell 0.04 at 2667.89 [#9 sell 0.04 XAUUSD at 2667.89]
2025.08.16 11:55:21.032	2025.01.10 15:30:36   TSL Manager [12345]: حالت تیکت 8 از لیست تریلینگ حذف شد.
2025.08.16 11:55:21.032	2025.01.10 15:30:36   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:21.118	2025.01.10 15:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02505 به لیست اضافه شد.
2025.08.16 11:55:21.118	2025.01.10 15:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02811
2025.08.16 11:55:21.118	2025.01.10 15:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:21.118	2025.01.10 15:45:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:21.118	2025.01.10 15:45:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:21.119	2025.01.10 15:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02505 به لیست اضافه شد.
2025.08.16 11:55:21.119	2025.01.10 15:45:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02505) منقضی شد و حذف می‌شود.
2025.08.16 11:55:21.119	2025.01.10 15:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.22661
2025.08.16 11:55:21.119	2025.01.10 15:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:21.119	2025.01.10 15:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:21.119	2025.01.10 15:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:21.128	2025.01.10 16:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02380 به لیست اضافه شد.
2025.08.16 11:55:21.128	2025.01.10 16:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02505) منقضی شد و حذف می‌شود.
2025.08.16 11:55:21.341	2025.01.10 17:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23215
2025.08.16 11:55:21.342	2025.01.10 17:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:21.342	2025.01.10 17:30:01   1.23078 , 1.23215
2025.08.16 11:55:21.431	2025.01.10 17:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03117
2025.08.16 11:55:21.431	2025.01.10 17:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:21.431	2025.01.10 17:45:01   1.03117 , 1.03117
2025.08.16 11:55:21.514	2025.01.10 18:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2663.96000
2025.08.16 11:55:21.514	2025.01.10 18:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:21.514	2025.01.10 18:00:00   2671.57000 , 2663.96000
2025.08.16 11:55:21.514	2025.01.10 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02128
2025.08.16 11:55:21.514	2025.01.10 18:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:21.514	2025.01.10 18:00:01   1.02811 , 1.02128
2025.08.16 11:55:21.514	2025.01.10 18:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21918
2025.08.16 11:55:21.586	2025.01.10 18:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:21.586	2025.01.10 18:00:01   1.22661 , 1.21918
2025.08.16 11:55:21.898	2025.01.10 21:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02274
2025.08.16 11:55:21.898	2025.01.10 21:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:21.898	2025.01.10 21:00:01   1.02128 , 1.02274
2025.08.16 11:55:21.898	2025.01.10 21:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21948
2025.08.16 11:55:21.898	2025.01.10 21:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:21.898	2025.01.10 21:00:01   1.21918 , 1.21948
2025.08.16 11:55:22.159	2025.01.10 22:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2698.01000
2025.08.16 11:55:22.159	2025.01.10 22:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:22.159	2025.01.10 22:15:00   2672.42000 , 2698.01000
2025.08.16 11:55:22.616	2025.01.13 00:30:03   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:22.626	2025.01.13 01:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02454 به لیست اضافه شد.
2025.08.16 11:55:22.626	2025.01.13 01:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02454) منقضی شد و حذف می‌شود.
2025.08.16 11:55:22.626	2025.01.13 01:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2684.52000
2025.08.16 11:55:22.626	2025.01.13 01:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:22.626	2025.01.13 01:30:00   2663.96000 , 2684.52000
2025.08.16 11:55:22.708	2025.01.13 02:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:22.791	2025.01.13 02:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2693.33000
2025.08.16 11:55:22.791	2025.01.13 02:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:22.791	2025.01.13 02:30:00   2698.01000 , 2693.33000
2025.08.16 11:55:22.791	2025.01.13 02:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02248
2025.08.16 11:55:22.791	2025.01.13 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:22.791	2025.01.13 02:30:01   1.02274 , 1.02248
2025.08.16 11:55:22.792	2025.01.13 02:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21930
2025.08.16 11:55:22.865	2025.01.13 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:22.865	2025.01.13 02:30:01   1.21948 , 1.21930
2025.08.16 11:55:22.877	2025.01.13 03:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02422 به لیست اضافه شد.
2025.08.16 11:55:22.958	2025.01.13 03:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2684.52000
2025.08.16 11:55:22.958	2025.01.13 03:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:23.047	2025.01.13 03:45:02   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.21930
2025.08.16 11:55:23.047	2025.01.13 03:45:02   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:23.047	2025.01.13 03:45:02   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:23.047	2025.01.13 03:45:02   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:23.047	2025.01.13 03:45:04   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:23.047	2025.01.13 03:45:04   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02422) منقضی شد و حذف می‌شود.
2025.08.16 11:55:23.216	2025.01.13 04:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02444 به لیست اضافه شد.
2025.08.16 11:55:23.222	2025.01.13 04:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:23.222	2025.01.13 04:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02444) منقضی شد و حذف می‌شود.
2025.08.16 11:55:23.314	2025.01.13 05:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02351 به لیست اضافه شد.
2025.08.16 11:55:23.314	2025.01.13 05:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02351) منقضی شد و حذف می‌شود.
2025.08.16 11:55:23.319	2025.01.13 05:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2679.46000
2025.08.16 11:55:23.319	2025.01.13 05:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:23.319	2025.01.13 05:45:00   2684.52000 , 2679.46000
2025.08.16 11:55:23.319	2025.01.13 05:45:03   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02497
2025.08.16 11:55:23.319	2025.01.13 05:45:03   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:23.319	2025.01.13 05:45:03   1.03117 , 1.02497
2025.08.16 11:55:23.319	2025.01.13 05:45:03   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02248
2025.08.16 11:55:23.319	2025.01.13 05:45:03   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:23.319	2025.01.13 05:45:03   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:23.319	2025.01.13 05:45:03   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:23.484	2025.01.13 06:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02183 به لیست اضافه شد.
2025.08.16 11:55:23.484	2025.01.13 06:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02183) منقضی شد و حذف می‌شود.
2025.08.16 11:55:23.687	2025.01.13 09:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02077
2025.08.16 11:55:23.688	2025.01.13 09:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:23.688	2025.01.13 09:00:01   1.02248 , 1.02077
2025.08.16 11:55:23.688	2025.01.13 09:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21259
2025.08.16 11:55:23.688	2025.01.13 09:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:23.688	2025.01.13 09:00:01   1.21930 , 1.21259
2025.08.16 11:55:23.703	2025.01.13 09:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.21259
2025.08.16 11:55:23.703	2025.01.13 09:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:23.703	2025.01.13 09:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:23.703	2025.01.13 09:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:23.864	2025.01.13 10:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2683.34000
2025.08.16 11:55:23.864	2025.01.13 10:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:23.864	2025.01.13 10:00:00   2679.46000 , 2683.34000
2025.08.16 11:55:23.870	2025.01.13 10:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02136 به لیست اضافه شد.
2025.08.16 11:55:23.888	2025.01.13 10:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02168 به لیست اضافه شد.
2025.08.16 11:55:23.967	2025.01.13 11:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2691.40000
2025.08.16 11:55:23.967	2025.01.13 11:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:23.967	2025.01.13 11:00:00   2693.33000 , 2691.40000
2025.08.16 11:55:23.983	2025.01.13 11:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02077
2025.08.16 11:55:23.983	2025.01.13 11:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:23.983	2025.01.13 11:30:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:23.983	2025.01.13 11:30:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:24.161	2025.01.13 12:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2683.34000
2025.08.16 11:55:24.161	2025.01.13 12:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:24.322	2025.01.13 12:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02311
2025.08.16 11:55:24.322	2025.01.13 12:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:24.322	2025.01.13 12:45:01   1.02497 , 1.02311
2025.08.16 11:55:24.322	2025.01.13 12:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.21709
2025.08.16 11:55:24.322	2025.01.13 12:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:24.322	2025.01.13 12:45:01   1.23215 , 1.21709
2025.08.16 11:55:24.423	2025.01.13 13:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.01772
2025.08.16 11:55:24.423	2025.01.13 13:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:24.423	2025.01.13 13:45:01   1.02077 , 1.01772
2025.08.16 11:55:24.809	2025.01.13 16:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.20997
2025.08.16 11:55:24.809	2025.01.13 16:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:24.809	2025.01.13 16:30:01   1.21259 , 1.20997
2025.08.16 11:55:24.998	2025.01.13 17:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:25.081	2025.01.13 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02204
2025.08.16 11:55:25.081	2025.01.13 18:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:25.081	2025.01.13 18:00:01   1.02311 , 1.02204
2025.08.16 11:55:25.246	2025.01.13 18:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02068 به لیست اضافه شد.
2025.08.16 11:55:25.342	2025.01.13 19:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2674.19000
2025.08.16 11:55:25.342	2025.01.13 19:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:25.342	2025.01.13 19:15:00   2691.40000 , 2674.19000
2025.08.16 11:55:25.362	2025.01.13 20:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.21709
2025.08.16 11:55:25.362	2025.01.13 20:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:25.521	2025.01.13 20:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.01916
2025.08.16 11:55:25.521	2025.01.13 20:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:25.521	2025.01.13 20:30:01   1.01772 , 1.01916
2025.08.16 11:55:25.631	2025.01.13 22:15:06   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02128 به لیست اضافه شد.
2025.08.16 11:55:25.641	2025.01.13 22:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02128) منقضی شد و حذف می‌شود.
2025.08.16 11:55:25.651	2025.01.13 23:15:02   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02213
2025.08.16 11:55:25.651	2025.01.13 23:15:02   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:25.651	2025.01.13 23:15:02   1.02204 , 1.02213
2025.08.16 11:55:25.651	2025.01.13 23:15:05   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.21831
2025.08.16 11:55:25.651	2025.01.13 23:15:05   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:25.651	2025.01.13 23:15:05   1.21709 , 1.21831
2025.08.16 11:55:25.653	2025.01.13 23:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2656.84000
2025.08.16 11:55:25.653	2025.01.13 23:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:25.653	2025.01.13 23:30:00   2683.34000 , 2656.84000
2025.08.16 11:55:25.653	2025.01.13 23:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.02213
2025.08.16 11:55:25.653	2025.01.13 23:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:25.653	2025.01.13 23:30:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:25.653	2025.01.13 23:30:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:25.655	2025.01.13 23:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.21831
2025.08.16 11:55:25.655	2025.01.13 23:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:25.751	2025.01.14 00:30:03   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02069
2025.08.16 11:55:25.751	2025.01.14 00:30:03   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:25.751	2025.01.14 00:30:03   1.01916 , 1.02069
2025.08.16 11:55:25.926	2025.01.14 02:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02627 به لیست اضافه شد.
2025.08.16 11:55:26.123	2025.01.14 04:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02773
2025.08.16 11:55:26.124	2025.01.14 04:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:26.124	2025.01.14 04:00:01   1.02213 , 1.02773
2025.08.16 11:55:26.124	2025.01.14 04:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22501
2025.08.16 11:55:26.124	2025.01.14 04:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:26.124	2025.01.14 04:00:01   1.21831 , 1.22501
2025.08.16 11:55:26.249	2025.01.14 06:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02492 به لیست اضافه شد.
2025.08.16 11:55:26.261	2025.01.14 07:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21920
2025.08.16 11:55:26.261	2025.01.14 07:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:26.261	2025.01.14 07:00:01   1.20997 , 1.21920
2025.08.16 11:55:26.262	2025.01.14 07:00:02   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02385
2025.08.16 11:55:26.262	2025.01.14 07:00:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:26.262	2025.01.14 07:00:02   1.02069 , 1.02385
2025.08.16 11:55:26.266	2025.01.14 07:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02516 به لیست اضافه شد.
2025.08.16 11:55:26.266	2025.01.14 07:15:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02516) منقضی شد و حذف می‌شود.
2025.08.16 11:55:26.266	2025.01.14 07:15:03   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02492) منقضی شد و حذف می‌شود.
2025.08.16 11:55:26.344	2025.01.14 07:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02550
2025.08.16 11:55:26.344	2025.01.14 07:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:26.344	2025.01.14 07:30:01   1.02773 , 1.02550
2025.08.16 11:55:26.357	2025.01.14 08:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22174
2025.08.16 11:55:26.357	2025.01.14 08:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:26.357	2025.01.14 08:00:01   1.22501 , 1.22174
2025.08.16 11:55:26.532	2025.01.14 09:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.02550
2025.08.16 11:55:26.532	2025.01.14 09:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:26.532	2025.01.14 09:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:26.532	2025.01.14 09:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:26.614	2025.01.14 09:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02621 به لیست اضافه شد.
2025.08.16 11:55:26.614	2025.01.14 09:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02621) منقضی شد و حذف می‌شود.
2025.08.16 11:55:26.614	2025.01.14 09:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2675.36000
2025.08.16 11:55:26.614	2025.01.14 09:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:26.614	2025.01.14 09:30:00   2674.19000 , 2675.36000
2025.08.16 11:55:26.699	2025.01.14 10:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02572 به لیست اضافه شد.
2025.08.16 11:55:26.699	2025.01.14 10:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02572) منقضی شد و حذف می‌شود.
2025.08.16 11:55:26.699	2025.01.14 10:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21974
2025.08.16 11:55:26.699	2025.01.14 10:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:26.699	2025.01.14 10:00:01   1.21920 , 1.21974
2025.08.16 11:55:26.782	2025.01.14 10:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02610 به لیست اضافه شد.
2025.08.16 11:55:26.782	2025.01.14 10:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.22174
2025.08.16 11:55:26.782	2025.01.14 10:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:26.782	2025.01.14 10:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:26.782	2025.01.14 10:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:26.864	2025.01.14 10:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02602 به لیست اضافه شد.
2025.08.16 11:55:26.885	2025.01.14 11:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:26.966	2025.01.14 11:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:26.966	2025.01.14 11:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.21974
2025.08.16 11:55:26.966	2025.01.14 11:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:26.966	2025.01.14 11:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:26.966	2025.01.14 11:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:27.076	2025.01.14 12:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22458
2025.08.16 11:55:27.076	2025.01.14 12:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:27.077	2025.01.14 12:45:01   1.22174 , 1.22458
2025.08.16 11:55:27.077	2025.01.14 12:45:02   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02747
2025.08.16 11:55:27.077	2025.01.14 12:45:02   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:27.077	2025.01.14 12:45:02   1.02550 , 1.02747
2025.08.16 11:55:27.084	2025.01.14 13:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2674.13000
2025.08.16 11:55:27.084	2025.01.14 13:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:27.084	2025.01.14 13:00:00   2675.36000 , 2674.13000
2025.08.16 11:55:27.263	2025.01.14 14:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02547 به لیست اضافه شد.
2025.08.16 11:55:27.263	2025.01.14 14:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02547) منقضی شد و حذف می‌شود.
2025.08.16 11:55:27.263	2025.01.14 14:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:27.344	2025.01.14 14:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02529 به لیست اضافه شد.
2025.08.16 11:55:27.350	2025.01.14 14:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02529) منقضی شد و حذف می‌شود.
2025.08.16 11:55:27.565	2025.01.14 16:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02649 به لیست اضافه شد.
2025.08.16 11:55:27.574	2025.01.14 16:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02682 به لیست اضافه شد.
2025.08.16 11:55:27.574	2025.01.14 16:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02394
2025.08.16 11:55:27.574	2025.01.14 16:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:27.574	2025.01.14 16:45:01   1.02385 , 1.02394
2025.08.16 11:55:27.734	2025.01.14 17:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02682) منقضی شد و حذف می‌شود.
2025.08.16 11:55:27.743	2025.01.14 17:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.02747
2025.08.16 11:55:27.743	2025.01.14 17:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:27.743	2025.01.14 17:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:27.743	2025.01.14 17:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:27.913	2025.01.14 17:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21362
2025.08.16 11:55:27.913	2025.01.14 17:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:27.913	2025.01.14 17:45:01   1.21974 , 1.21362
2025.08.16 11:55:27.996	2025.01.14 18:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2674.35000
2025.08.16 11:55:27.996	2025.01.14 18:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:27.996	2025.01.14 18:00:00   2674.13000 , 2674.35000
2025.08.16 11:55:28.165	2025.01.14 18:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2659.86000
2025.08.16 11:55:28.165	2025.01.14 18:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:28.165	2025.01.14 18:30:00   2656.84000 , 2659.86000
2025.08.16 11:55:28.249	2025.01.14 18:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:28.426	2025.01.14 19:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02870 به لیست اضافه شد.
2025.08.16 11:55:28.438	2025.01.14 20:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02900 به لیست اضافه شد.
2025.08.16 11:55:28.438	2025.01.14 20:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02900) منقضی شد و حذف می‌شود.
2025.08.16 11:55:28.451	2025.01.14 20:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03040
2025.08.16 11:55:28.451	2025.01.14 20:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:28.451	2025.01.14 20:45:01   1.02747 , 1.03040
2025.08.16 11:55:28.451	2025.01.14 20:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22125
2025.08.16 11:55:28.451	2025.01.14 20:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:28.451	2025.01.14 20:45:01   1.22458 , 1.22125
2025.08.16 11:55:28.535	2025.01.14 21:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2674.03000
2025.08.16 11:55:28.535	2025.01.14 21:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:28.535	2025.01.14 21:15:00   2674.35000 , 2674.03000
2025.08.16 11:55:28.695	2025.01.14 21:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2674.03000
2025.08.16 11:55:28.695	2025.01.14 21:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:28.712	2025.01.14 22:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03040
2025.08.16 11:55:28.712	2025.01.14 22:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:28.712	2025.01.14 22:30:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:28.712	2025.01.14 22:30:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:28.716	2025.01.14 22:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2666.77000
2025.08.16 11:55:28.716	2025.01.14 22:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:28.716	2025.01.14 22:45:00   2659.86000 , 2666.77000
2025.08.16 11:55:28.820	2025.01.15 00:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.22125
2025.08.16 11:55:28.820	2025.01.15 00:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:28.820	2025.01.15 00:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:28.820	2025.01.15 00:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:28.825	2025.01.15 00:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03084
2025.08.16 11:55:28.825	2025.01.15 00:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:28.825	2025.01.15 00:45:01   1.03040 , 1.03084
2025.08.16 11:55:28.825	2025.01.15 00:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03084
2025.08.16 11:55:28.826	2025.01.15 00:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:28.826	2025.01.15 00:45:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:28.826	2025.01.15 00:45:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:28.919	2025.01.15 02:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22159
2025.08.16 11:55:28.919	2025.01.15 02:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:28.919	2025.01.15 02:15:01   1.22125 , 1.22159
2025.08.16 11:55:29.096	2025.01.15 03:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2679.22000
2025.08.16 11:55:29.097	2025.01.15 03:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:29.097	2025.01.15 03:30:00   2674.03000 , 2679.22000
2025.08.16 11:55:29.259	2025.01.15 04:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03011 به لیست اضافه شد.
2025.08.16 11:55:29.259	2025.01.15 04:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03011) منقضی شد و حذف می‌شود.
2025.08.16 11:55:29.262	2025.01.15 04:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02990 به لیست اضافه شد.
2025.08.16 11:55:29.262	2025.01.15 04:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:29.377	2025.01.15 06:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2669.39000
2025.08.16 11:55:29.377	2025.01.15 06:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:29.377	2025.01.15 06:30:00   2666.77000 , 2669.39000
2025.08.16 11:55:29.456	2025.01.15 06:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03015 به لیست اضافه شد.
2025.08.16 11:55:29.456	2025.01.15 06:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03015) منقضی شد و حذف می‌شود.
2025.08.16 11:55:29.460	2025.01.15 07:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21921
2025.08.16 11:55:29.460	2025.01.15 07:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:29.460	2025.01.15 07:00:01   1.21362 , 1.21921
2025.08.16 11:55:29.543	2025.01.15 07:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03025 به لیست اضافه شد.
2025.08.16 11:55:29.543	2025.01.15 07:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03025) منقضی شد و حذف می‌شود.
2025.08.16 11:55:29.543	2025.01.15 07:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02952
2025.08.16 11:55:29.543	2025.01.15 07:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:29.543	2025.01.15 07:15:01   1.02394 , 1.02952
2025.08.16 11:55:29.553	2025.01.15 07:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02992 به لیست اضافه شد.
2025.08.16 11:55:29.561	2025.01.15 08:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2679.22000
2025.08.16 11:55:29.561	2025.01.15 08:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:29.561	2025.01.15 08:00:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:29.561	2025.01.15 08:00:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:29.561	2025.01.15 08:00:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:29.561	2025.01.15 08:00:00   market buy 0.04 XAUUSD sl: 2673.99 tp: 2717.71 (2679.39 / 2679.52 / 2679.39)
2025.08.16 11:55:29.561	2025.01.15 08:00:00   deal #10 buy 0.04 XAUUSD at 2679.52 done (based on order #10)
2025.08.16 11:55:29.561	2025.01.15 08:00:00   deal performed [#10 buy 0.04 XAUUSD at 2679.52]
2025.08.16 11:55:29.561	2025.01.15 08:00:00   order performed buy 0.04 at 2679.52 [#10 buy 0.04 XAUUSD at 2679.52]
2025.08.16 11:55:29.563	2025.01.15 08:00:00   CTrade::OrderSend: market buy 0.04 XAUUSD sl: 2673.99 tp: 2717.71 [done at 2679.52]
2025.08.16 11:55:29.563	2025.01.15 08:00:00   XAUUSD: معامله Memento Buy با لات 0.04 با موفقیت باز شد.
2025.08.16 11:55:29.563	2025.01.15 08:00:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:29.564	2025.01.15 08:00:01   TSL Manager [12345]: حالت جدید برای تیکت 10 با SL اولیه 2673.99 اضافه شد.
2025.08.16 11:55:29.564	2025.01.15 08:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02952
2025.08.16 11:55:29.564	2025.01.15 08:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:29.564	2025.01.15 08:00:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:29.680	2025.01.15 09:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.21921
2025.08.16 11:55:29.680	2025.01.15 09:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:29.680	2025.01.15 09:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:29.680	2025.01.15 09:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:29.770	2025.01.15 09:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03050
2025.08.16 11:55:29.770	2025.01.15 09:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:29.770	2025.01.15 09:45:01   1.03084 , 1.03050
2025.08.16 11:55:29.770	2025.01.15 09:45:06   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03002 به لیست اضافه شد.
2025.08.16 11:55:29.857	2025.01.15 10:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03051 به لیست اضافه شد.
2025.08.16 11:55:29.857	2025.01.15 10:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03050
2025.08.16 11:55:29.857	2025.01.15 10:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:29.857	2025.01.15 10:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:29.857	2025.01.15 10:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:29.857	2025.01.15 10:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.22159
2025.08.16 11:55:29.857	2025.01.15 10:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:29.857	2025.01.15 10:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:29.857	2025.01.15 10:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:29.962	2025.01.15 10:30:02   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03051) منقضی شد و حذف می‌شود.
2025.08.16 11:55:30.046	2025.01.15 10:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:30.066	2025.01.15 11:15:02   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03006 به لیست اضافه شد.
2025.08.16 11:55:30.150	2025.01.15 11:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21589
2025.08.16 11:55:30.150	2025.01.15 11:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:30.150	2025.01.15 11:30:01   1.21921 , 1.21589
2025.08.16 11:55:30.158	2025.01.15 11:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02866
2025.08.16 11:55:30.158	2025.01.15 11:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:30.158	2025.01.15 11:45:01   1.02952 , 1.02866
2025.08.16 11:55:30.330	2025.01.15 12:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22409
2025.08.16 11:55:30.330	2025.01.15 12:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:30.330	2025.01.15 12:15:01   1.22159 , 1.22409
2025.08.16 11:55:30.341	2025.01.15 12:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03170
2025.08.16 11:55:30.341	2025.01.15 12:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:30.341	2025.01.15 12:30:01   1.03050 , 1.03170
2025.08.16 11:55:30.565	2025.01.15 15:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03006) منقضی شد و حذف می‌شود.
2025.08.16 11:55:30.651	2025.01.15 15:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2689.06000
2025.08.16 11:55:30.651	2025.01.15 15:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:30.651	2025.01.15 15:15:00   2679.22000 , 2689.06000
2025.08.16 11:55:30.744	2025.01.15 15:30:03   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03170
2025.08.16 11:55:30.744	2025.01.15 15:30:03   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:30.839	2025.01.15 15:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.22409
2025.08.16 11:55:30.839	2025.01.15 15:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:30.839	2025.01.15 15:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:30.839	2025.01.15 15:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:30.849	2025.01.15 16:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2689.06000
2025.08.16 11:55:30.849	2025.01.15 16:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:31.036	2025.01.15 16:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03451 به لیست اضافه شد.
2025.08.16 11:55:31.036	2025.01.15 16:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03451) منقضی شد و حذف می‌شود.
2025.08.16 11:55:31.063	2025.01.15 17:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02934
2025.08.16 11:55:31.063	2025.01.15 17:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:31.063	2025.01.15 17:15:01   1.02866 , 1.02934
2025.08.16 11:55:31.063	2025.01.15 17:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22013
2025.08.16 11:55:31.063	2025.01.15 17:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:31.063	2025.01.15 17:15:01   1.21589 , 1.22013
2025.08.16 11:55:31.175	2025.01.15 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03543
2025.08.16 11:55:31.175	2025.01.15 18:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:31.175	2025.01.15 18:00:01   1.03170 , 1.03543
2025.08.16 11:55:31.262	2025.01.15 18:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:31.262	2025.01.15 18:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23055
2025.08.16 11:55:31.262	2025.01.15 18:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:31.262	2025.01.15 18:15:01   1.22409 , 1.23055
2025.08.16 11:55:31.349	2025.01.15 18:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2696.04000
2025.08.16 11:55:31.349	2025.01.15 18:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:31.349	2025.01.15 18:30:00   2689.06000 , 2696.04000
2025.08.16 11:55:31.349	2025.01.15 18:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02934
2025.08.16 11:55:31.349	2025.01.15 18:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:31.349	2025.01.15 18:30:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:31.349	2025.01.15 18:30:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:31.437	2025.01.15 18:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:31.449	2025.01.15 19:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02744 به لیست اضافه شد.
2025.08.16 11:55:31.539	2025.01.15 19:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2676.79000
2025.08.16 11:55:31.539	2025.01.15 19:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:31.539	2025.01.15 19:30:00   2669.39000 , 2676.79000
2025.08.16 11:55:31.550	2025.01.15 20:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:31.652	2025.01.15 20:30:02   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02907 به لیست اضافه شد.
2025.08.16 11:55:31.670	2025.01.15 21:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02579
2025.08.16 11:55:31.670	2025.01.15 21:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:31.670	2025.01.15 21:00:01   1.02934 , 1.02579
2025.08.16 11:55:31.670	2025.01.15 21:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21860
2025.08.16 11:55:31.670	2025.01.15 21:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:31.670	2025.01.15 21:00:01   1.22013 , 1.21860
2025.08.16 11:55:31.875	2025.01.15 23:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2696.04000
2025.08.16 11:55:31.875	2025.01.15 23:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:31.875	2025.01.15 23:00:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:31.875	2025.01.15 23:00:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:31.875	2025.01.15 23:00:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:31.875	2025.01.15 23:00:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:31.875	2025.01.15 23:00:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:32.156	2025.01.16 01:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02987
2025.08.16 11:55:32.156	2025.01.16 01:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:32.156	2025.01.16 01:00:01   1.03543 , 1.02987
2025.08.16 11:55:32.240	2025.01.16 01:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22447
2025.08.16 11:55:32.240	2025.01.16 01:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:32.240	2025.01.16 01:15:01   1.23055 , 1.22447
2025.08.16 11:55:32.340	2025.01.16 02:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02809
2025.08.16 11:55:32.340	2025.01.16 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:32.340	2025.01.16 02:30:01   1.02579 , 1.02809
2025.08.16 11:55:32.345	2025.01.16 02:45:03   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.22447
2025.08.16 11:55:32.345	2025.01.16 02:45:03   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:32.345	2025.01.16 02:45:03   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:32.345	2025.01.16 02:45:03   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:32.426	2025.01.16 03:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.02987
2025.08.16 11:55:32.426	2025.01.16 03:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:32.546	2025.01.16 04:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:32.552	2025.01.16 04:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2692.55000
2025.08.16 11:55:32.552	2025.01.16 04:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:32.552	2025.01.16 04:30:00   2676.79000 , 2692.55000
2025.08.16 11:55:32.641	2025.01.16 05:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.02997
2025.08.16 11:55:32.641	2025.01.16 05:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:32.641	2025.01.16 05:00:01   1.02987 , 1.02997
2025.08.16 11:55:32.641	2025.01.16 05:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22478
2025.08.16 11:55:32.641	2025.01.16 05:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:32.641	2025.01.16 05:00:01   1.22447 , 1.22478
2025.08.16 11:55:32.821	2025.01.16 06:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2702.15000
2025.08.16 11:55:32.821	2025.01.16 06:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:32.821	2025.01.16 06:00:00   2696.04000 , 2702.15000
2025.08.16 11:55:32.825	2025.01.16 06:15:04   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02928 به لیست اضافه شد.
2025.08.16 11:55:32.828	2025.01.16 06:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02928) منقضی شد و حذف می‌شود.
2025.08.16 11:55:32.850	2025.01.16 07:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:32.952	2025.01.16 08:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2692.55000
2025.08.16 11:55:32.952	2025.01.16 08:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:32.952	2025.01.16 08:15:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:32.952	2025.01.16 08:15:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:32.952	2025.01.16 08:15:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال فروش
2025.08.16 11:55:32.952	2025.01.16 08:15:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:32.952	2025.01.16 08:15:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:33.059	2025.01.16 09:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02857 به لیست اضافه شد.
2025.08.16 11:55:33.059	2025.01.16 09:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02980 به لیست اضافه شد.
2025.08.16 11:55:33.148	2025.01.16 09:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02993 به لیست اضافه شد.
2025.08.16 11:55:33.148	2025.01.16 09:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02993) منقضی شد و حذف می‌شود.
2025.08.16 11:55:33.148	2025.01.16 09:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02980) منقضی شد و حذف می‌شود.
2025.08.16 11:55:33.171	2025.01.16 10:15:02   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02807
2025.08.16 11:55:33.171	2025.01.16 10:15:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:33.171	2025.01.16 10:15:02   1.02809 , 1.02807
2025.08.16 11:55:33.263	2025.01.16 10:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2690.03000
2025.08.16 11:55:33.263	2025.01.16 10:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:33.263	2025.01.16 10:45:00   2692.55000 , 2690.03000
2025.08.16 11:55:33.440	2025.01.16 11:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2702.15000
2025.08.16 11:55:33.440	2025.01.16 11:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:33.440	2025.01.16 11:30:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:33.440	2025.01.16 11:30:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:33.440	2025.01.16 11:30:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:33.440	2025.01.16 11:30:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:33.440	2025.01.16 11:30:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:33.525	2025.01.16 11:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:33.527	2025.01.16 11:47:38   position modified [#10 buy 0.04 XAUUSD 2679.52 sl: 2697.97 tp: 2717.71]
2025.08.16 11:55:33.529	2025.01.16 11:47:38   CTrade::OrderSend: modify position #10 XAUUSD (sl: 2697.97, tp: 2717.71) [done]
2025.08.16 11:55:33.529	2025.01.16 11:47:38   TSL Manager [12345]: تریلینگ استاپ برای تیکت 10 به قیمت 2697.97 آپدیت شد.
2025.08.16 11:55:33.536	2025.01.16 12:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03013
2025.08.16 11:55:33.536	2025.01.16 12:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:33.536	2025.01.16 12:00:01   1.02997 , 1.03013
2025.08.16 11:55:33.536	2025.01.16 12:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22262
2025.08.16 11:55:33.536	2025.01.16 12:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:33.536	2025.01.16 12:00:01   1.22478 , 1.22262
2025.08.16 11:55:33.538	2025.01.16 12:04:35   position modified [#10 buy 0.04 XAUUSD 2679.52 sl: 2698.04 tp: 2717.71]
2025.08.16 11:55:33.540	2025.01.16 12:04:35   CTrade::OrderSend: modify position #10 XAUUSD (sl: 2698.04, tp: 2717.71) [done]
2025.08.16 11:55:33.540	2025.01.16 12:04:35   TSL Manager [12345]: تریلینگ استاپ برای تیکت 10 به قیمت 2698.04 آپدیت شد.
2025.08.16 11:55:33.544	2025.01.16 12:15:00   position modified [#10 buy 0.04 XAUUSD 2679.52 sl: 2699.24 tp: 2717.71]
2025.08.16 11:55:33.546	2025.01.16 12:15:00   CTrade::OrderSend: modify position #10 XAUUSD (sl: 2699.24, tp: 2717.71) [done]
2025.08.16 11:55:33.546	2025.01.16 12:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 10 به قیمت 2699.24 آپدیت شد.
2025.08.16 11:55:33.546	2025.01.16 12:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02902 به لیست اضافه شد.
2025.08.16 11:55:33.632	2025.01.16 12:30:00   position modified [#10 buy 0.04 XAUUSD 2679.52 sl: 2699.27 tp: 2717.71]
2025.08.16 11:55:33.634	2025.01.16 12:30:00   CTrade::OrderSend: modify position #10 XAUUSD (sl: 2699.27, tp: 2717.71) [done]
2025.08.16 11:55:33.634	2025.01.16 12:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 10 به قیمت 2699.27 آپدیت شد.
2025.08.16 11:55:33.643	2025.01.16 12:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:33.643	2025.01.16 12:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02902) منقضی شد و حذف می‌شود.
2025.08.16 11:55:33.745	2025.01.16 13:15:00   position modified [#10 buy 0.04 XAUUSD 2679.52 sl: 2699.45 tp: 2717.71]
2025.08.16 11:55:33.747	2025.01.16 13:15:00   CTrade::OrderSend: modify position #10 XAUUSD (sl: 2699.45, tp: 2717.71) [done]
2025.08.16 11:55:33.747	2025.01.16 13:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 10 به قیمت 2699.45 آپدیت شد.
2025.08.16 11:55:33.832	2025.01.16 13:30:00   position modified [#10 buy 0.04 XAUUSD 2679.52 sl: 2699.73 tp: 2717.71]
2025.08.16 11:55:33.834	2025.01.16 13:30:00   CTrade::OrderSend: modify position #10 XAUUSD (sl: 2699.73, tp: 2717.71) [done]
2025.08.16 11:55:33.834	2025.01.16 13:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 10 به قیمت 2699.73 آپدیت شد.
2025.08.16 11:55:33.834	2025.01.16 13:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02880 به لیست اضافه شد.
2025.08.16 11:55:33.834	2025.01.16 13:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02880) منقضی شد و حذف می‌شود.
2025.08.16 11:55:33.848	2025.01.16 13:45:00   position modified [#10 buy 0.04 XAUUSD 2679.52 sl: 2700.51 tp: 2717.71]
2025.08.16 11:55:33.850	2025.01.16 13:45:00   CTrade::OrderSend: modify position #10 XAUUSD (sl: 2700.51, tp: 2717.71) [done]
2025.08.16 11:55:33.850	2025.01.16 13:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 10 به قیمت 2700.51 آپدیت شد.
2025.08.16 11:55:33.936	2025.01.16 14:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21895
2025.08.16 11:55:33.936	2025.01.16 14:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:33.936	2025.01.16 14:00:01   1.21860 , 1.21895
2025.08.16 11:55:33.948	2025.01.16 14:15:02   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:33.948	2025.01.16 14:15:02   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02815
2025.08.16 11:55:33.948	2025.01.16 14:15:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:33.948	2025.01.16 14:15:02   1.02807 , 1.02815
2025.08.16 11:55:33.955	2025.01.16 14:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02815
2025.08.16 11:55:33.955	2025.01.16 14:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:33.955	2025.01.16 14:30:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:33.955	2025.01.16 14:30:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:34.040	2025.01.16 14:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02649) منقضی شد و حذف می‌شود.
2025.08.16 11:55:34.040	2025.01.16 14:45:14   stop loss triggered #10 buy 0.04 XAUUSD 2679.52 sl: 2700.51 tp: 2717.71 [#11 sell 0.04 XAUUSD at 2700.51]
2025.08.16 11:55:34.040	2025.01.16 14:45:14   deal #11 sell 0.04 XAUUSD at 2700.47 done (based on order #11)
2025.08.16 11:55:34.040	2025.01.16 14:45:14   deal performed [#11 sell 0.04 XAUUSD at 2700.47]
2025.08.16 11:55:34.040	2025.01.16 14:45:14   order performed sell 0.04 at 2700.47 [#11 sell 0.04 XAUUSD at 2700.51]
2025.08.16 11:55:34.040	2025.01.16 14:45:15   TSL Manager [12345]: حالت تیکت 10 از لیست تریلینگ حذف شد.
2025.08.16 11:55:34.040	2025.01.16 14:45:15   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:34.218	2025.01.16 15:30:03   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.21895
2025.08.16 11:55:34.218	2025.01.16 15:30:03   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:34.218	2025.01.16 15:30:03   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:34.218	2025.01.16 15:30:03   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:34.319	2025.01.16 16:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22124
2025.08.16 11:55:34.319	2025.01.16 16:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:34.319	2025.01.16 16:15:01   1.22262 , 1.22124
2025.08.16 11:55:34.594	2025.01.16 17:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02889 به لیست اضافه شد.
2025.08.16 11:55:34.594	2025.01.16 17:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.22124
2025.08.16 11:55:34.594	2025.01.16 17:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:34.594	2025.01.16 17:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:34.594	2025.01.16 17:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:34.766	2025.01.16 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02599
2025.08.16 11:55:34.767	2025.01.16 18:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:34.767	2025.01.16 18:00:01   1.02815 , 1.02599
2025.08.16 11:55:34.767	2025.01.16 18:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21746
2025.08.16 11:55:34.767	2025.01.16 18:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:34.767	2025.01.16 18:00:01   1.21895 , 1.21746
2025.08.16 11:55:34.946	2025.01.16 18:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03013
2025.08.16 11:55:34.946	2025.01.16 18:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:35.255	2025.01.16 21:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03150
2025.08.16 11:55:35.255	2025.01.16 21:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:35.255	2025.01.16 21:45:01   1.03013 , 1.03150
2025.08.16 11:55:35.255	2025.01.16 21:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22602
2025.08.16 11:55:35.255	2025.01.16 21:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:35.255	2025.01.16 21:45:01   1.22124 , 1.22602
2025.08.16 11:55:35.354	2025.01.16 22:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02986 به لیست اضافه شد.
2025.08.16 11:55:35.386	2025.01.17 00:15:31   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03001 به لیست اضافه شد.
2025.08.16 11:55:35.386	2025.01.17 00:15:31   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03001) منقضی شد و حذف می‌شود.
2025.08.16 11:55:35.410	2025.01.17 02:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03008 به لیست اضافه شد.
2025.08.16 11:55:35.410	2025.01.17 02:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03008) منقضی شد و حذف می‌شود.
2025.08.16 11:55:35.410	2025.01.17 02:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02924
2025.08.16 11:55:35.410	2025.01.17 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:35.410	2025.01.17 02:30:01   1.02599 , 1.02924
2025.08.16 11:55:35.573	2025.01.17 02:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2712.37000
2025.08.16 11:55:35.573	2025.01.17 02:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:35.573	2025.01.17 02:45:00   2690.03000 , 2712.37000
2025.08.16 11:55:35.573	2025.01.17 02:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03045 به لیست اضافه شد.
2025.08.16 11:55:35.584	2025.01.17 03:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2712.37000
2025.08.16 11:55:35.584	2025.01.17 03:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:35.584	2025.01.17 03:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03045) منقضی شد و حذف می‌شود.
2025.08.16 11:55:35.584	2025.01.17 03:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:35.584	2025.01.17 03:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22399
2025.08.16 11:55:35.584	2025.01.17 03:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:35.584	2025.01.17 03:15:01   1.22602 , 1.22399
2025.08.16 11:55:35.667	2025.01.17 03:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03050 به لیست اضافه شد.
2025.08.16 11:55:35.667	2025.01.17 03:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03050) منقضی شد و حذف می‌شود.
2025.08.16 11:55:35.675	2025.01.17 04:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:35.683	2025.01.17 04:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03056 به لیست اضافه شد.
2025.08.16 11:55:35.683	2025.01.17 04:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.22399
2025.08.16 11:55:35.683	2025.01.17 04:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:35.683	2025.01.17 04:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:35.683	2025.01.17 04:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:35.772	2025.01.17 05:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03029 به لیست اضافه شد.
2025.08.16 11:55:35.775	2025.01.17 05:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:35.779	2025.01.17 05:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2709.88000
2025.08.16 11:55:35.779	2025.01.17 05:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:35.779	2025.01.17 05:45:00   2712.37000 , 2709.88000
2025.08.16 11:55:35.779	2025.01.17 05:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03031 به لیست اضافه شد.
2025.08.16 11:55:35.858	2025.01.17 06:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:35.860	2025.01.17 06:15:02   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03094
2025.08.16 11:55:35.860	2025.01.17 06:15:02   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:35.860	2025.01.17 06:15:02   1.03150 , 1.03094
2025.08.16 11:55:35.949	2025.01.17 07:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22442
2025.08.16 11:55:35.949	2025.01.17 07:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:35.949	2025.01.17 07:00:01   1.22399 , 1.22442
2025.08.16 11:55:36.111	2025.01.17 07:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2717.38000
2025.08.16 11:55:36.111	2025.01.17 07:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:36.111	2025.01.17 07:30:00   2702.15000 , 2717.38000
2025.08.16 11:55:36.120	2025.01.17 07:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02933 به لیست اضافه شد.
2025.08.16 11:55:36.120	2025.01.17 07:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02933) منقضی شد و حذف می‌شود.
2025.08.16 11:55:36.120	2025.01.17 07:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02924
2025.08.16 11:55:36.120	2025.01.17 07:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:36.121	2025.01.17 07:45:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:36.121	2025.01.17 07:45:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:36.236	2025.01.17 09:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.21746
2025.08.16 11:55:36.236	2025.01.17 09:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:36.236	2025.01.17 09:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:36.236	2025.01.17 09:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:36.359	2025.01.17 11:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2709.88000
2025.08.16 11:55:36.359	2025.01.17 11:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:36.449	2025.01.17 12:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02774
2025.08.16 11:55:36.449	2025.01.17 12:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:36.449	2025.01.17 12:00:01   1.02924 , 1.02774
2025.08.16 11:55:36.449	2025.01.17 12:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21608
2025.08.16 11:55:36.449	2025.01.17 12:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:36.449	2025.01.17 12:00:01   1.21746 , 1.21608
2025.08.16 11:55:36.536	2025.01.17 12:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03041 به لیست اضافه شد.
2025.08.16 11:55:36.544	2025.01.17 12:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03041) منقضی شد و حذف می‌شود.
2025.08.16 11:55:36.751	2025.01.17 15:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2702.82000
2025.08.16 11:55:36.751	2025.01.17 15:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:36.751	2025.01.17 15:00:00   2709.88000 , 2702.82000
2025.08.16 11:55:36.858	2025.01.17 15:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03097
2025.08.16 11:55:36.858	2025.01.17 15:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:36.858	2025.01.17 15:45:01   1.03094 , 1.03097
2025.08.16 11:55:36.945	2025.01.17 16:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22164
2025.08.16 11:55:36.945	2025.01.17 16:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:36.945	2025.01.17 16:00:01   1.22442 , 1.22164
2025.08.16 11:55:37.029	2025.01.17 16:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:37.029	2025.01.17 16:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.02774
2025.08.16 11:55:37.029	2025.01.17 16:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:37.029	2025.01.17 16:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:37.029	2025.01.17 16:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:37.029	2025.01.17 16:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:37.135	2025.01.17 17:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02813 به لیست اضافه شد.
2025.08.16 11:55:37.135	2025.01.17 17:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02980 به لیست اضافه شد.
2025.08.16 11:55:37.135	2025.01.17 17:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02980 به لیست اضافه شد.
2025.08.16 11:55:37.144	2025.01.17 17:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03097
2025.08.16 11:55:37.144	2025.01.17 17:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:37.144	2025.01.17 17:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:37.144	2025.01.17 17:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:37.145	2025.01.17 17:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.22164
2025.08.16 11:55:37.145	2025.01.17 17:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:37.145	2025.01.17 17:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:37.145	2025.01.17 17:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:37.255	2025.01.17 18:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:37.255	2025.01.17 18:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02980) منقضی شد و حذف می‌شود.
2025.08.16 11:55:37.269	2025.01.17 18:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21610
2025.08.16 11:55:37.269	2025.01.17 18:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:37.269	2025.01.17 18:45:01   1.21608 , 1.21610
2025.08.16 11:55:37.269	2025.01.17 18:45:03   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02651
2025.08.16 11:55:37.269	2025.01.17 18:45:03   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:37.269	2025.01.17 18:45:03   1.02774 , 1.02651
2025.08.16 11:55:37.351	2025.01.17 19:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2702.69000
2025.08.16 11:55:37.351	2025.01.17 19:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:37.351	2025.01.17 19:00:00   2702.82000 , 2702.69000
2025.08.16 11:55:37.351	2025.01.17 19:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:37.438	2025.01.17 19:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03303
2025.08.16 11:55:37.438	2025.01.17 19:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:37.438	2025.01.17 19:30:01   1.03097 , 1.03303
2025.08.16 11:55:37.438	2025.01.17 19:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22276
2025.08.16 11:55:37.438	2025.01.17 19:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:37.438	2025.01.17 19:30:01   1.22164 , 1.22276
2025.08.16 11:55:37.547	2025.01.17 21:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02845 به لیست اضافه شد.
2025.08.16 11:55:37.547	2025.01.17 21:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02845) منقضی شد و حذف می‌شود.
2025.08.16 11:55:37.551	2025.01.17 21:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2717.29000
2025.08.16 11:55:37.551	2025.01.17 21:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:37.551	2025.01.17 21:15:00   2717.38000 , 2717.29000
2025.08.16 11:55:37.646	2025.01.17 22:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.02777 به لیست اضافه شد.
2025.08.16 11:55:37.646	2025.01.17 22:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02777) منقضی شد و حذف می‌شود.
2025.08.16 11:55:37.651	2025.01.17 22:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2702.69000
2025.08.16 11:55:37.651	2025.01.17 22:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:38.078	2025.01.20 01:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.21610
2025.08.16 11:55:38.078	2025.01.20 01:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:38.171	2025.01.20 02:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02778 به لیست اضافه شد.
2025.08.16 11:55:38.171	2025.01.20 02:15:02   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02897 به لیست اضافه شد.
2025.08.16 11:55:38.171	2025.01.20 02:15:02   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.02897) منقضی شد و حذف می‌شود.
2025.08.16 11:55:38.175	2025.01.20 02:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:38.183	2025.01.20 03:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02852 به لیست اضافه شد.
2025.08.16 11:55:38.195	2025.01.20 03:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21593
2025.08.16 11:55:38.196	2025.01.20 03:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:38.196	2025.01.20 03:30:01   1.21610 , 1.21593
2025.08.16 11:55:38.279	2025.01.20 03:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02848 به لیست اضافه شد.
2025.08.16 11:55:38.280	2025.01.20 03:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.02663
2025.08.16 11:55:38.280	2025.01.20 03:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:38.280	2025.01.20 03:45:01   1.02651 , 1.02663
2025.08.16 11:55:38.469	2025.01.20 05:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2689.26000
2025.08.16 11:55:38.469	2025.01.20 05:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:38.469	2025.01.20 05:30:00   2702.69000 , 2689.26000
2025.08.16 11:55:38.558	2025.01.20 06:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.02969 به لیست اضافه شد.
2025.08.16 11:55:38.600	2025.01.20 08:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03070
2025.08.16 11:55:38.600	2025.01.20 08:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:38.600	2025.01.20 08:30:01   1.03303 , 1.03070
2025.08.16 11:55:38.691	2025.01.20 09:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03070
2025.08.16 11:55:38.691	2025.01.20 09:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:38.691	2025.01.20 09:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:38.691	2025.01.20 09:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:38.820	2025.01.20 11:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2713.76000
2025.08.16 11:55:38.820	2025.01.20 11:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:38.820	2025.01.20 11:15:00   2717.29000 , 2713.76000
2025.08.16 11:55:38.820	2025.01.20 11:15:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03187
2025.08.16 11:55:38.820	2025.01.20 11:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:38.820	2025.01.20 11:15:01   1.03070 , 1.03187
2025.08.16 11:55:38.897	2025.01.20 11:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:38.897	2025.01.20 11:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.22215
2025.08.16 11:55:38.897	2025.01.20 11:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:38.897	2025.01.20 11:15:01   1.22276 , 1.22215
2025.08.16 11:55:38.919	2025.01.20 12:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2702.88000
2025.08.16 11:55:38.919	2025.01.20 12:15:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:38.919	2025.01.20 12:15:00   2689.26000 , 2702.88000
2025.08.16 11:55:39.092	2025.01.20 13:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03187
2025.08.16 11:55:39.092	2025.01.20 13:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:39.092	2025.01.20 13:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:39.092	2025.01.20 13:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:39.189	2025.01.20 14:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21653
2025.08.16 11:55:39.190	2025.01.20 14:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:39.190	2025.01.20 14:00:01   1.21593 , 1.21653
2025.08.16 11:55:39.275	2025.01.20 14:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03050
2025.08.16 11:55:39.275	2025.01.20 14:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:39.275	2025.01.20 14:15:01   1.02663 , 1.03050
2025.08.16 11:55:39.459	2025.01.20 15:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2712.57000
2025.08.16 11:55:39.459	2025.01.20 15:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:39.459	2025.01.20 15:30:00   2713.76000 , 2712.57000
2025.08.16 11:55:39.473	2025.01.20 15:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03984 به لیست اضافه شد.
2025.08.16 11:55:39.473	2025.01.20 15:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03984) منقضی شد و حذف می‌شود.
2025.08.16 11:55:39.473	2025.01.20 15:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03804 به لیست اضافه شد.
2025.08.16 11:55:39.473	2025.01.20 15:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.22215
2025.08.16 11:55:39.473	2025.01.20 15:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:39.473	2025.01.20 15:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:39.473	2025.01.20 15:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:39.572	2025.01.20 16:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03794 به لیست اضافه شد.
2025.08.16 11:55:39.615	2025.01.20 17:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04297 به لیست اضافه شد.
2025.08.16 11:55:39.615	2025.01.20 17:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04297) منقضی شد و حذف می‌شود.
2025.08.16 11:55:39.624	2025.01.20 17:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03879 به لیست اضافه شد.
2025.08.16 11:55:39.633	2025.01.20 18:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2701.52000
2025.08.16 11:55:39.633	2025.01.20 18:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:39.633	2025.01.20 18:00:00   2702.88000 , 2701.52000
2025.08.16 11:55:39.633	2025.01.20 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03083
2025.08.16 11:55:39.633	2025.01.20 18:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:39.633	2025.01.20 18:00:01   1.03050 , 1.03083
2025.08.16 11:55:39.707	2025.01.20 18:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.21836
2025.08.16 11:55:39.707	2025.01.20 18:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:39.707	2025.01.20 18:00:01   1.21653 , 1.21836
2025.08.16 11:55:39.733	2025.01.20 18:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03961 به لیست اضافه شد.
2025.08.16 11:55:39.733	2025.01.20 18:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2711.80000
2025.08.16 11:55:39.733	2025.01.20 18:45:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:39.733	2025.01.20 18:45:00   2712.57000 , 2711.80000
2025.08.16 11:55:39.819	2025.01.20 19:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04011 به لیست اضافه شد.
2025.08.16 11:55:39.819	2025.01.20 19:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04011) منقضی شد و حذف می‌شود.
2025.08.16 11:55:39.819	2025.01.20 19:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04298
2025.08.16 11:55:39.819	2025.01.20 19:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:39.819	2025.01.20 19:00:01   1.03187 , 1.04298
2025.08.16 11:55:39.819	2025.01.20 19:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23262
2025.08.16 11:55:39.819	2025.01.20 19:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:39.819	2025.01.20 19:00:01   1.22215 , 1.23262
2025.08.16 11:55:39.997	2025.01.20 20:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03922 به لیست اضافه شد.
2025.08.16 11:55:39.997	2025.01.20 20:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03922) منقضی شد و حذف می‌شود.
2025.08.16 11:55:40.009	2025.01.20 20:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03832 به لیست اضافه شد.
2025.08.16 11:55:40.021	2025.01.20 21:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03531
2025.08.16 11:55:40.021	2025.01.20 21:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:40.021	2025.01.20 21:45:01   1.03083 , 1.03531
2025.08.16 11:55:40.021	2025.01.20 21:45:02   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22543
2025.08.16 11:55:40.021	2025.01.20 21:45:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:40.022	2025.01.20 21:45:02   1.21836 , 1.22543
2025.08.16 11:55:40.101	2025.01.20 22:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.23262
2025.08.16 11:55:40.101	2025.01.20 22:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:40.101	2025.01.20 22:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:40.101	2025.01.20 22:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:40.216	2025.01.21 00:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04341
2025.08.16 11:55:40.216	2025.01.21 00:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:40.216	2025.01.21 00:30:01   1.04298 , 1.04341
2025.08.16 11:55:40.216	2025.01.21 00:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23441
2025.08.16 11:55:40.216	2025.01.21 00:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:40.216	2025.01.21 00:30:01   1.23262 , 1.23441
2025.08.16 11:55:40.229	2025.01.21 01:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2711.21000
2025.08.16 11:55:40.229	2025.01.21 01:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:40.229	2025.01.21 01:30:00   2711.80000 , 2711.21000
2025.08.16 11:55:40.323	2025.01.21 02:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2711.21000
2025.08.16 11:55:40.323	2025.01.21 02:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:40.323	2025.01.21 02:15:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:40.323	2025.01.21 02:15:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:40.323	2025.01.21 02:15:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:40.323	2025.01.21 02:15:00   market buy 0.03 XAUUSD sl: 2704.48 tp: 2757.95 (2711.12 / 2711.25 / 2711.12)
2025.08.16 11:55:40.323	2025.01.21 02:15:00   deal #12 buy 0.03 XAUUSD at 2711.25 done (based on order #12)
2025.08.16 11:55:40.323	2025.01.21 02:15:00   deal performed [#12 buy 0.03 XAUUSD at 2711.25]
2025.08.16 11:55:40.323	2025.01.21 02:15:00   order performed buy 0.03 at 2711.25 [#12 buy 0.03 XAUUSD at 2711.25]
2025.08.16 11:55:40.325	2025.01.21 02:15:00   CTrade::OrderSend: market buy 0.03 XAUUSD sl: 2704.48 tp: 2757.95 [done at 2711.25]
2025.08.16 11:55:40.325	2025.01.21 02:15:00   XAUUSD: معامله Memento Buy با لات 0.03 با موفقیت باز شد.
2025.08.16 11:55:40.325	2025.01.21 02:15:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:40.399	2025.01.21 02:15:01   TSL Manager [12345]: حالت جدید برای تیکت 12 با SL اولیه 2704.48 اضافه شد.
2025.08.16 11:55:40.399	2025.01.21 02:15:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:40.499	2025.01.21 02:53:25   stop loss triggered #12 buy 0.03 XAUUSD 2711.25 sl: 2704.48 tp: 2757.95 [#13 sell 0.03 XAUUSD at 2704.48]
2025.08.16 11:55:40.499	2025.01.21 02:53:25   deal #13 sell 0.03 XAUUSD at 2704.48 done (based on order #13)
2025.08.16 11:55:40.499	2025.01.21 02:53:25   deal performed [#13 sell 0.03 XAUUSD at 2704.48]
2025.08.16 11:55:40.499	2025.01.21 02:53:25   order performed sell 0.03 at 2704.48 [#13 sell 0.03 XAUUSD at 2704.48]
2025.08.16 11:55:40.499	2025.01.21 02:53:26   TSL Manager [12345]: حالت تیکت 12 از لیست تریلینگ حذف شد.
2025.08.16 11:55:40.499	2025.01.21 02:53:26   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:40.662	2025.01.21 03:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04235 به لیست اضافه شد.
2025.08.16 11:55:40.662	2025.01.21 03:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04235) منقضی شد و حذف می‌شود.
2025.08.16 11:55:40.662	2025.01.21 03:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03623 به لیست اضافه شد.
2025.08.16 11:55:40.662	2025.01.21 03:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03623 به لیست اضافه شد.
2025.08.16 11:55:40.662	2025.01.21 03:00:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03623) منقضی شد و حذف می‌شود.
2025.08.16 11:55:40.674	2025.01.21 03:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03556 به لیست اضافه شد.
2025.08.16 11:55:40.674	2025.01.21 03:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03623) منقضی شد و حذف می‌شود.
2025.08.16 11:55:40.790	2025.01.21 04:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04343
2025.08.16 11:55:40.790	2025.01.21 04:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:40.790	2025.01.21 04:30:01   1.04341 , 1.04343
2025.08.16 11:55:40.877	2025.01.21 04:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23445
2025.08.16 11:55:40.877	2025.01.21 04:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:40.877	2025.01.21 04:45:01   1.23441 , 1.23445
2025.08.16 11:55:40.965	2025.01.21 05:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03522
2025.08.16 11:55:40.965	2025.01.21 05:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:40.965	2025.01.21 05:15:01   1.03531 , 1.03522
2025.08.16 11:55:40.965	2025.01.21 05:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22471
2025.08.16 11:55:40.965	2025.01.21 05:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:40.965	2025.01.21 05:15:01   1.22543 , 1.22471
2025.08.16 11:55:41.050	2025.01.21 05:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2702.81000
2025.08.16 11:55:41.050	2025.01.21 05:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:41.050	2025.01.21 05:30:00   2701.52000 , 2702.81000
2025.08.16 11:55:41.456	2025.01.21 10:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03733 به لیست اضافه شد.
2025.08.16 11:55:41.456	2025.01.21 10:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03733) منقضی شد و حذف می‌شود.
2025.08.16 11:55:41.456	2025.01.21 10:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03733 به لیست اضافه شد.
2025.08.16 11:55:41.456	2025.01.21 10:00:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03733) منقضی شد و حذف می‌شود.
2025.08.16 11:55:41.580	2025.01.21 11:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.03522
2025.08.16 11:55:41.580	2025.01.21 11:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:41.580	2025.01.21 11:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.22471
2025.08.16 11:55:41.580	2025.01.21 11:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:41.663	2025.01.21 12:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2732.84000
2025.08.16 11:55:41.663	2025.01.21 12:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:41.663	2025.01.21 12:00:00   2711.21000 , 2732.84000
2025.08.16 11:55:41.946	2025.01.21 14:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03420
2025.08.16 11:55:41.946	2025.01.21 14:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:41.946	2025.01.21 14:00:01   1.03522 , 1.03420
2025.08.16 11:55:41.966	2025.01.21 14:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03530 به لیست اضافه شد.
2025.08.16 11:55:42.066	2025.01.21 15:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03670 به لیست اضافه شد.
2025.08.16 11:55:42.066	2025.01.21 15:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03670) منقضی شد و حذف می‌شود.
2025.08.16 11:55:42.074	2025.01.21 15:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2716.43000
2025.08.16 11:55:42.074	2025.01.21 15:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:42.074	2025.01.21 15:45:00   2702.81000 , 2716.43000
2025.08.16 11:55:42.157	2025.01.21 16:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:42.157	2025.01.21 16:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03783 به لیست اضافه شد.
2025.08.16 11:55:42.157	2025.01.21 16:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03783) منقضی شد و حذف می‌شود.
2025.08.16 11:55:42.157	2025.01.21 16:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22292
2025.08.16 11:55:42.157	2025.01.21 16:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:42.157	2025.01.21 16:00:01   1.22471 , 1.22292
2025.08.16 11:55:42.241	2025.01.21 16:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03728 به لیست اضافه شد.
2025.08.16 11:55:42.335	2025.01.21 16:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2732.84000
2025.08.16 11:55:42.335	2025.01.21 16:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:42.335	2025.01.21 16:45:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:42.335	2025.01.21 16:45:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:42.335	2025.01.21 16:45:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:42.335	2025.01.21 16:45:00   market buy 0.03 XAUUSD sl: 2726.67 tp: 2786.92 (2734.18 / 2734.30 / 2734.18)
2025.08.16 11:55:42.335	2025.01.21 16:45:00   deal #14 buy 0.03 XAUUSD at 2734.30 done (based on order #14)
2025.08.16 11:55:42.335	2025.01.21 16:45:00   deal performed [#14 buy 0.03 XAUUSD at 2734.30]
2025.08.16 11:55:42.335	2025.01.21 16:45:00   order performed buy 0.03 at 2734.30 [#14 buy 0.03 XAUUSD at 2734.30]
2025.08.16 11:55:42.338	2025.01.21 16:45:00   CTrade::OrderSend: market buy 0.03 XAUUSD sl: 2726.67 tp: 2786.92 [done at 2734.30]
2025.08.16 11:55:42.338	2025.01.21 16:45:00   XAUUSD: معامله Memento Buy با لات 0.03 با موفقیت باز شد.
2025.08.16 11:55:42.338	2025.01.21 16:45:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:42.340	2025.01.21 16:45:01   TSL Manager [12345]: حالت جدید برای تیکت 14 با SL اولیه 2726.67 اضافه شد.
2025.08.16 11:55:42.340	2025.01.21 16:45:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:43.167	2025.01.21 23:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2746.02000
2025.08.16 11:55:43.167	2025.01.21 23:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:43.167	2025.01.21 23:00:00   2732.84000 , 2746.02000
2025.08.16 11:55:43.167	2025.01.21 23:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04353
2025.08.16 11:55:43.167	2025.01.21 23:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:43.167	2025.01.21 23:00:01   1.04343 , 1.04353
2025.08.16 11:55:43.243	2025.01.21 23:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23398
2025.08.16 11:55:43.243	2025.01.21 23:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:43.243	2025.01.21 23:00:01   1.23445 , 1.23398
2025.08.16 11:55:43.250	2025.01.21 23:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.23398
2025.08.16 11:55:43.250	2025.01.21 23:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:43.250	2025.01.21 23:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:43.250	2025.01.21 23:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:43.349	2025.01.22 00:00:41   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.04353
2025.08.16 11:55:43.349	2025.01.22 00:00:41   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:43.349	2025.01.22 00:00:41   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:43.349	2025.01.22 00:00:41   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:43.431	2025.01.22 00:15:41   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23233
2025.08.16 11:55:43.432	2025.01.22 00:15:41   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:43.432	2025.01.22 00:15:41   1.22292 , 1.23233
2025.08.16 11:55:43.433	2025.01.22 00:30:14   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04158
2025.08.16 11:55:43.433	2025.01.22 00:30:14   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:43.433	2025.01.22 00:30:14   1.03420 , 1.04158
2025.08.16 11:55:43.524	2025.01.22 01:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:43.524	2025.01.22 01:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.04158
2025.08.16 11:55:43.524	2025.01.22 01:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:43.524	2025.01.22 01:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:43.524	2025.01.22 01:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:43.697	2025.01.22 02:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04056 به لیست اضافه شد.
2025.08.16 11:55:43.703	2025.01.22 02:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23601
2025.08.16 11:55:43.703	2025.01.22 02:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:43.703	2025.01.22 02:15:01   1.23398 , 1.23601
2025.08.16 11:55:43.866	2025.01.22 02:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2746.02000
2025.08.16 11:55:43.866	2025.01.22 02:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:43.873	2025.01.22 03:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04325
2025.08.16 11:55:43.873	2025.01.22 03:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:43.873	2025.01.22 03:00:01   1.04353 , 1.04325
2025.08.16 11:55:44.058	2025.01.22 03:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23221
2025.08.16 11:55:44.058	2025.01.22 03:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:44.058	2025.01.22 03:45:01   1.23233 , 1.23221
2025.08.16 11:55:44.058	2025.01.22 03:45:02   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03925
2025.08.16 11:55:44.058	2025.01.22 03:45:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:44.058	2025.01.22 03:45:02   1.04158 , 1.03925
2025.08.16 11:55:44.253	2025.01.22 05:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23537
2025.08.16 11:55:44.253	2025.01.22 05:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:44.253	2025.01.22 05:15:01   1.23601 , 1.23537
2025.08.16 11:55:44.371	2025.01.22 07:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04171 به لیست اضافه شد.
2025.08.16 11:55:44.383	2025.01.22 07:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:44.396	2025.01.22 08:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04151 به لیست اضافه شد.
2025.08.16 11:55:44.396	2025.01.22 08:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04151 به لیست اضافه شد.
2025.08.16 11:55:44.404	2025.01.22 08:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:44.404	2025.01.22 08:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04151) منقضی شد و حذف می‌شود.
2025.08.16 11:55:44.404	2025.01.22 08:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:44.427	2025.01.22 09:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04212
2025.08.16 11:55:44.427	2025.01.22 09:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:44.427	2025.01.22 09:00:01   1.04325 , 1.04212
2025.08.16 11:55:44.427	2025.01.22 09:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.23221
2025.08.16 11:55:44.427	2025.01.22 09:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:44.427	2025.01.22 09:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:44.427	2025.01.22 09:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:44.590	2025.01.22 09:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04032 به لیست اضافه شد.
2025.08.16 11:55:44.699	2025.01.22 10:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2758.68000
2025.08.16 11:55:44.699	2025.01.22 10:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:44.699	2025.01.22 10:15:00   2746.02000 , 2758.68000
2025.08.16 11:55:44.699	2025.01.22 10:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23476
2025.08.16 11:55:44.699	2025.01.22 10:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:44.700	2025.01.22 10:15:01   1.23537 , 1.23476
2025.08.16 11:55:44.872	2025.01.22 10:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2745.59000
2025.08.16 11:55:44.872	2025.01.22 10:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:44.872	2025.01.22 10:45:00   2716.43000 , 2745.59000
2025.08.16 11:55:44.872	2025.01.22 10:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04192 به لیست اضافه شد.
2025.08.16 11:55:44.872	2025.01.22 10:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04192) منقضی شد و حذف می‌شود.
2025.08.16 11:55:45.037	2025.01.22 11:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.04212
2025.08.16 11:55:45.037	2025.01.22 11:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:45.046	2025.01.22 11:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03999
2025.08.16 11:55:45.046	2025.01.22 11:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:45.046	2025.01.22 11:15:01   1.03925 , 1.03999
2025.08.16 11:55:45.046	2025.01.22 11:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04256 به لیست اضافه شد.
2025.08.16 11:55:45.046	2025.01.22 11:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.23476
2025.08.16 11:55:45.046	2025.01.22 11:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:45.046	2025.01.22 11:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:45.046	2025.01.22 11:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:45.212	2025.01.22 11:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2758.68000
2025.08.16 11:55:45.212	2025.01.22 11:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:45.212	2025.01.22 11:30:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:45.212	2025.01.22 11:30:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:45.212	2025.01.22 11:30:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:45.212	2025.01.22 11:30:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:45.212	2025.01.22 11:30:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:45.219	2025.01.22 11:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23114
2025.08.16 11:55:45.219	2025.01.22 11:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:45.219	2025.01.22 11:45:01   1.23221 , 1.23114
2025.08.16 11:55:45.701	2025.01.22 15:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2763.45000
2025.08.16 11:55:45.701	2025.01.22 15:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:45.701	2025.01.22 15:00:00   2758.68000 , 2763.45000
2025.08.16 11:55:45.701	2025.01.22 15:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04572
2025.08.16 11:55:45.701	2025.01.22 15:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:45.701	2025.01.22 15:00:01   1.04212 , 1.04572
2025.08.16 11:55:45.701	2025.01.22 15:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23756
2025.08.16 11:55:45.701	2025.01.22 15:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:45.701	2025.01.22 15:00:01   1.23476 , 1.23756
2025.08.16 11:55:45.862	2025.01.22 17:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04182 به لیست اضافه شد.
2025.08.16 11:55:45.862	2025.01.22 17:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04246 به لیست اضافه شد.
2025.08.16 11:55:45.872	2025.01.22 17:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04246) منقضی شد و حذف می‌شود.
2025.08.16 11:55:45.872	2025.01.22 17:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:46.091	2025.01.22 19:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2750.25000
2025.08.16 11:55:46.091	2025.01.22 19:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:46.091	2025.01.22 19:00:00   2745.59000 , 2750.25000
2025.08.16 11:55:46.266	2025.01.22 19:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04203 به لیست اضافه شد.
2025.08.16 11:55:46.266	2025.01.22 19:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04203) منقضی شد و حذف می‌شود.
2025.08.16 11:55:46.376	2025.01.22 20:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2760.35000
2025.08.16 11:55:46.376	2025.01.22 20:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:46.376	2025.01.22 20:15:00   2763.45000 , 2760.35000
2025.08.16 11:55:46.463	2025.01.22 20:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04134 به لیست اضافه شد.
2025.08.16 11:55:46.469	2025.01.22 20:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23073
2025.08.16 11:55:46.469	2025.01.22 20:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:46.469	2025.01.22 20:45:01   1.23114 , 1.23073
2025.08.16 11:55:46.643	2025.01.22 21:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04224 به لیست اضافه شد.
2025.08.16 11:55:46.643	2025.01.22 21:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04224) منقضی شد و حذف می‌شود.
2025.08.16 11:55:46.744	2025.01.22 22:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04119
2025.08.16 11:55:46.744	2025.01.22 22:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:46.744	2025.01.22 22:30:01   1.03999 , 1.04119
2025.08.16 11:55:46.912	2025.01.22 22:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04147 به لیست اضافه شد.
2025.08.16 11:55:46.925	2025.01.22 23:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.04119
2025.08.16 11:55:46.925	2025.01.22 23:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:46.925	2025.01.22 23:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:46.925	2025.01.22 23:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:47.013	2025.01.22 23:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04079 به لیست اضافه شد.
2025.08.16 11:55:47.025	2025.01.23 00:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23310
2025.08.16 11:55:47.025	2025.01.23 00:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:47.025	2025.01.23 00:00:01   1.23756 , 1.23310
2025.08.16 11:55:47.113	2025.01.23 00:45:04   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04228
2025.08.16 11:55:47.113	2025.01.23 00:45:04   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:47.113	2025.01.23 00:45:04   1.04572 , 1.04228
2025.08.16 11:55:47.198	2025.01.23 01:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04092 به لیست اضافه شد.
2025.08.16 11:55:47.199	2025.01.23 01:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04092) منقضی شد و حذف می‌شود.
2025.08.16 11:55:47.292	2025.01.23 02:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04112 به لیست اضافه شد.
2025.08.16 11:55:47.292	2025.01.23 02:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04112) منقضی شد و حذف می‌شود.
2025.08.16 11:55:47.296	2025.01.23 02:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23055
2025.08.16 11:55:47.296	2025.01.23 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:47.296	2025.01.23 02:30:01   1.23073 , 1.23055
2025.08.16 11:55:47.296	2025.01.23 02:30:12   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04042
2025.08.16 11:55:47.296	2025.01.23 02:30:12   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:47.296	2025.01.23 02:30:12   1.04119 , 1.04042
2025.08.16 11:55:47.414	2025.01.23 04:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.04042
2025.08.16 11:55:47.414	2025.01.23 04:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:47.414	2025.01.23 04:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:47.414	2025.01.23 04:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:47.527	2025.01.23 05:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04158
2025.08.16 11:55:47.527	2025.01.23 05:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:47.527	2025.01.23 05:30:01   1.04228 , 1.04158
2025.08.16 11:55:47.527	2025.01.23 05:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23231
2025.08.16 11:55:47.527	2025.01.23 05:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:47.527	2025.01.23 05:30:01   1.23310 , 1.23231
2025.08.16 11:55:47.609	2025.01.23 05:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2750.25000
2025.08.16 11:55:47.609	2025.01.23 05:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:47.702	2025.01.23 06:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03969
2025.08.16 11:55:47.703	2025.01.23 06:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:47.703	2025.01.23 06:30:01   1.04042 , 1.03969
2025.08.16 11:55:47.703	2025.01.23 06:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04119 به لیست اضافه شد.
2025.08.16 11:55:47.703	2025.01.23 06:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23017
2025.08.16 11:55:47.703	2025.01.23 06:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:47.703	2025.01.23 06:30:01   1.23055 , 1.23017
2025.08.16 11:55:47.800	2025.01.23 07:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:47.812	2025.01.23 08:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:47.817	2025.01.23 08:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2749.51000
2025.08.16 11:55:47.817	2025.01.23 08:15:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:47.817	2025.01.23 08:15:00   2750.25000 , 2749.51000
2025.08.16 11:55:47.817	2025.01.23 08:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04086 به لیست اضافه شد.
2025.08.16 11:55:47.904	2025.01.23 08:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04083 به لیست اضافه شد.
2025.08.16 11:55:47.904	2025.01.23 08:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04118 به لیست اضافه شد.
2025.08.16 11:55:47.988	2025.01.23 08:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04119 به لیست اضافه شد.
2025.08.16 11:55:47.988	2025.01.23 08:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04119) منقضی شد و حذف می‌شود.
2025.08.16 11:55:47.988	2025.01.23 08:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:47.988	2025.01.23 08:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04118) منقضی شد و حذف می‌شود.
2025.08.16 11:55:48.072	2025.01.23 09:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04127
2025.08.16 11:55:48.072	2025.01.23 09:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:48.072	2025.01.23 09:00:01   1.04158 , 1.04127
2025.08.16 11:55:48.160	2025.01.23 09:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.03969
2025.08.16 11:55:48.160	2025.01.23 09:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:48.160	2025.01.23 09:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:48.160	2025.01.23 09:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:48.246	2025.01.23 09:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23209
2025.08.16 11:55:48.246	2025.01.23 09:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:48.246	2025.01.23 09:30:01   1.23231 , 1.23209
2025.08.16 11:55:48.331	2025.01.23 09:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03982 به لیست اضافه شد.
2025.08.16 11:55:48.331	2025.01.23 09:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03982) منقضی شد و حذف می‌شود.
2025.08.16 11:55:48.332	2025.01.23 09:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.23017
2025.08.16 11:55:48.332	2025.01.23 09:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:48.516	2025.01.23 10:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03953 به لیست اضافه شد.
2025.08.16 11:55:48.525	2025.01.23 10:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03979 به لیست اضافه شد.
2025.08.16 11:55:48.525	2025.01.23 10:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03979) منقضی شد و حذف می‌شود.
2025.08.16 11:55:48.525	2025.01.23 10:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2755.59000
2025.08.16 11:55:48.525	2025.01.23 10:45:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:48.525	2025.01.23 10:45:00   2760.35000 , 2755.59000
2025.08.16 11:55:48.610	2025.01.23 11:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03968 به لیست اضافه شد.
2025.08.16 11:55:48.610	2025.01.23 11:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03968) منقضی شد و حذف می‌شود.
2025.08.16 11:55:48.626	2025.01.23 11:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04086 به لیست اضافه شد.
2025.08.16 11:55:48.626	2025.01.23 11:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04086) منقضی شد و حذف می‌شود.
2025.08.16 11:55:48.626	2025.01.23 11:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2749.51000
2025.08.16 11:55:48.626	2025.01.23 11:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:48.626	2025.01.23 11:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03899
2025.08.16 11:55:48.626	2025.01.23 11:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:48.626	2025.01.23 11:30:01   1.03969 , 1.03899
2025.08.16 11:55:48.792	2025.01.23 11:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04076 به لیست اضافه شد.
2025.08.16 11:55:48.792	2025.01.23 11:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04076) منقضی شد و حذف می‌شود.
2025.08.16 11:55:48.800	2025.01.23 12:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04117 به لیست اضافه شد.
2025.08.16 11:55:48.800	2025.01.23 12:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04117) منقضی شد و حذف می‌شود.
2025.08.16 11:55:48.800	2025.01.23 12:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04117 به لیست اضافه شد.
2025.08.16 11:55:48.806	2025.01.23 12:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.23209
2025.08.16 11:55:48.806	2025.01.23 12:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:48.806	2025.01.23 12:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:48.806	2025.01.23 12:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:48.806	2025.01.23 12:15:02   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.04127
2025.08.16 11:55:48.806	2025.01.23 12:15:02   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:48.996	2025.01.23 13:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22930
2025.08.16 11:55:48.996	2025.01.23 13:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:48.996	2025.01.23 13:15:01   1.23017 , 1.22930
2025.08.16 11:55:49.083	2025.01.23 13:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04089 به لیست اضافه شد.
2025.08.16 11:55:49.178	2025.01.23 14:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2740.87000
2025.08.16 11:55:49.178	2025.01.23 14:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:49.178	2025.01.23 14:00:00   2749.51000 , 2740.87000
2025.08.16 11:55:49.178	2025.01.23 14:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:49.178	2025.01.23 14:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:49.372	2025.01.23 15:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04034 به لیست اضافه شد.
2025.08.16 11:55:49.373	2025.01.23 15:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04203
2025.08.16 11:55:49.373	2025.01.23 15:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:49.373	2025.01.23 15:00:01   1.04127 , 1.04203
2025.08.16 11:55:49.373	2025.01.23 15:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04034 به لیست اضافه شد.
2025.08.16 11:55:49.373	2025.01.23 15:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23306
2025.08.16 11:55:49.373	2025.01.23 15:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:49.373	2025.01.23 15:00:01   1.23209 , 1.23306
2025.08.16 11:55:49.458	2025.01.23 15:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2740.87000
2025.08.16 11:55:49.458	2025.01.23 15:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:49.458	2025.01.23 15:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:49.458	2025.01.23 15:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04034) منقضی شد و حذف می‌شود.
2025.08.16 11:55:49.629	2025.01.23 15:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04047 به لیست اضافه شد.
2025.08.16 11:55:49.738	2025.01.23 16:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2754.45000
2025.08.16 11:55:49.738	2025.01.23 16:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:49.738	2025.01.23 16:00:00   2755.59000 , 2754.45000
2025.08.16 11:55:49.835	2025.01.23 16:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03940
2025.08.16 11:55:49.835	2025.01.23 16:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:49.835	2025.01.23 16:30:01   1.03899 , 1.03940
2025.08.16 11:55:49.835	2025.01.23 16:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.22999
2025.08.16 11:55:49.835	2025.01.23 16:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:49.835	2025.01.23 16:30:01   1.22930 , 1.22999
2025.08.16 11:55:49.938	2025.01.23 17:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.23306
2025.08.16 11:55:49.938	2025.01.23 17:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:49.938	2025.01.23 17:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:49.938	2025.01.23 17:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:50.033	2025.01.23 17:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04047) منقضی شد و حذف می‌شود.
2025.08.16 11:55:50.045	2025.01.23 17:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03952 به لیست اضافه شد.
2025.08.16 11:55:50.052	2025.01.23 17:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03929 به لیست اضافه شد.
2025.08.16 11:55:50.052	2025.01.23 17:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03952) منقضی شد و حذف می‌شود.
2025.08.16 11:55:50.061	2025.01.23 18:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2735.58000
2025.08.16 11:55:50.061	2025.01.23 18:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:50.061	2025.01.23 18:00:00   2740.87000 , 2735.58000
2025.08.16 11:55:50.162	2025.01.23 18:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03966 به لیست اضافه شد.
2025.08.16 11:55:50.162	2025.01.23 18:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04087 به لیست اضافه شد.
2025.08.16 11:55:50.173	2025.01.23 18:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04208 به لیست اضافه شد.
2025.08.16 11:55:50.173	2025.01.23 18:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04208) منقضی شد و حذف می‌شود.
2025.08.16 11:55:50.173	2025.01.23 18:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.04203
2025.08.16 11:55:50.173	2025.01.23 18:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:50.278	2025.01.23 19:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2754.45000
2025.08.16 11:55:50.278	2025.01.23 19:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:50.278	2025.01.23 19:15:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:50.278	2025.01.23 19:15:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:50.278	2025.01.23 19:15:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:50.278	2025.01.23 19:15:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:50.278	2025.01.23 19:15:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:50.395	2025.01.23 20:30:02   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03721
2025.08.16 11:55:50.396	2025.01.23 20:30:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:50.396	2025.01.23 20:30:02   1.03940 , 1.03721
2025.08.16 11:55:50.396	2025.01.23 20:30:02   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23000
2025.08.16 11:55:50.396	2025.01.23 20:30:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:50.396	2025.01.23 20:30:02   1.22999 , 1.23000
2025.08.16 11:55:50.522	2025.01.23 22:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2758.92000
2025.08.16 11:55:50.522	2025.01.23 22:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:50.522	2025.01.23 22:15:00   2754.45000 , 2758.92000
2025.08.16 11:55:50.522	2025.01.23 22:15:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04379
2025.08.16 11:55:50.523	2025.01.23 22:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:50.523	2025.01.23 22:15:01   1.04203 , 1.04379
2025.08.16 11:55:50.523	2025.01.23 22:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.23750
2025.08.16 11:55:50.599	2025.01.23 22:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:50.599	2025.01.23 22:15:01   1.23306 , 1.23750
2025.08.16 11:55:50.750	2025.01.24 01:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2751.28000
2025.08.16 11:55:50.750	2025.01.24 01:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:50.750	2025.01.24 01:30:00   2735.58000 , 2751.28000
2025.08.16 11:55:50.922	2025.01.24 02:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04132 به لیست اضافه شد.
2025.08.16 11:55:50.922	2025.01.24 02:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04101
2025.08.16 11:55:50.922	2025.01.24 02:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:50.922	2025.01.24 02:15:01   1.03721 , 1.04101
2025.08.16 11:55:51.006	2025.01.24 02:30:03   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23449
2025.08.16 11:55:51.006	2025.01.24 02:30:03   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:51.006	2025.01.24 02:30:03   1.23000 , 1.23449
2025.08.16 11:55:51.089	2025.01.24 02:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04182 به لیست اضافه شد.
2025.08.16 11:55:51.089	2025.01.24 02:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2758.92000
2025.08.16 11:55:51.089	2025.01.24 02:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:51.089	2025.01.24 02:45:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:51.089	2025.01.24 02:45:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:51.089	2025.01.24 02:45:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:51.089	2025.01.24 02:45:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:55:51.089	2025.01.24 02:45:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:51.214	2025.01.24 04:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04314 به لیست اضافه شد.
2025.08.16 11:55:51.214	2025.01.24 04:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04314) منقضی شد و حذف می‌شود.
2025.08.16 11:55:51.214	2025.01.24 04:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04314 به لیست اضافه شد.
2025.08.16 11:55:51.217	2025.01.24 04:19:51   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2760.25 tp: 2786.92]
2025.08.16 11:55:51.219	2025.01.24 04:19:51   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2760.25, tp: 2786.92) [done]
2025.08.16 11:55:51.219	2025.01.24 04:19:51   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2760.25 آپدیت شد.
2025.08.16 11:55:51.304	2025.01.24 04:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.23750
2025.08.16 11:55:51.304	2025.01.24 04:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:51.304	2025.01.24 04:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:51.304	2025.01.24 04:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:51.390	2025.01.24 04:36:05   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2761.40 tp: 2786.92]
2025.08.16 11:55:51.392	2025.01.24 04:36:05   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2761.40, tp: 2786.92) [done]
2025.08.16 11:55:51.392	2025.01.24 04:36:05   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2761.40 آپدیت شد.
2025.08.16 11:55:51.396	2025.01.24 04:45:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2762.28 tp: 2786.92]
2025.08.16 11:55:51.398	2025.01.24 04:45:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2762.28, tp: 2786.92) [done]
2025.08.16 11:55:51.398	2025.01.24 04:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2762.28 آپدیت شد.
2025.08.16 11:55:51.398	2025.01.24 04:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.04379
2025.08.16 11:55:51.398	2025.01.24 04:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:51.485	2025.01.24 05:00:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2763.29 tp: 2786.92]
2025.08.16 11:55:51.487	2025.01.24 05:00:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2763.29, tp: 2786.92) [done]
2025.08.16 11:55:51.487	2025.01.24 05:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2763.29 آپدیت شد.
2025.08.16 11:55:51.577	2025.01.24 05:15:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2764.31 tp: 2786.92]
2025.08.16 11:55:51.579	2025.01.24 05:15:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2764.31, tp: 2786.92) [done]
2025.08.16 11:55:51.579	2025.01.24 05:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2764.31 آپدیت شد.
2025.08.16 11:55:51.600	2025.01.24 05:45:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2764.52 tp: 2786.92]
2025.08.16 11:55:51.601	2025.01.24 05:45:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2764.52, tp: 2786.92) [done]
2025.08.16 11:55:51.601	2025.01.24 05:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2764.52 آپدیت شد.
2025.08.16 11:55:51.698	2025.01.24 06:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04116
2025.08.16 11:55:51.698	2025.01.24 06:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:51.698	2025.01.24 06:15:01   1.04101 , 1.04116
2025.08.16 11:55:51.803	2025.01.24 07:00:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2764.75 tp: 2786.92]
2025.08.16 11:55:51.805	2025.01.24 07:00:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2764.75, tp: 2786.92) [done]
2025.08.16 11:55:51.805	2025.01.24 07:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2764.75 آپدیت شد.
2025.08.16 11:55:51.812	2025.01.24 07:15:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2765.31 tp: 2786.92]
2025.08.16 11:55:51.814	2025.01.24 07:15:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2765.31, tp: 2786.92) [done]
2025.08.16 11:55:51.814	2025.01.24 07:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2765.31 آپدیت شد.
2025.08.16 11:55:51.901	2025.01.24 07:30:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2765.42 tp: 2786.92]
2025.08.16 11:55:51.903	2025.01.24 07:30:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2765.42, tp: 2786.92) [done]
2025.08.16 11:55:51.903	2025.01.24 07:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2765.42 آپدیت شد.
2025.08.16 11:55:51.903	2025.01.24 07:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2777.40000
2025.08.16 11:55:51.903	2025.01.24 07:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:51.903	2025.01.24 07:30:00   2758.92000 , 2777.40000
2025.08.16 11:55:51.903	2025.01.24 07:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24038
2025.08.16 11:55:51.903	2025.01.24 07:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:51.903	2025.01.24 07:30:01   1.23750 , 1.24038
2025.08.16 11:55:51.989	2025.01.24 07:45:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2765.47 tp: 2786.92]
2025.08.16 11:55:51.991	2025.01.24 07:45:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2765.47, tp: 2786.92) [done]
2025.08.16 11:55:51.991	2025.01.24 07:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2765.47 آپدیت شد.
2025.08.16 11:55:52.013	2025.01.24 08:15:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2766.19 tp: 2786.92]
2025.08.16 11:55:52.015	2025.01.24 08:15:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2766.19, tp: 2786.92) [done]
2025.08.16 11:55:52.015	2025.01.24 08:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2766.19 آپدیت شد.
2025.08.16 11:55:52.015	2025.01.24 08:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2777.40000
2025.08.16 11:55:52.015	2025.01.24 08:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:52.015	2025.01.24 08:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24038
2025.08.16 11:55:52.015	2025.01.24 08:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:52.015	2025.01.24 08:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:52.015	2025.01.24 08:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:52.103	2025.01.24 08:30:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2766.34 tp: 2786.92]
2025.08.16 11:55:52.105	2025.01.24 08:30:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2766.34, tp: 2786.92) [done]
2025.08.16 11:55:52.105	2025.01.24 08:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2766.34 آپدیت شد.
2025.08.16 11:55:52.113	2025.01.24 08:45:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2767.04 tp: 2786.92]
2025.08.16 11:55:52.115	2025.01.24 08:45:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2767.04, tp: 2786.92) [done]
2025.08.16 11:55:52.115	2025.01.24 08:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2767.04 آپدیت شد.
2025.08.16 11:55:52.124	2025.01.24 09:00:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2767.36 tp: 2786.92]
2025.08.16 11:55:52.126	2025.01.24 09:00:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2767.36, tp: 2786.92) [done]
2025.08.16 11:55:52.126	2025.01.24 09:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2767.36 آپدیت شد.
2025.08.16 11:55:52.134	2025.01.24 09:15:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2768.30 tp: 2786.92]
2025.08.16 11:55:52.136	2025.01.24 09:15:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2768.30, tp: 2786.92) [done]
2025.08.16 11:55:52.136	2025.01.24 09:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2768.30 آپدیت شد.
2025.08.16 11:55:52.170	2025.01.24 10:15:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2768.42 tp: 2786.92]
2025.08.16 11:55:52.172	2025.01.24 10:15:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2768.42, tp: 2786.92) [done]
2025.08.16 11:55:52.172	2025.01.24 10:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2768.42 آپدیت شد.
2025.08.16 11:55:52.180	2025.01.24 10:30:00   position modified [#14 buy 0.03 XAUUSD 2734.30 sl: 2770.29 tp: 2786.92]
2025.08.16 11:55:52.182	2025.01.24 10:30:00   CTrade::OrderSend: modify position #14 XAUUSD (sl: 2770.29, tp: 2786.92) [done]
2025.08.16 11:55:52.182	2025.01.24 10:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 14 به قیمت 2770.29 آپدیت شد.
2025.08.16 11:55:52.182	2025.01.24 10:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2778.30000
2025.08.16 11:55:52.182	2025.01.24 10:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:52.182	2025.01.24 10:30:00   2777.40000 , 2778.30000
2025.08.16 11:55:52.185	2025.01.24 10:33:34   stop loss triggered #14 buy 0.03 XAUUSD 2734.30 sl: 2770.29 tp: 2786.92 [#15 sell 0.03 XAUUSD at 2770.29]
2025.08.16 11:55:52.185	2025.01.24 10:33:34   deal #15 sell 0.03 XAUUSD at 2770.29 done (based on order #15)
2025.08.16 11:55:52.185	2025.01.24 10:33:34   deal performed [#15 sell 0.03 XAUUSD at 2770.29]
2025.08.16 11:55:52.185	2025.01.24 10:33:34   order performed sell 0.03 at 2770.29 [#15 sell 0.03 XAUUSD at 2770.29]
2025.08.16 11:55:52.185	2025.01.24 10:33:35   TSL Manager [12345]: حالت تیکت 14 از لیست تریلینگ حذف شد.
2025.08.16 11:55:52.185	2025.01.24 10:33:35   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:52.359	2025.01.24 11:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04845 به لیست اضافه شد.
2025.08.16 11:55:52.359	2025.01.24 11:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24183
2025.08.16 11:55:52.359	2025.01.24 11:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:52.359	2025.01.24 11:00:01   1.24038 , 1.24183
2025.08.16 11:55:52.374	2025.01.24 11:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24183
2025.08.16 11:55:52.374	2025.01.24 11:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:52.374	2025.01.24 11:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:52.374	2025.01.24 11:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:52.462	2025.01.24 12:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23765
2025.08.16 11:55:52.462	2025.01.24 12:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:52.462	2025.01.24 12:00:01   1.23449 , 1.23765
2025.08.16 11:55:52.639	2025.01.24 13:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04864 به لیست اضافه شد.
2025.08.16 11:55:52.639	2025.01.24 13:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2770.04000
2025.08.16 11:55:52.639	2025.01.24 13:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:52.639	2025.01.24 13:00:00   2751.28000 , 2770.04000
2025.08.16 11:55:52.732	2025.01.24 13:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.05149
2025.08.16 11:55:52.732	2025.01.24 13:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:52.732	2025.01.24 13:45:01   1.04379 , 1.05149
2025.08.16 11:55:52.816	2025.01.24 14:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24475
2025.08.16 11:55:52.816	2025.01.24 14:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:52.816	2025.01.24 14:00:01   1.24183 , 1.24475
2025.08.16 11:55:52.904	2025.01.24 14:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2778.30000
2025.08.16 11:55:52.904	2025.01.24 14:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:52.904	2025.01.24 14:30:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:52.904	2025.01.24 14:30:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:52.904	2025.01.24 14:30:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:52.904	2025.01.24 14:30:00   market buy 0.04 XAUUSD sl: 2772.26 tp: 2822.72 (2778.60 / 2778.65 / 2778.60)
2025.08.16 11:55:52.904	2025.01.24 14:30:00   deal #16 buy 0.04 XAUUSD at 2778.65 done (based on order #16)
2025.08.16 11:55:52.904	2025.01.24 14:30:00   deal performed [#16 buy 0.04 XAUUSD at 2778.65]
2025.08.16 11:55:52.904	2025.01.24 14:30:00   order performed buy 0.04 at 2778.65 [#16 buy 0.04 XAUUSD at 2778.65]
2025.08.16 11:55:52.906	2025.01.24 14:30:00   CTrade::OrderSend: market buy 0.04 XAUUSD sl: 2772.26 tp: 2822.72 [done at 2778.65]
2025.08.16 11:55:52.906	2025.01.24 14:30:00   XAUUSD: معامله Memento Buy با لات 0.04 با موفقیت باز شد.
2025.08.16 11:55:52.906	2025.01.24 14:30:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:52.984	2025.01.24 14:30:01   TSL Manager [12345]: حالت جدید برای تیکت 16 با SL اولیه 2772.26 اضافه شد.
2025.08.16 11:55:52.984	2025.01.24 14:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04867 به لیست اضافه شد.
2025.08.16 11:55:52.984	2025.01.24 14:30:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:53.279	2025.01.24 16:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04736 به لیست اضافه شد.
2025.08.16 11:55:53.291	2025.01.24 16:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24006
2025.08.16 11:55:53.291	2025.01.24 16:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:53.291	2025.01.24 16:30:01   1.23765 , 1.24006
2025.08.16 11:55:53.462	2025.01.24 16:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24475
2025.08.16 11:55:53.462	2025.01.24 16:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:53.462	2025.01.24 16:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:53.462	2025.01.24 16:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:53.564	2025.01.24 17:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.05012 به لیست اضافه شد.
2025.08.16 11:55:53.582	2025.01.24 17:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.05098 به لیست اضافه شد.
2025.08.16 11:55:53.675	2025.01.24 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04635
2025.08.16 11:55:53.675	2025.01.24 18:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:53.675	2025.01.24 18:00:01   1.04116 , 1.04635
2025.08.16 11:55:53.675	2025.01.24 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.05149
2025.08.16 11:55:53.675	2025.01.24 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:55:53.675	2025.01.24 18:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:53.675	2025.01.24 18:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:53.785	2025.01.24 18:50:03   stop loss triggered #16 buy 0.04 XAUUSD 2778.65 sl: 2772.26 tp: 2822.72 [#17 sell 0.04 XAUUSD at 2772.26]
2025.08.16 11:55:53.785	2025.01.24 18:50:03   deal #17 sell 0.04 XAUUSD at 2772.25 done (based on order #17)
2025.08.16 11:55:53.786	2025.01.24 18:50:03   deal performed [#17 sell 0.04 XAUUSD at 2772.25]
2025.08.16 11:55:53.786	2025.01.24 18:50:03   order performed sell 0.04 at 2772.25 [#17 sell 0.04 XAUUSD at 2772.26]
2025.08.16 11:55:53.786	2025.01.24 18:50:04   TSL Manager [12345]: حالت تیکت 16 از لیست تریلینگ حذف شد.
2025.08.16 11:55:53.786	2025.01.24 18:50:04   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:53.792	2025.01.24 19:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.05170 به لیست اضافه شد.
2025.08.16 11:55:53.792	2025.01.24 19:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.05170) منقضی شد و حذف می‌شود.
2025.08.16 11:55:53.896	2025.01.24 20:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2785.94000
2025.08.16 11:55:53.896	2025.01.24 20:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:53.896	2025.01.24 20:00:00   2778.30000 , 2785.94000
2025.08.16 11:55:53.981	2025.01.24 20:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.05098) منقضی شد و حذف می‌شود.
2025.08.16 11:55:53.991	2025.01.24 20:45:02   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.05012) منقضی شد و حذف می‌شود.
2025.08.16 11:55:54.001	2025.01.24 21:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2769.99000
2025.08.16 11:55:54.001	2025.01.24 21:15:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:54.001	2025.01.24 21:15:00   2770.04000 , 2769.99000
2025.08.16 11:55:54.163	2025.01.24 21:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.05214
2025.08.16 11:55:54.163	2025.01.24 21:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:54.163	2025.01.24 21:45:01   1.05149 , 1.05214
2025.08.16 11:55:54.167	2025.01.24 22:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.25016
2025.08.16 11:55:54.167	2025.01.24 22:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:54.167	2025.01.24 22:00:01   1.24475 , 1.25016
2025.08.16 11:55:54.186	2025.01.24 23:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04943 به لیست اضافه شد.
2025.08.16 11:55:54.190	2025.01.24 23:15:07   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04967 به لیست اضافه شد.
2025.08.16 11:55:54.190	2025.01.24 23:15:07   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04967) منقضی شد و حذف می‌شود.
2025.08.16 11:55:54.592	2025.01.27 00:01:09   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:54.592	2025.01.27 00:01:09   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04943) منقضی شد و حذف می‌شود.
2025.08.16 11:55:54.598	2025.01.27 01:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2769.99000
2025.08.16 11:55:54.598	2025.01.27 01:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:54.598	2025.01.27 01:00:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:54.598	2025.01.27 01:00:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:54.598	2025.01.27 01:00:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال فروش
2025.08.16 11:55:54.598	2025.01.27 01:00:00   market sell 0.04 XAUUSD sl: 2775.75 tp: 2728.41 (2769.76 / 2769.89 / 2769.76)
2025.08.16 11:55:54.598	2025.01.27 01:00:00   deal #18 sell 0.04 XAUUSD at 2769.76 done (based on order #18)
2025.08.16 11:55:54.598	2025.01.27 01:00:00   deal performed [#18 sell 0.04 XAUUSD at 2769.76]
2025.08.16 11:55:54.598	2025.01.27 01:00:00   order performed sell 0.04 at 2769.76 [#18 sell 0.04 XAUUSD at 2769.76]
2025.08.16 11:55:54.600	2025.01.27 01:00:00   CTrade::OrderSend: market sell 0.04 XAUUSD sl: 2775.75 tp: 2728.41 [done at 2769.76]
2025.08.16 11:55:54.600	2025.01.27 01:00:00   XAUUSD: معامله Memento Sell با لات 0.04 با موفقیت باز شد.
2025.08.16 11:55:54.600	2025.01.27 01:00:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:54.679	2025.01.27 01:00:01   TSL Manager [12345]: حالت جدید برای تیکت 18 با SL اولیه 2775.75 اضافه شد.
2025.08.16 11:55:54.679	2025.01.27 01:00:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:54.765	2025.01.27 01:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:54.770	2025.01.27 01:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04736) منقضی شد و حذف می‌شود.
2025.08.16 11:55:54.770	2025.01.27 01:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24892
2025.08.16 11:55:54.770	2025.01.27 01:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:54.770	2025.01.27 01:30:01   1.25016 , 1.24892
2025.08.16 11:55:55.084	2025.01.27 04:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.04635
2025.08.16 11:55:55.084	2025.01.27 04:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:55.084	2025.01.27 04:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:55.084	2025.01.27 04:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:55.249	2025.01.27 07:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04590
2025.08.16 11:55:55.249	2025.01.27 07:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:55.249	2025.01.27 07:00:01   1.04635 , 1.04590
2025.08.16 11:55:55.249	2025.01.27 07:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24422
2025.08.16 11:55:55.249	2025.01.27 07:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:55.249	2025.01.27 07:00:01   1.24006 , 1.24422
2025.08.16 11:55:55.414	2025.01.27 07:15:08   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.04590
2025.08.16 11:55:55.414	2025.01.27 07:15:08   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:55.414	2025.01.27 07:15:08   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:55.414	2025.01.27 07:15:08   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:55.621	2025.01.27 08:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:55.740	2025.01.27 09:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04701 به لیست اضافه شد.
2025.08.16 11:55:55.748	2025.01.27 10:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:55.748	2025.01.27 10:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04701) منقضی شد و حذف می‌شود.
2025.08.16 11:55:55.748	2025.01.27 10:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24422
2025.08.16 11:55:55.748	2025.01.27 10:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:55.748	2025.01.27 10:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:55.748	2025.01.27 10:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:55.839	2025.01.27 10:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04716 به لیست اضافه شد.
2025.08.16 11:55:55.850	2025.01.27 10:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:55.869	2025.01.27 11:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04876 به لیست اضافه شد.
2025.08.16 11:55:55.880	2025.01.27 11:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04798 به لیست اضافه شد.
2025.08.16 11:55:55.888	2025.01.27 11:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04539
2025.08.16 11:55:55.888	2025.01.27 11:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:55.888	2025.01.27 11:30:01   1.04590 , 1.04539
2025.08.16 11:55:56.152	2025.01.27 12:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2747.32000
2025.08.16 11:55:56.152	2025.01.27 12:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:56.152	2025.01.27 12:00:00   2769.99000 , 2747.32000
2025.08.16 11:55:56.243	2025.01.27 12:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24892
2025.08.16 11:55:56.243	2025.01.27 12:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:56.243	2025.01.27 12:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:56.243	2025.01.27 12:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:56.414	2025.01.27 12:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24259
2025.08.16 11:55:56.414	2025.01.27 12:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:56.415	2025.01.27 12:30:01   1.24422 , 1.24259
2025.08.16 11:55:56.753	2025.01.27 15:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.05214
2025.08.16 11:55:56.753	2025.01.27 15:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:56.753	2025.01.27 15:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:56.753	2025.01.27 15:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:57.029	2025.01.27 16:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2771.88000
2025.08.16 11:55:57.029	2025.01.27 16:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:57.030	2025.01.27 16:15:00   2785.94000 , 2771.88000
2025.08.16 11:55:57.122	2025.01.27 16:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.05228 به لیست اضافه شد.
2025.08.16 11:55:57.122	2025.01.27 16:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.05228) منقضی شد و حذف می‌شود.
2025.08.16 11:55:57.150	2025.01.27 17:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2747.32000
2025.08.16 11:55:57.150	2025.01.27 17:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:57.320	2025.01.27 17:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.25228
2025.08.16 11:55:57.320	2025.01.27 17:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:57.320	2025.01.27 17:30:01   1.24892 , 1.25228
2025.08.16 11:55:57.321	2025.01.27 17:30:04   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.05330
2025.08.16 11:55:57.321	2025.01.27 17:30:04   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:57.321	2025.01.27 17:30:04   1.05214 , 1.05330
2025.08.16 11:55:57.324	2025.01.27 17:35:18   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2756.47 tp: 2728.41]
2025.08.16 11:55:57.326	2025.01.27 17:35:18   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2756.47, tp: 2728.41) [done]
2025.08.16 11:55:57.326	2025.01.27 17:35:18   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2756.47 آپدیت شد.
2025.08.16 11:55:57.422	2025.01.27 18:00:40   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2755.76 tp: 2728.41]
2025.08.16 11:55:57.424	2025.01.27 18:00:40   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2755.76, tp: 2728.41) [done]
2025.08.16 11:55:57.424	2025.01.27 18:00:40   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2755.76 آپدیت شد.
2025.08.16 11:55:57.437	2025.01.27 18:15:26   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2755.05 tp: 2728.41]
2025.08.16 11:55:57.439	2025.01.27 18:15:26   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2755.05, tp: 2728.41) [done]
2025.08.16 11:55:57.439	2025.01.27 18:15:26   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2755.05 آپدیت شد.
2025.08.16 11:55:57.539	2025.01.27 18:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:57.549	2025.01.27 19:00:00   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2752.66 tp: 2728.41]
2025.08.16 11:55:57.551	2025.01.27 19:00:00   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2752.66, tp: 2728.41) [done]
2025.08.16 11:55:57.551	2025.01.27 19:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2752.66 آپدیت شد.
2025.08.16 11:55:57.641	2025.01.27 19:15:00   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2751.21 tp: 2728.41]
2025.08.16 11:55:57.643	2025.01.27 19:15:00   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2751.21, tp: 2728.41) [done]
2025.08.16 11:55:57.643	2025.01.27 19:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2751.21 آپدیت شد.
2025.08.16 11:55:57.765	2025.01.27 20:30:00   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2751.03 tp: 2728.41]
2025.08.16 11:55:57.767	2025.01.27 20:30:00   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2751.03, tp: 2728.41) [done]
2025.08.16 11:55:57.767	2025.01.27 20:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2751.03 آپدیت شد.
2025.08.16 11:55:57.780	2025.01.27 20:45:00   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2748.25 tp: 2728.41]
2025.08.16 11:55:57.782	2025.01.27 20:45:00   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2748.25, tp: 2728.41) [done]
2025.08.16 11:55:57.782	2025.01.27 20:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2748.25 آپدیت شد.
2025.08.16 11:55:57.865	2025.01.27 21:00:00   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2747.19 tp: 2728.41]
2025.08.16 11:55:57.867	2025.01.27 21:00:00   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2747.19, tp: 2728.41) [done]
2025.08.16 11:55:57.867	2025.01.27 21:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2747.19 آپدیت شد.
2025.08.16 11:55:57.889	2025.01.27 21:30:00   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2746.51 tp: 2728.41]
2025.08.16 11:55:57.891	2025.01.27 21:30:00   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2746.51, tp: 2728.41) [done]
2025.08.16 11:55:57.891	2025.01.27 21:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2746.51 آپدیت شد.
2025.08.16 11:55:57.891	2025.01.27 21:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2730.48000
2025.08.16 11:55:57.891	2025.01.27 21:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:57.891	2025.01.27 21:30:00   2747.32000 , 2730.48000
2025.08.16 11:55:57.891	2025.01.27 21:30:02   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24671
2025.08.16 11:55:57.891	2025.01.27 21:30:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:57.891	2025.01.27 21:30:02   1.24259 , 1.24671
2025.08.16 11:55:57.984	2025.01.27 22:00:00   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2744.98 tp: 2728.41]
2025.08.16 11:55:57.986	2025.01.27 22:00:00   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2744.98, tp: 2728.41) [done]
2025.08.16 11:55:57.986	2025.01.27 22:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2744.98 آپدیت شد.
2025.08.16 11:55:58.075	2025.01.27 22:15:00   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2744.35 tp: 2728.41]
2025.08.16 11:55:58.077	2025.01.27 22:15:00   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2744.35, tp: 2728.41) [done]
2025.08.16 11:55:58.077	2025.01.27 22:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2744.35 آپدیت شد.
2025.08.16 11:55:58.085	2025.01.27 22:30:00   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2744.27 tp: 2728.41]
2025.08.16 11:55:58.087	2025.01.27 22:30:00   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2744.27, tp: 2728.41) [done]
2025.08.16 11:55:58.087	2025.01.27 22:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2744.27 آپدیت شد.
2025.08.16 11:55:58.094	2025.01.27 22:48:39   position modified [#18 sell 0.04 XAUUSD 2769.76 sl: 2742.97 tp: 2728.41]
2025.08.16 11:55:58.096	2025.01.27 22:48:39   CTrade::OrderSend: modify position #18 XAUUSD (sl: 2742.97, tp: 2728.41) [done]
2025.08.16 11:55:58.096	2025.01.27 22:48:39   TSL Manager [12345]: تریلینگ استاپ برای تیکت 18 به قیمت 2742.97 آپدیت شد.
2025.08.16 11:55:58.187	2025.01.27 23:07:41   stop loss triggered #18 sell 0.04 XAUUSD 2769.76 sl: 2742.97 tp: 2728.41 [#19 buy 0.04 XAUUSD at 2742.97]
2025.08.16 11:55:58.187	2025.01.27 23:07:41   deal #19 buy 0.04 XAUUSD at 2742.98 done (based on order #19)
2025.08.16 11:55:58.187	2025.01.27 23:07:41   deal performed [#19 buy 0.04 XAUUSD at 2742.98]
2025.08.16 11:55:58.187	2025.01.27 23:07:41   order performed buy 0.04 at 2742.98 [#19 buy 0.04 XAUUSD at 2742.97]
2025.08.16 11:55:58.187	2025.01.27 23:07:41   TSL Manager [12345]: حالت تیکت 18 از لیست تریلینگ حذف شد.
2025.08.16 11:55:58.187	2025.01.27 23:07:41   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:58.192	2025.01.27 23:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04791
2025.08.16 11:55:58.192	2025.01.27 23:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:58.192	2025.01.27 23:30:01   1.04539 , 1.04791
2025.08.16 11:55:58.274	2025.01.27 23:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:58.295	2025.01.28 01:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04919 به لیست اضافه شد.
2025.08.16 11:55:58.295	2025.01.28 01:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04919) منقضی شد و حذف می‌شود.
2025.08.16 11:55:58.296	2025.01.28 01:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04941
2025.08.16 11:55:58.296	2025.01.28 01:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:58.296	2025.01.28 01:00:01   1.05330 , 1.04941
2025.08.16 11:55:58.378	2025.01.28 01:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.04791
2025.08.16 11:55:58.378	2025.01.28 01:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:58.383	2025.01.28 01:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04716) منقضی شد و حذف می‌شود.
2025.08.16 11:55:58.383	2025.01.28 01:30:02   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:58.383	2025.01.28 01:30:02   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24671
2025.08.16 11:55:58.383	2025.01.28 01:30:02   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:58.384	2025.01.28 01:30:02   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:58.384	2025.01.28 01:30:02   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:58.555	2025.01.28 02:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.25001
2025.08.16 11:55:58.555	2025.01.28 02:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:58.555	2025.01.28 02:15:01   1.25228 , 1.25001
2025.08.16 11:55:58.666	2025.01.28 03:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2745.32000
2025.08.16 11:55:58.666	2025.01.28 03:45:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:58.666	2025.01.28 03:45:00   2771.88000 , 2745.32000
2025.08.16 11:55:58.672	2025.01.28 04:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04277
2025.08.16 11:55:58.672	2025.01.28 04:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:58.672	2025.01.28 04:00:01   1.04791 , 1.04277
2025.08.16 11:55:58.672	2025.01.28 04:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24361
2025.08.16 11:55:58.672	2025.01.28 04:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:58.672	2025.01.28 04:00:01   1.24671 , 1.24361
2025.08.16 11:55:58.804	2025.01.28 06:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04248
2025.08.16 11:55:58.804	2025.01.28 06:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:58.804	2025.01.28 06:30:01   1.04277 , 1.04248
2025.08.16 11:55:58.888	2025.01.28 06:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:58.892	2025.01.28 07:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04282 به لیست اضافه شد.
2025.08.16 11:55:58.896	2025.01.28 07:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04334 به لیست اضافه شد.
2025.08.16 11:55:58.904	2025.01.28 07:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04390 به لیست اضافه شد.
2025.08.16 11:55:58.904	2025.01.28 07:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04390) منقضی شد و حذف می‌شود.
2025.08.16 11:55:58.913	2025.01.28 08:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2737.80000
2025.08.16 11:55:58.913	2025.01.28 08:15:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:58.913	2025.01.28 08:15:00   2730.48000 , 2737.80000
2025.08.16 11:55:58.994	2025.01.28 08:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04436 به لیست اضافه شد.
2025.08.16 11:55:58.994	2025.01.28 08:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04436) منقضی شد و حذف می‌شود.
2025.08.16 11:55:59.000	2025.01.28 08:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:59.005	2025.01.28 09:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24343
2025.08.16 11:55:59.005	2025.01.28 09:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:59.005	2025.01.28 09:00:01   1.24361 , 1.24343
2025.08.16 11:55:59.096	2025.01.28 09:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2744.89000
2025.08.16 11:55:59.096	2025.01.28 09:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:59.096	2025.01.28 09:30:00   2745.32000 , 2744.89000
2025.08.16 11:55:59.177	2025.01.28 09:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24343
2025.08.16 11:55:59.177	2025.01.28 09:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:59.178	2025.01.28 09:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:59.178	2025.01.28 09:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:55:59.273	2025.01.28 10:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2737.80000
2025.08.16 11:55:59.273	2025.01.28 10:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:55:59.281	2025.01.28 10:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24534
2025.08.16 11:55:59.281	2025.01.28 10:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:59.281	2025.01.28 10:45:01   1.25001 , 1.24534
2025.08.16 11:55:59.366	2025.01.28 11:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04440
2025.08.16 11:55:59.366	2025.01.28 11:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:59.366	2025.01.28 11:00:01   1.04941 , 1.04440
2025.08.16 11:55:59.448	2025.01.28 11:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04224 به لیست اضافه شد.
2025.08.16 11:55:59.455	2025.01.28 11:30:02   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04411 به لیست اضافه شد.
2025.08.16 11:55:59.539	2025.01.28 11:45:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04411) منقضی شد و حذف می‌شود.
2025.08.16 11:55:59.552	2025.01.28 12:15:22   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24260
2025.08.16 11:55:59.552	2025.01.28 12:15:22   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:59.552	2025.01.28 12:15:22   1.24343 , 1.24260
2025.08.16 11:55:59.634	2025.01.28 12:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2744.89000
2025.08.16 11:55:59.634	2025.01.28 12:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:55:59.634	2025.01.28 12:30:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:55:59.634	2025.01.28 12:30:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:55:59.634	2025.01.28 12:30:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:55:59.634	2025.01.28 12:30:00   market buy 0.03 XAUUSD sl: 2738.25 tp: 2791.10 (2744.75 / 2744.94 / 2744.75)
2025.08.16 11:55:59.634	2025.01.28 12:30:00   deal #20 buy 0.03 XAUUSD at 2744.94 done (based on order #20)
2025.08.16 11:55:59.634	2025.01.28 12:30:00   deal performed [#20 buy 0.03 XAUUSD at 2744.94]
2025.08.16 11:55:59.634	2025.01.28 12:30:00   order performed buy 0.03 at 2744.94 [#20 buy 0.03 XAUUSD at 2744.94]
2025.08.16 11:55:59.636	2025.01.28 12:30:00   CTrade::OrderSend: market buy 0.03 XAUUSD sl: 2738.25 tp: 2791.10 [done at 2744.94]
2025.08.16 11:55:59.636	2025.01.28 12:30:00   XAUUSD: معامله Memento Buy با لات 0.03 با موفقیت باز شد.
2025.08.16 11:55:59.636	2025.01.28 12:30:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:55:59.713	2025.01.28 12:30:01   TSL Manager [12345]: حالت جدید برای تیکت 20 با SL اولیه 2738.25 اضافه شد.
2025.08.16 11:55:59.713	2025.01.28 12:30:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:55:59.719	2025.01.28 12:45:05   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04342 به لیست اضافه شد.
2025.08.16 11:55:59.807	2025.01.28 13:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2734.81000
2025.08.16 11:55:59.807	2025.01.28 13:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:59.807	2025.01.28 13:00:00   2737.80000 , 2734.81000
2025.08.16 11:55:59.807	2025.01.28 13:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:59.807	2025.01.28 13:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.04248
2025.08.16 11:55:59.807	2025.01.28 13:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به نزولی (MSS DOWN)
2025.08.16 11:55:59.807	2025.01.28 13:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:55:59.808	2025.01.28 13:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:55:59.886	2025.01.28 13:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04342) منقضی شد و حذف می‌شود.
2025.08.16 11:55:59.886	2025.01.28 13:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:55:59.974	2025.01.28 13:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04192
2025.08.16 11:55:59.974	2025.01.28 13:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:55:59.974	2025.01.28 13:15:01   1.04248 , 1.04192
2025.08.16 11:55:59.984	2025.01.28 13:45:04   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24555
2025.08.16 11:55:59.984	2025.01.28 13:45:04   POPULATED! New swing high prices data is as below:
2025.08.16 11:55:59.984	2025.01.28 13:45:04   1.24534 , 1.24555
2025.08.16 11:56:00.100	2025.01.28 14:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2745.24000
2025.08.16 11:56:00.100	2025.01.28 14:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:00.100	2025.01.28 14:00:00   2744.89000 , 2745.24000
2025.08.16 11:56:00.101	2025.01.28 14:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04443
2025.08.16 11:56:00.101	2025.01.28 14:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:00.101	2025.01.28 14:00:01   1.04440 , 1.04443
2025.08.16 11:56:00.291	2025.01.28 15:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2745.24000
2025.08.16 11:56:00.291	2025.01.28 15:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:00.570	2025.01.28 16:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24260
2025.08.16 11:56:00.570	2025.01.28 16:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:00.570	2025.01.28 16:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:56:00.570	2025.01.28 16:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:00.665	2025.01.28 16:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04138
2025.08.16 11:56:00.666	2025.01.28 16:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:00.666	2025.01.28 16:30:01   1.04192 , 1.04138
2025.08.16 11:56:00.666	2025.01.28 16:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04321 به لیست اضافه شد.
2025.08.16 11:56:00.666	2025.01.28 16:30:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04321) منقضی شد و حذف می‌شود.
2025.08.16 11:56:00.950	2025.01.28 17:45:04   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:00.966	2025.01.28 18:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24143
2025.08.16 11:56:00.966	2025.01.28 18:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:00.966	2025.01.28 18:15:01   1.24260 , 1.24143
2025.08.16 11:56:01.076	2025.01.28 19:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04409
2025.08.16 11:56:01.076	2025.01.28 19:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:01.076	2025.01.28 19:00:01   1.04443 , 1.04409
2025.08.16 11:56:01.188	2025.01.28 20:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24469
2025.08.16 11:56:01.188	2025.01.28 20:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:01.188	2025.01.28 20:00:01   1.24555 , 1.24469
2025.08.16 11:56:01.281	2025.01.28 20:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04346 به لیست اضافه شد.
2025.08.16 11:56:01.287	2025.01.28 20:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:01.301	2025.01.28 21:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:01.301	2025.01.28 21:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24217
2025.08.16 11:56:01.301	2025.01.28 21:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:01.301	2025.01.28 21:15:01   1.24143 , 1.24217
2025.08.16 11:56:01.388	2025.01.28 21:30:03   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04268 به لیست اضافه شد.
2025.08.16 11:56:01.419	2025.01.28 23:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04381
2025.08.16 11:56:01.419	2025.01.28 23:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:01.419	2025.01.28 23:00:01   1.04409 , 1.04381
2025.08.16 11:56:01.508	2025.01.28 23:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:01.512	2025.01.28 23:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04225
2025.08.16 11:56:01.512	2025.01.28 23:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:01.512	2025.01.28 23:45:01   1.04138 , 1.04225
2025.08.16 11:56:01.533	2025.01.29 00:00:34   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:01.533	2025.01.29 00:01:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24469
2025.08.16 11:56:01.533	2025.01.29 00:01:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:01.537	2025.01.29 00:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:01.621	2025.01.29 00:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04280 به لیست اضافه شد.
2025.08.16 11:56:01.623	2025.01.29 00:45:13   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24453
2025.08.16 11:56:01.623	2025.01.29 00:45:13   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:01.623	2025.01.29 00:45:13   1.24469 , 1.24453
2025.08.16 11:56:01.623	2025.01.29 00:45:13   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24453
2025.08.16 11:56:01.623	2025.01.29 00:45:13   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:01.623	2025.01.29 00:45:13   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:01.623	2025.01.29 00:45:13   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:01.717	2025.01.29 02:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:01.720	2025.01.29 02:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2765.11000
2025.08.16 11:56:01.720	2025.01.29 02:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:01.720	2025.01.29 02:15:00   2745.24000 , 2765.11000
2025.08.16 11:56:01.721	2025.01.29 02:15:02   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04335 به لیست اضافه شد.
2025.08.16 11:56:01.808	2025.01.29 02:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04335) منقضی شد و حذف می‌شود.
2025.08.16 11:56:01.808	2025.01.29 02:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04236
2025.08.16 11:56:01.808	2025.01.29 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:01.808	2025.01.29 02:30:01   1.04225 , 1.04236
2025.08.16 11:56:01.987	2025.01.29 03:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2765.11000
2025.08.16 11:56:01.987	2025.01.29 03:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:02.087	2025.01.29 04:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:02.093	2025.01.29 04:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04316 به لیست اضافه شد.
2025.08.16 11:56:02.099	2025.01.29 04:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2762.28000
2025.08.16 11:56:02.099	2025.01.29 04:30:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:02.099	2025.01.29 04:30:00   2734.81000 , 2762.28000
2025.08.16 11:56:02.099	2025.01.29 04:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:02.099	2025.01.29 04:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24470
2025.08.16 11:56:02.099	2025.01.29 04:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:02.099	2025.01.29 04:30:01   1.24453 , 1.24470
2025.08.16 11:56:02.185	2025.01.29 04:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04342
2025.08.16 11:56:02.185	2025.01.29 04:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:02.185	2025.01.29 04:45:01   1.04381 , 1.04342
2025.08.16 11:56:02.269	2025.01.29 05:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04338 به لیست اضافه شد.
2025.08.16 11:56:02.270	2025.01.29 05:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04338) منقضی شد و حذف می‌شود.
2025.08.16 11:56:02.270	2025.01.29 05:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.04342
2025.08.16 11:56:02.270	2025.01.29 05:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:02.361	2025.01.29 05:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24470
2025.08.16 11:56:02.361	2025.01.29 05:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:56:02.361	2025.01.29 05:30:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:02.361	2025.01.29 05:30:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:02.533	2025.01.29 06:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04389 به لیست اضافه شد.
2025.08.16 11:56:02.533	2025.01.29 06:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04389) منقضی شد و حذف می‌شود.
2025.08.16 11:56:02.533	2025.01.29 06:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2766.20000
2025.08.16 11:56:02.533	2025.01.29 06:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:02.533	2025.01.29 06:00:00   2765.11000 , 2766.20000
2025.08.16 11:56:02.622	2025.01.29 06:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست کف در قیمت 2762.28000
2025.08.16 11:56:02.622	2025.01.29 06:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:02.622	2025.01.29 06:15:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:56:02.622	2025.01.29 06:15:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:56:02.622	2025.01.29 06:15:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال فروش
2025.08.16 11:56:02.622	2025.01.29 06:15:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:56:02.622	2025.01.29 06:15:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:56:02.627	2025.01.29 06:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04258
2025.08.16 11:56:02.627	2025.01.29 06:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:02.628	2025.01.29 06:30:01   1.04236 , 1.04258
2025.08.16 11:56:02.628	2025.01.29 06:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24343
2025.08.16 11:56:02.628	2025.01.29 06:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:02.628	2025.01.29 06:30:01   1.24217 , 1.24343
2025.08.16 11:56:02.638	2025.01.29 07:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04400 به لیست اضافه شد.
2025.08.16 11:56:02.638	2025.01.29 07:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04400) منقضی شد و حذف می‌شود.
2025.08.16 11:56:02.939	2025.01.29 09:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:02.939	2025.01.29 09:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.04258
2025.08.16 11:56:02.939	2025.01.29 09:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:02.939	2025.01.29 09:30:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:56:02.939	2025.01.29 09:30:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:56:02.939	2025.01.29 09:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04268) منقضی شد و حذف می‌شود.
2025.08.16 11:56:03.065	2025.01.29 11:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04435
2025.08.16 11:56:03.065	2025.01.29 11:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:03.065	2025.01.29 11:00:01   1.04342 , 1.04435
2025.08.16 11:56:03.065	2025.01.29 11:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:03.156	2025.01.29 11:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04245 به لیست اضافه شد.
2025.08.16 11:56:03.156	2025.01.29 11:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04245) منقضی شد و حذف می‌شود.
2025.08.16 11:56:03.236	2025.01.29 11:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24343
2025.08.16 11:56:03.236	2025.01.29 11:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:03.236	2025.01.29 11:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:56:03.236	2025.01.29 11:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:03.334	2025.01.29 11:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24630
2025.08.16 11:56:03.334	2025.01.29 11:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:03.334	2025.01.29 11:45:01   1.24470 , 1.24630
2025.08.16 11:56:03.510	2025.01.29 12:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04056 به لیست اضافه شد.
2025.08.16 11:56:03.510	2025.01.29 12:15:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04056) منقضی شد و حذف می‌شود.
2025.08.16 11:56:04.175	2025.01.29 17:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24283
2025.08.16 11:56:04.175	2025.01.29 17:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:04.175	2025.01.29 17:30:01   1.24630 , 1.24283
2025.08.16 11:56:04.264	2025.01.29 17:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04250 به لیست اضافه شد.
2025.08.16 11:56:04.264	2025.01.29 17:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04250 به لیست اضافه شد.
2025.08.16 11:56:04.264	2025.01.29 17:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24283
2025.08.16 11:56:04.264	2025.01.29 17:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:04.264	2025.01.29 17:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:04.264	2025.01.29 17:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:04.440	2025.01.29 18:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04250) منقضی شد و حذف می‌شود.
2025.08.16 11:56:04.440	2025.01.29 18:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23930
2025.08.16 11:56:04.440	2025.01.29 18:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:04.440	2025.01.29 18:00:01   1.24343 , 1.23930
2025.08.16 11:56:04.452	2025.01.29 18:15:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03822
2025.08.16 11:56:04.452	2025.01.29 18:15:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:04.452	2025.01.29 18:15:01   1.04258 , 1.03822
2025.08.16 11:56:04.726	2025.01.29 21:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04283
2025.08.16 11:56:04.726	2025.01.29 21:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:04.726	2025.01.29 21:45:01   1.04435 , 1.04283
2025.08.16 11:56:05.013	2025.01.29 22:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04160 به لیست اضافه شد.
2025.08.16 11:56:05.013	2025.01.29 22:45:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04160) منقضی شد و حذف می‌شود.
2025.08.16 11:56:05.111	2025.01.29 23:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04089 به لیست اضافه شد.
2025.08.16 11:56:05.119	2025.01.29 23:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2744.76000
2025.08.16 11:56:05.119	2025.01.29 23:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:05.119	2025.01.29 23:45:00   2762.28000 , 2744.76000
2025.08.16 11:56:05.219	2025.01.30 00:00:34   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04176 به لیست اضافه شد.
2025.08.16 11:56:05.219	2025.01.30 00:00:34   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03882
2025.08.16 11:56:05.219	2025.01.30 00:00:34   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:05.219	2025.01.30 00:00:34   1.03822 , 1.03882
2025.08.16 11:56:05.219	2025.01.30 00:01:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24121
2025.08.16 11:56:05.219	2025.01.30 00:01:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:05.219	2025.01.30 00:01:01   1.23930 , 1.24121
2025.08.16 11:56:05.221	2025.01.30 00:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04176) منقضی شد و حذف می‌شود.
2025.08.16 11:56:05.221	2025.01.30 00:15:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04287
2025.08.16 11:56:05.221	2025.01.30 00:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:05.221	2025.01.30 00:15:01   1.04283 , 1.04287
2025.08.16 11:56:05.221	2025.01.30 00:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24578
2025.08.16 11:56:05.221	2025.01.30 00:15:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:05.221	2025.01.30 00:15:01   1.24283 , 1.24578
2025.08.16 11:56:05.305	2025.01.30 00:30:15   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04198 به لیست اضافه شد.
2025.08.16 11:56:05.310	2025.01.30 01:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04200 به لیست اضافه شد.
2025.08.16 11:56:05.314	2025.01.30 01:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04200) منقضی شد و حذف می‌شود.
2025.08.16 11:56:05.314	2025.01.30 01:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04198) منقضی شد و حذف می‌شود.
2025.08.16 11:56:05.317	2025.01.30 01:30:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04214 به لیست اضافه شد.
2025.08.16 11:56:05.325	2025.01.30 01:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04256 به لیست اضافه شد.
2025.08.16 11:56:05.332	2025.01.30 02:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04256) منقضی شد و حذف می‌شود.
2025.08.16 11:56:05.337	2025.01.30 02:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24578
2025.08.16 11:56:05.337	2025.01.30 02:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:56:05.337	2025.01.30 02:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:05.337	2025.01.30 02:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:05.448	2025.01.30 03:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04214) منقضی شد و حذف می‌شود.
2025.08.16 11:56:05.475	2025.01.30 04:45:02   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24597
2025.08.16 11:56:05.475	2025.01.30 04:45:02   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:05.476	2025.01.30 04:45:02   1.24578 , 1.24597
2025.08.16 11:56:05.476	2025.01.30 04:45:03   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04288
2025.08.16 11:56:05.476	2025.01.30 04:45:03   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:05.476	2025.01.30 04:45:03   1.04287 , 1.04288
2025.08.16 11:56:05.647	2025.01.30 05:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2762.55000
2025.08.16 11:56:05.647	2025.01.30 05:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:05.647	2025.01.30 05:15:00   2766.20000 , 2762.55000
2025.08.16 11:56:05.748	2025.01.30 06:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2762.55000
2025.08.16 11:56:05.748	2025.01.30 06:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:05.748	2025.01.30 06:15:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:05.748	2025.01.30 06:15:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:56:05.748	2025.01.30 06:15:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:56:05.748	2025.01.30 06:15:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:56:05.748	2025.01.30 06:15:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:56:05.864	2025.01.30 08:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04177 به لیست اضافه شد.
2025.08.16 11:56:05.869	2025.01.30 08:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.04226 به لیست اضافه شد.
2025.08.16 11:56:05.869	2025.01.30 08:15:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04226) منقضی شد و حذف می‌شود.
2025.08.16 11:56:05.873	2025.01.30 08:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2763.45000
2025.08.16 11:56:05.873	2025.01.30 08:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:05.873	2025.01.30 08:30:00   2762.55000 , 2763.45000
2025.08.16 11:56:05.873	2025.01.30 08:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04274
2025.08.16 11:56:05.873	2025.01.30 08:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:05.873	2025.01.30 08:30:01   1.04288 , 1.04274
2025.08.16 11:56:05.966	2025.01.30 09:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2763.45000
2025.08.16 11:56:05.966	2025.01.30 09:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:05.966	2025.01.30 09:00:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:05.966	2025.01.30 09:00:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:56:05.966	2025.01.30 09:00:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:56:05.966	2025.01.30 09:00:00   XAUUSD: رسیدن به حد مجاز معاملات. معامله جدید باز نشد.
2025.08.16 11:56:05.966	2025.01.30 09:00:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:56:06.153	2025.01.30 10:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.04274
2025.08.16 11:56:06.153	2025.01.30 10:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:06.243	2025.01.30 10:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04201 به لیست اضافه شد.
2025.08.16 11:56:06.249	2025.01.30 10:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:06.256	2025.01.30 10:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:06.257	2025.01.30 10:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04208 به لیست اضافه شد.
2025.08.16 11:56:06.273	2025.01.30 11:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:06.280	2025.01.30 11:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24316
2025.08.16 11:56:06.281	2025.01.30 11:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:06.281	2025.01.30 11:30:01   1.24121 , 1.24316
2025.08.16 11:56:06.548	2025.01.30 12:15:58   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2767.68 tp: 2791.10]
2025.08.16 11:56:06.550	2025.01.30 12:15:58   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2767.68, tp: 2791.10) [done]
2025.08.16 11:56:06.550	2025.01.30 12:15:58   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2767.68 آپدیت شد.
2025.08.16 11:56:06.557	2025.01.30 12:30:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2768.86 tp: 2791.10]
2025.08.16 11:56:06.559	2025.01.30 12:30:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2768.86, tp: 2791.10) [done]
2025.08.16 11:56:06.559	2025.01.30 12:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2768.86 آپدیت شد.
2025.08.16 11:56:06.559	2025.01.30 12:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04288
2025.08.16 11:56:06.559	2025.01.30 12:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:06.559	2025.01.30 12:30:01   1.04274 , 1.04288
2025.08.16 11:56:06.559	2025.01.30 12:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24622
2025.08.16 11:56:06.559	2025.01.30 12:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:06.559	2025.01.30 12:30:01   1.24597 , 1.24622
2025.08.16 11:56:06.649	2025.01.30 12:45:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2768.95 tp: 2791.10]
2025.08.16 11:56:06.651	2025.01.30 12:45:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2768.95, tp: 2791.10) [done]
2025.08.16 11:56:06.651	2025.01.30 12:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2768.95 آپدیت شد.
2025.08.16 11:56:06.659	2025.01.30 13:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24316
2025.08.16 11:56:06.659	2025.01.30 13:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:06.659	2025.01.30 13:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:56:06.659	2025.01.30 13:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:06.752	2025.01.30 13:30:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2768.97 tp: 2791.10]
2025.08.16 11:56:06.754	2025.01.30 13:30:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2768.97, tp: 2791.10) [done]
2025.08.16 11:56:06.754	2025.01.30 13:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2768.97 آپدیت شد.
2025.08.16 11:56:06.763	2025.01.30 13:45:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2769.04 tp: 2791.10]
2025.08.16 11:56:06.765	2025.01.30 13:45:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2769.04, tp: 2791.10) [done]
2025.08.16 11:56:06.765	2025.01.30 13:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2769.04 آپدیت شد.
2025.08.16 11:56:06.777	2025.01.30 14:15:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2769.22 tp: 2791.10]
2025.08.16 11:56:06.779	2025.01.30 14:15:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2769.22, tp: 2791.10) [done]
2025.08.16 11:56:06.779	2025.01.30 14:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2769.22 آپدیت شد.
2025.08.16 11:56:06.787	2025.01.30 14:30:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2769.82 tp: 2791.10]
2025.08.16 11:56:06.789	2025.01.30 14:30:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2769.82, tp: 2791.10) [done]
2025.08.16 11:56:06.789	2025.01.30 14:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2769.82 آپدیت شد.
2025.08.16 11:56:06.794	2025.01.30 14:45:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2770.68 tp: 2791.10]
2025.08.16 11:56:06.797	2025.01.30 14:45:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2770.68, tp: 2791.10) [done]
2025.08.16 11:56:06.797	2025.01.30 14:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2770.68 آپدیت شد.
2025.08.16 11:56:06.802	2025.01.30 15:00:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2770.91 tp: 2791.10]
2025.08.16 11:56:06.804	2025.01.30 15:00:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2770.91, tp: 2791.10) [done]
2025.08.16 11:56:06.804	2025.01.30 15:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2770.91 آپدیت شد.
2025.08.16 11:56:06.813	2025.01.30 15:15:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2772.12 tp: 2791.10]
2025.08.16 11:56:06.815	2025.01.30 15:15:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2772.12, tp: 2791.10) [done]
2025.08.16 11:56:06.815	2025.01.30 15:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2772.12 آپدیت شد.
2025.08.16 11:56:06.815	2025.01.30 15:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:06.823	2025.01.30 15:30:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2773.97 tp: 2791.10]
2025.08.16 11:56:06.825	2025.01.30 15:30:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2773.97, tp: 2791.10) [done]
2025.08.16 11:56:06.825	2025.01.30 15:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2773.97 آپدیت شد.
2025.08.16 11:56:06.825	2025.01.30 15:30:03   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04084 به لیست اضافه شد.
2025.08.16 11:56:06.835	2025.01.30 15:45:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2774.86 tp: 2791.10]
2025.08.16 11:56:06.837	2025.01.30 15:45:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2774.86, tp: 2791.10) [done]
2025.08.16 11:56:06.837	2025.01.30 15:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2774.86 آپدیت شد.
2025.08.16 11:56:06.837	2025.01.30 15:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:06.849	2025.01.30 16:00:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2775.55 tp: 2791.10]
2025.08.16 11:56:06.851	2025.01.30 16:00:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2775.55, tp: 2791.10) [done]
2025.08.16 11:56:06.851	2025.01.30 16:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2775.55 آپدیت شد.
2025.08.16 11:56:06.853	2025.01.30 16:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04551 به لیست اضافه شد.
2025.08.16 11:56:06.853	2025.01.30 16:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.04288
2025.08.16 11:56:06.853	2025.01.30 16:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:56:06.853	2025.01.30 16:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:06.853	2025.01.30 16:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:56:06.853	2025.01.30 16:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04551 به لیست اضافه شد.
2025.08.16 11:56:06.853	2025.01.30 16:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24622
2025.08.16 11:56:06.853	2025.01.30 16:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:56:06.853	2025.01.30 16:00:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:06.853	2025.01.30 16:00:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:06.952	2025.01.30 16:15:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2776.52 tp: 2791.10]
2025.08.16 11:56:06.954	2025.01.30 16:15:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2776.52, tp: 2791.10) [done]
2025.08.16 11:56:06.954	2025.01.30 16:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2776.52 آپدیت شد.
2025.08.16 11:56:06.954	2025.01.30 16:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.04551) منقضی شد و حذف می‌شود.
2025.08.16 11:56:07.051	2025.01.30 16:30:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2778.36 tp: 2791.10]
2025.08.16 11:56:07.053	2025.01.30 16:30:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2778.36, tp: 2791.10) [done]
2025.08.16 11:56:07.053	2025.01.30 16:30:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2778.36 آپدیت شد.
2025.08.16 11:56:07.053	2025.01.30 16:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03901
2025.08.16 11:56:07.053	2025.01.30 16:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:07.053	2025.01.30 16:30:01   1.03882 , 1.03901
2025.08.16 11:56:07.145	2025.01.30 16:45:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2779.12 tp: 2791.10]
2025.08.16 11:56:07.147	2025.01.30 16:45:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2779.12, tp: 2791.10) [done]
2025.08.16 11:56:07.147	2025.01.30 16:45:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2779.12 آپدیت شد.
2025.08.16 11:56:07.149	2025.01.30 16:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24244
2025.08.16 11:56:07.149	2025.01.30 16:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:07.149	2025.01.30 16:45:01   1.24316 , 1.24244
2025.08.16 11:56:07.160	2025.01.30 17:00:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2780.07 tp: 2791.10]
2025.08.16 11:56:07.162	2025.01.30 17:00:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2780.07, tp: 2791.10) [done]
2025.08.16 11:56:07.162	2025.01.30 17:00:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2780.07 آپدیت شد.
2025.08.16 11:56:07.333	2025.01.30 17:15:00   position modified [#20 buy 0.03 XAUUSD 2744.94 sl: 2780.48 tp: 2791.10]
2025.08.16 11:56:07.335	2025.01.30 17:15:00   CTrade::OrderSend: modify position #20 XAUUSD (sl: 2780.48, tp: 2791.10) [done]
2025.08.16 11:56:07.335	2025.01.30 17:15:00   TSL Manager [12345]: تریلینگ استاپ برای تیکت 20 به قیمت 2780.48 آپدیت شد.
2025.08.16 11:56:07.342	2025.01.30 17:25:36   take profit triggered #20 buy 0.03 XAUUSD 2744.94 sl: 2780.48 tp: 2791.10 [#21 sell 0.03 XAUUSD at 2791.10]
2025.08.16 11:56:07.342	2025.01.30 17:25:36   deal #21 sell 0.03 XAUUSD at 2791.10 done (based on order #21)
2025.08.16 11:56:07.342	2025.01.30 17:25:36   deal performed [#21 sell 0.03 XAUUSD at 2791.10]
2025.08.16 11:56:07.342	2025.01.30 17:25:36   order performed sell 0.03 at 2791.10 [#21 sell 0.03 XAUUSD at 2791.10]
2025.08.16 11:56:07.342	2025.01.30 17:25:37   TSL Manager [12345]: حالت تیکت 20 از لیست تریلینگ حذف شد.
2025.08.16 11:56:07.342	2025.01.30 17:25:37   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:56:07.624	2025.01.30 18:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04676
2025.08.16 11:56:07.624	2025.01.30 18:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:07.624	2025.01.30 18:30:01   1.04288 , 1.04676
2025.08.16 11:56:07.737	2025.01.30 19:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.04157 به لیست اضافه شد.
2025.08.16 11:56:07.749	2025.01.30 20:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24761
2025.08.16 11:56:07.749	2025.01.30 20:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:07.749	2025.01.30 20:00:01   1.24622 , 1.24761
2025.08.16 11:56:07.864	2025.01.30 21:45:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.04094
2025.08.16 11:56:07.864	2025.01.30 21:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:07.864	2025.01.30 21:45:01   1.03901 , 1.04094
2025.08.16 11:56:07.864	2025.01.30 21:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24354
2025.08.16 11:56:07.864	2025.01.30 21:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:07.864	2025.01.30 21:45:01   1.24244 , 1.24354
2025.08.16 11:56:07.967	2025.01.30 22:45:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.04094
2025.08.16 11:56:07.967	2025.01.30 22:45:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:07.967	2025.01.30 22:45:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:56:07.967	2025.01.30 22:45:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:56:07.967	2025.01.30 22:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:07.967	2025.01.30 22:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24354
2025.08.16 11:56:07.967	2025.01.30 22:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:07.967	2025.01.30 22:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:56:07.967	2025.01.30 22:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:08.075	2025.01.30 23:45:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03890 به لیست اضافه شد.
2025.08.16 11:56:08.105	2025.01.31 01:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04323
2025.08.16 11:56:08.105	2025.01.31 01:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:08.105	2025.01.31 01:00:01   1.04676 , 1.04323
2025.08.16 11:56:08.105	2025.01.31 01:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24641
2025.08.16 11:56:08.105	2025.01.31 01:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:08.105	2025.01.31 01:00:01   1.24761 , 1.24641
2025.08.16 11:56:08.105	2025.01.31 01:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24078
2025.08.16 11:56:08.105	2025.01.31 01:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:08.105	2025.01.31 01:00:01   1.24354 , 1.24078
2025.08.16 11:56:08.191	2025.01.31 01:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03863 به لیست اضافه شد.
2025.08.16 11:56:08.205	2025.01.31 02:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03810
2025.08.16 11:56:08.205	2025.01.31 02:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:08.205	2025.01.31 02:30:01   1.04094 , 1.03810
2025.08.16 11:56:08.287	2025.01.31 02:45:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2789.81000
2025.08.16 11:56:08.287	2025.01.31 02:45:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:08.287	2025.01.31 02:45:00   2744.76000 , 2789.81000
2025.08.16 11:56:08.474	2025.01.31 04:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2799.65000
2025.08.16 11:56:08.474	2025.01.31 04:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:08.474	2025.01.31 04:30:00   2763.45000 , 2799.65000
2025.08.16 11:56:08.474	2025.01.31 04:30:03   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04022
2025.08.16 11:56:08.474	2025.01.31 04:30:03   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:08.474	2025.01.31 04:30:03   1.04323 , 1.04022
2025.08.16 11:56:08.474	2025.01.31 04:30:03   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24307
2025.08.16 11:56:08.474	2025.01.31 04:30:03   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:08.474	2025.01.31 04:30:03   1.24641 , 1.24307
2025.08.16 11:56:08.497	2025.01.31 05:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24071
2025.08.16 11:56:08.497	2025.01.31 05:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:08.497	2025.01.31 05:45:01   1.24078 , 1.24071
2025.08.16 11:56:08.497	2025.01.31 05:45:04   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03766
2025.08.16 11:56:08.497	2025.01.31 05:45:04   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:08.497	2025.01.31 05:45:04   1.03810 , 1.03766
2025.08.16 11:56:08.628	2025.01.31 08:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:08.628	2025.01.31 08:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03827
2025.08.16 11:56:08.628	2025.01.31 08:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:08.628	2025.01.31 08:30:01   1.03766 , 1.03827
2025.08.16 11:56:08.628	2025.01.31 08:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03906 به لیست اضافه شد.
2025.08.16 11:56:08.712	2025.01.31 08:45:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03939 به لیست اضافه شد.
2025.08.16 11:56:08.712	2025.01.31 08:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24141
2025.08.16 11:56:08.712	2025.01.31 08:45:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:08.712	2025.01.31 08:45:01   1.24071 , 1.24141
2025.08.16 11:56:08.801	2025.01.31 09:15:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03917 به لیست اضافه شد.
2025.08.16 11:56:08.801	2025.01.31 09:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24307
2025.08.16 11:56:08.801	2025.01.31 09:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:08.801	2025.01.31 09:15:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:08.801	2025.01.31 09:15:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:08.890	2025.01.31 09:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03969 به لیست اضافه شد.
2025.08.16 11:56:08.890	2025.01.31 09:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2799.65000
2025.08.16 11:56:08.890	2025.01.31 09:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:56:08.890	2025.01.31 09:30:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:08.890	2025.01.31 09:30:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:56:08.890	2025.01.31 09:30:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:56:08.890	2025.01.31 09:30:00   market buy 0.04 XAUUSD sl: 2794.01 tp: 2841.58 (2799.73 / 2800.03 / 2799.73)
2025.08.16 11:56:08.890	2025.01.31 09:30:00   deal #22 buy 0.04 XAUUSD at 2800.03 done (based on order #22)
2025.08.16 11:56:08.890	2025.01.31 09:30:00   deal performed [#22 buy 0.04 XAUUSD at 2800.03]
2025.08.16 11:56:08.890	2025.01.31 09:30:00   order performed buy 0.04 at 2800.03 [#22 buy 0.04 XAUUSD at 2800.03]
2025.08.16 11:56:08.892	2025.01.31 09:30:00   CTrade::OrderSend: market buy 0.04 XAUUSD sl: 2794.01 tp: 2841.58 [done at 2800.03]
2025.08.16 11:56:08.892	2025.01.31 09:30:00   XAUUSD: معامله Memento Buy با لات 0.04 با موفقیت باز شد.
2025.08.16 11:56:08.892	2025.01.31 09:30:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:56:08.969	2025.01.31 09:30:01   TSL Manager [12345]: حالت جدید برای تیکت 22 با SL اولیه 2794.01 اضافه شد.
2025.08.16 11:56:08.969	2025.01.31 09:30:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.04022
2025.08.16 11:56:08.969	2025.01.31 09:30:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:08.969	2025.01.31 09:30:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:08.969	2025.01.31 09:30:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:56:08.969	2025.01.31 09:30:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:56:09.090	2025.01.31 10:25:25   stop loss triggered #22 buy 0.04 XAUUSD 2800.03 sl: 2794.01 tp: 2841.58 [#23 sell 0.04 XAUUSD at 2794.01]
2025.08.16 11:56:09.090	2025.01.31 10:25:25   deal #23 sell 0.04 XAUUSD at 2794.00 done (based on order #23)
2025.08.16 11:56:09.090	2025.01.31 10:25:25   deal performed [#23 sell 0.04 XAUUSD at 2794.00]
2025.08.16 11:56:09.090	2025.01.31 10:25:25   order performed sell 0.04 at 2794.00 [#23 sell 0.04 XAUUSD at 2794.01]
2025.08.16 11:56:09.090	2025.01.31 10:25:26   TSL Manager [12345]: حالت تیکت 22 از لیست تریلینگ حذف شد.
2025.08.16 11:56:09.090	2025.01.31 10:25:26   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:56:09.169	2025.01.31 10:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03993 به لیست اضافه شد.
2025.08.16 11:56:09.169	2025.01.31 10:30:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03993) منقضی شد و حذف می‌شود.
2025.08.16 11:56:09.169	2025.01.31 10:30:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03939) منقضی شد و حذف می‌شود.
2025.08.16 11:56:09.186	2025.01.31 11:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03841 به لیست اضافه شد.
2025.08.16 11:56:09.186	2025.01.31 11:00:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03841) منقضی شد و حذف می‌شود.
2025.08.16 11:56:09.186	2025.01.31 11:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.03827
2025.08.16 11:56:09.186	2025.01.31 11:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:09.186	2025.01.31 11:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:56:09.186	2025.01.31 11:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:56:09.186	2025.01.31 11:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03841 به لیست اضافه شد.
2025.08.16 11:56:09.186	2025.01.31 11:00:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03841) منقضی شد و حذف می‌شود.
2025.08.16 11:56:09.186	2025.01.31 11:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24141
2025.08.16 11:56:09.186	2025.01.31 11:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:09.297	2025.01.31 12:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2801.15000
2025.08.16 11:56:09.297	2025.01.31 12:00:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:09.297	2025.01.31 12:00:00   2799.65000 , 2801.15000
2025.08.16 11:56:09.297	2025.01.31 12:00:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04126
2025.08.16 11:56:09.297	2025.01.31 12:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:09.297	2025.01.31 12:00:01   1.04022 , 1.04126
2025.08.16 11:56:09.381	2025.01.31 12:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24393
2025.08.16 11:56:09.381	2025.01.31 12:00:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:09.381	2025.01.31 12:00:01   1.24307 , 1.24393
2025.08.16 11:56:09.390	2025.01.31 12:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:09.396	2025.01.31 12:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03820 به لیست اضافه شد.
2025.08.16 11:56:09.420	2025.01.31 13:30:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03723 به لیست اضافه شد.
2025.08.16 11:56:09.420	2025.01.31 13:30:02   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03652
2025.08.16 11:56:09.420	2025.01.31 13:30:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:09.420	2025.01.31 13:30:02   1.03827 , 1.03652
2025.08.16 11:56:09.421	2025.01.31 13:30:02   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.24007
2025.08.16 11:56:09.421	2025.01.31 13:30:02   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:09.421	2025.01.31 13:30:02   1.24141 , 1.24007
2025.08.16 11:56:09.521	2025.01.31 14:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: شکست سقف در قیمت 2801.15000
2025.08.16 11:56:09.521	2025.01.31 14:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: تشخیص: تغییر ساختار به صعودی (MSS UP)
2025.08.16 11:56:09.521	2025.01.31 14:15:00   XAUUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:09.521	2025.01.31 14:15:00   XAUUSD: ✅ تمام فیلترهای فعال با موفقیت پاس شدند.
2025.08.16 11:56:09.521	2025.01.31 14:15:00   XAUUSD: 🏆 برنده مسابقه پیدا شد: سیگنال خرید
2025.08.16 11:56:09.521	2025.01.31 14:15:00   market buy 0.04 XAUUSD sl: 2795.81 tp: 2844.62 (2801.85 / 2801.99 / 2801.85)
2025.08.16 11:56:09.521	2025.01.31 14:15:00   deal #24 buy 0.04 XAUUSD at 2801.99 done (based on order #24)
2025.08.16 11:56:09.521	2025.01.31 14:15:00   deal performed [#24 buy 0.04 XAUUSD at 2801.99]
2025.08.16 11:56:09.521	2025.01.31 14:15:00   order performed buy 0.04 at 2801.99 [#24 buy 0.04 XAUUSD at 2801.99]
2025.08.16 11:56:09.523	2025.01.31 14:15:00   CTrade::OrderSend: market buy 0.04 XAUUSD sl: 2795.81 tp: 2844.62 [done at 2801.99]
2025.08.16 11:56:09.523	2025.01.31 14:15:00   XAUUSD: معامله Memento Buy با لات 0.04 با موفقیت باز شد.
2025.08.16 11:56:09.523	2025.01.31 14:15:00   XAUUSD: پاکسازی نامزدهای هم‌جهت با برنده انجام شد.
2025.08.16 11:56:09.606	2025.01.31 14:15:01   TSL Manager [12345]: حالت جدید برای تیکت 24 با SL اولیه 2795.81 اضافه شد.
2025.08.16 11:56:09.606	2025.01.31 14:15:01   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:56:09.801	2025.01.31 15:00:00   [MSS Lib][XAUUSD][PERIOD_M15]: کف چرخش جدید: 2791.02000
2025.08.16 11:56:09.801	2025.01.31 15:00:00   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:09.801	2025.01.31 15:00:00   2789.81000 , 2791.02000
2025.08.16 11:56:10.021	2025.01.31 16:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست کف در قیمت 1.24007
2025.08.16 11:56:10.021	2025.01.31 16:15:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:10.154	2025.01.31 17:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24317
2025.08.16 11:56:10.154	2025.01.31 17:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:10.154	2025.01.31 17:30:01   1.24393 , 1.24317
2025.08.16 11:56:10.329	2025.01.31 17:45:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.03951
2025.08.16 11:56:10.329	2025.01.31 17:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:10.329	2025.01.31 17:45:01   1.04126 , 1.03951
2025.08.16 11:56:10.329	2025.01.31 17:45:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:10.421	2025.01.31 18:00:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03959 به لیست اضافه شد.
2025.08.16 11:56:10.421	2025.01.31 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست سقف در قیمت 1.03951
2025.08.16 11:56:10.421	2025.01.31 18:00:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:10.421	2025.01.31 18:00:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:10.421	2025.01.31 18:00:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:56:10.421	2025.01.31 18:00:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03959 به لیست اضافه شد.
2025.08.16 11:56:10.513	2025.01.31 18:15:01   EURUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03959) منقضی شد و حذف می‌شود.
2025.08.16 11:56:10.513	2025.01.31 18:15:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:10.524	2025.01.31 18:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید خرید با سطح ابطال 1.03952 به لیست اضافه شد.
2025.08.16 11:56:10.532	2025.01.31 18:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: شکست سقف در قیمت 1.24317
2025.08.16 11:56:10.532	2025.01.31 18:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS UP)
2025.08.16 11:56:10.532	2025.01.31 18:45:01   GBPUSD: ✅ تاییدیه تایم فریم پایین برای خرید دریافت شد (CHoCH).
2025.08.16 11:56:10.532	2025.01.31 18:45:01   GBPUSD: فیلتر ATR رد شد.
2025.08.16 11:56:10.620	2025.01.31 19:00:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23876
2025.08.16 11:56:10.620	2025.01.31 19:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:10.620	2025.01.31 19:00:01   1.24007 , 1.23876
2025.08.16 11:56:10.726	2025.01.31 19:30:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2817.23000
2025.08.16 11:56:10.726	2025.01.31 19:30:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:10.726	2025.01.31 19:30:00   2801.15000 , 2817.23000
2025.08.16 11:56:10.726	2025.01.31 19:30:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03603
2025.08.16 11:56:10.726	2025.01.31 19:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:10.726	2025.01.31 19:30:01   1.03652 , 1.03603
2025.08.16 11:56:11.021	2025.01.31 20:30:01   GBPUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03810 به لیست اضافه شد.
2025.08.16 11:56:11.021	2025.01.31 20:30:01   GBPUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03810) منقضی شد و حذف می‌شود.
2025.08.16 11:56:11.024	2025.01.31 20:33:28   stop loss triggered #24 buy 0.04 XAUUSD 2801.99 sl: 2795.81 tp: 2844.62 [#25 sell 0.04 XAUUSD at 2795.81]
2025.08.16 11:56:11.024	2025.01.31 20:33:28   deal #25 sell 0.04 XAUUSD at 2795.81 done (based on order #25)
2025.08.16 11:56:11.024	2025.01.31 20:33:28   deal performed [#25 sell 0.04 XAUUSD at 2795.81]
2025.08.16 11:56:11.024	2025.01.31 20:33:28   order performed sell 0.04 at 2795.81 [#25 sell 0.04 XAUUSD at 2795.81]
2025.08.16 11:56:11.024	2025.01.31 20:33:29   TSL Manager [12345]: حالت تیکت 24 از لیست تریلینگ حذف شد.
2025.08.16 11:56:11.024	2025.01.31 20:33:29   داشبورد به دلیل رویداد معاملاتی آپدیت شد.
2025.08.16 11:56:11.203	2025.01.31 21:00:00   XAUUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال 1.03847 به لیست اضافه شد.
2025.08.16 11:56:11.203	2025.01.31 21:00:00   XAUUSD: سیگنال نامزد به دلیل شکست سطح ابطال ساختاری (1.03847) منقضی شد و حذف می‌شود.
2025.08.16 11:56:11.302	2025.01.31 21:30:01   [MSS Lib][EURUSD][PERIOD_M15]: سقف چرخش جدید: 1.04338
2025.08.16 11:56:11.302	2025.01.31 21:30:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:11.302	2025.01.31 21:30:01   1.03951 , 1.04338
2025.08.16 11:56:11.389	2025.01.31 21:45:01   [MSS Lib][GBPUSD][PERIOD_M15]: سقف چرخش جدید: 1.24715
2025.08.16 11:56:11.389	2025.01.31 21:45:01   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:11.389	2025.01.31 21:45:01   1.24317 , 1.24715
2025.08.16 11:56:11.561	2025.01.31 22:15:00   [MSS Lib][XAUUSD][PERIOD_M15]: سقف چرخش جدید: 2816.08000
2025.08.16 11:56:11.561	2025.01.31 22:15:00   POPULATED! New swing high prices data is as below:
2025.08.16 11:56:11.561	2025.01.31 22:15:00   2817.23000 , 2816.08000
2025.08.16 11:56:11.664	2025.01.31 23:00:01   [MSS Lib][EURUSD][PERIOD_M15]: کف چرخش جدید: 1.03612
2025.08.16 11:56:11.664	2025.01.31 23:00:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:11.664	2025.01.31 23:00:01   1.03603 , 1.03612
2025.08.16 11:56:11.753	2025.01.31 23:15:01   EURUSD: [حالت مسابقه‌ای] سیگنال نامزد جدید فروش با سطح ابطال -1.00000 به لیست اضافه شد.
2025.08.16 11:56:11.753	2025.01.31 23:15:01   [MSS Lib][EURUSD][PERIOD_M15]: شکست کف در قیمت 1.03612
2025.08.16 11:56:11.753	2025.01.31 23:15:01   [MSS Lib][EURUSD][PERIOD_M15]: تشخیص: شکست ساده ساختار (BoS DOWN)
2025.08.16 11:56:11.754	2025.01.31 23:15:01   EURUSD: ✅ تاییدیه تایم فریم پایین برای فروش دریافت شد (CHoCH).
2025.08.16 11:56:11.754	2025.01.31 23:15:01   EURUSD: فیلتر ATR رد شد.
2025.08.16 11:56:11.838	2025.01.31 23:30:01   [MSS Lib][GBPUSD][PERIOD_M15]: کف چرخش جدید: 1.23861
2025.08.16 11:56:11.839	2025.01.31 23:30:01   POPULATED! New swing low prices data is as below:
2025.08.16 11:56:11.839	2025.01.31 23:30:01   1.23876 , 1.23861
